{"https://arstechnica.com/gadgets/2024/10/raspberry-pi-oss-years-long-switch-from-x-window-to-wayland-is-now-official/": ["Kevin Purdy", "Raspberry Pi OS’s yearslong switch from X Window to Wayland is now official", ["There have been times when it seemed like X Window System would be with us forever, even though it's , and the last true version . But with great effort, some organizations and operating systems have moved on. Raspberry Pi has now joined the forward momentum, with  swapping in Wayland—and it's hoping the change is hardly noticeable.", "You might want to wait a moment before upgrading, though.", "Simon Long wrote on Raspberry Pi's blog that the organization started thinking about switching to  about 10 years ago, though it was \"nowhere near ready to use\" back then. Over the last few years, the Pi team has done some things to prep a real switch:", "Because labwc is built on , a modular system that allows for building a Wayland compositor without whole-cloth reinvention, it was easier to adapt to Raspberry Pi's needs. After efforts throughout 2024, the team is ready to call it the year of Wayland on Raspberry Pi desktops.", "\"After much optimisation for our hardware, we have reached the point where labwc desktops run just as fast as X on older Raspberry Pi models,\" Long wrote. \"Today, we make the switch with our latest desktop image: Raspberry Pi Desktop now runs Wayland by default across all models.\"", "Those updating their Pi desktop after today (maybe with a bit of cautionary waiting) will receive a prompt notifying them of the option to switch to labwc, and the board maker suggests most people do so; there will be no more support or updates for the wayfire system in future updates. The only real change is the loss of \"a couple of animations\" not yet rebuilt for labwc. Older-model Pis should be OK, too, through use of a compatibility tool, Xwayland, running inside labwc. If something goes awry, the blog post has details on how to switch back to X.", "In addition to that multi-year effort resulting in a single button click for users, Raspberry Pi claims to have significantly improved touchscreen support in the newest desktop releases. When a touchscreen is detected and text input is requested, the desktop should now show a virtual keyboard at screen bottom, or at least provide the icon in the upper-right taskbar. A long-press on a screen should also now automatically translate to a right mouse click, and double taps are double clicks.", "Raspberry Pi's blog post has  beyond the big, quiet update. There are a number of people in the comments of Raspberry Pi's blog post saying that the earliest adopters were dropped back to a blinking cursor after upgrade due to an issue with lab-wc not being installed.  early on Monday."]], "https://arstechnica.com/gadgets/2024/10/for-the-first-time-beloved-ide-jetbrains-rider-will-be-available-for-free/": ["Samuel Axon", "For the first time, beloved IDE JetBrains Rider will be available for free", ["The integrated development environment (IDE) Rider by JetBrains is now available for free for the first time ever.", "After trialing non-commercial free licenses with other products like RustRover and Aqua, JetBrains has introduced a similar option for Rider. It also says this is a permanent situation, not a limited-time initiative.", "In a  announcing the change, JetBrains' Ekaterina Ryabukha acknowledges that there are numerous cases where people use an IDE without any commercial intent—for example, hobbyists, open source developers, and educators or students. She also cites a Stack Overflow survey that 68 percent of professional developers \"code outside of work as a hobby.\"", "Rider has always been a bit niche, but it's often beloved by those who use it. Making it free could greatly expand its user base, and it could also make it more popular in the long run because learners could start with it without having to pay an annual fee, and some learners go pro.", "It's also good news for some macOS developers, as Microsoft not long ago chose to end support for Visual Studio on that platform. Yes, you can use VS Code, Xcode, or other options, but there were some types of projects that were left in the lurch, especially for developers who don't find VS Code robust enough for their purposes.", "There is one drawback that might matter to some: users working in Rider on the non-commercial free license \"cannot opt out of the collection of anonymous usage statistics.\"", "There are some edge cases that are in a bit of a gray area when it comes to using a free license versus a paid one. Sometimes, projects that start without commercial intent can become commercial later on. JetBrains simply says that \"if your intentions change over time, you’ll need to reassess whether you still qualify for non-commercial use.\""]], "https://arstechnica.com/gadgets/2024/10/fake-restaurant-tips-on-reddit-a-reminder-of-google-ai-overviews-inherent-flaws/": ["Scharon Harding", "Annoyed Redditors tanking Google Search results illustrates perils of AI scrapers", ["A trend on Reddit that sees Londoners giving false restaurant recommendations in order to keep their favorites clear of tourists and social media influencers highlights the inherent flaws of Google Search’s reliance on Reddit and Google's AI Overview.", "In May, Google launched AI Overviews in the US, an experimental feature that populates the top of Google Search results with a summarized answer based on an AI model built into Google’s web rankings. When Google first debuted AI Overview, it quickly became apparent that the feature  and its ability to properly summarize information from online sources. AI Overviews are “built to only show information that is backed up by top web results,\" Liz Reid, VP and head of Google Search, wrote in a May . But as my colleague Benj Edwards  at the time, that setup could contribute to inaccurate, misleading, or even dangerous results: “The design is based on the false assumption that Google's page-ranking algorithm favors accurate results and not SEO-gamed garbage.\"", "As Edwards alluded to, many have complained about Google Search results' quality declining in recent years, as  and, more recently, AI slop float to the top of searches. As a result, people often turn to the  to make Google results more helpful. By adding \"site:reddit.com” to search results, users can hone their search to more easily find answers from real people. Google seems to understand the value of Reddit and signed an the company that’s reportedly worth $60 million per year.", "But disgruntled foodies in London are reminding us of the inherent dangers of relying on the scraping of user-generated content to provide what’s supposed to be factual, helpful information.", "Apparently, some London residents are getting fed up with social media influencers whose reviews make long lines of tourists at their favorite restaurants, sometimes just for the likes. Christian Calgie, a reporter for London-based news publication Daily Express, pointed out this trend on  yesterday, noting the boom of Redditors referring people to Angus Steakhouse, a chain restaurant, to combat it.", "As  deduced, the trend seemed to start on the r/London subreddit, where a user  about a spot in Borough Market being “ruined by influencers” on Monday:", "\"Last 2 times I have been there has been a queue of over 200 people, and the ones with the food are just doing the selfie shit for their [I]nsta[gram] pages and then throwing most of the food away.\"", "As of this writing, the post has 4,900 upvotes and numerous responses suggesting that Redditors talk about how good Angus Steakhouse is so that Google picks up on it. Commenters quickly understood the assignment.", "\"Agreed with other posters Angus steakhouse is absolutely top tier and tourists shoyldnt [sic] miss out on it,” one Redditor wrote.", "Another Reddit user wrote:", "Spreading misinformation suddenly becomes a noble goal.", "As of this writing, asking Google for the best steak, steakhouse, or steak sandwich in London (or similar) isn't generating an AI Overview result for me. But when I searched for the best steak sandwich in London, the top result is from Reddit, including a thread from four days ago titled “Which Angus Steakhouse do you recommend for their steak sandwich?” and one from two days ago titled “Had to see what all the hype was about, best steak sandwich I’ve ever had!” with a picture of an Angus Steakhouse.", "“Perfect place for an influencer. Top notch beef from Angus, what a guy,” a commenter on the forum thread said, hinting at the post's sarcastic nature.", "Again, at this point the Angus Steakhouse hype doesn’t appear to have made it into AI Overview. But it is appearing in Search results. And while this is far from being a dangerous attempt to manipulate search results or AI algorithms, it does highlight the pitfalls of Google results becoming dependent on content generated by users who could very easily have intentions other than providing helpful information. This is also far from the first time that online users, including on platforms outside of Reddit, have publicly declared plans to make inaccurate or misleading posts in an effort to thwart AI scrapers.", "This also presents an interesting position for Reddit, which is banking heavily on AI deals to help it become profitable. In an interview with  published today,  Steve Huffman said that he believes Reddit has some of the world’s best AI training data.", "When asked if he fears “low quality, shallow content generated by AI” will make its way onto Reddit, Huffman answered, in part, that the source of AI is “actual intelligence,” and that “there’s a general lowering of quality on the internet because more content is written by AI. But I think that actually makes Reddit stand out more as the place where there’s all of this human content. What people want is to hear from other people.”", "But perhaps another area worth contemplating for stakeholders like Google, OpenAI (which also has , and Reddit is what it means when low-quality content generated by humans is used to train AI models as if it were fact.", "em>Advance Publications, which owns Ars Technica parent Condé Nast, is the largest shareholder of Reddit.</em"]], "https://arstechnica.com/gadgets/2024/10/what-i-learned-from-3-years-of-running-windows-11-on-unsupported-pcs/": ["Andrew Cunningham", "What I learned from 3 years of running Windows 11 on “unsupported” PCs", [" in October 2025. We've explained why that's a big deal, and we have a  (recently updated to account for changes in Windows 11 24H2) so you can keep getting security updates, whether you're on an officially supported PC or not.", "But this is more than just a theoretical exercise; I've been using Windows 11 on some kind of \"unsupported\" system practically since it launched to stay abreast of what the experience is actually like and to keep tabs on whether Microsoft would make good on its threats to pull support from these systems at any time.", "Now that we're three years in, and since I've been using Windows 11 24H2 on a 2012-era desktop and laptop as my primary work machines on and off for a few months now, I can paint a pretty complete picture of what Windows 11 is like on these PCs. As the Windows 10 update cliff approaches, it's worth asking: Is running \"unsupported\" Windows 11 a good way to keep an older but still functional machine running, especially for non-technical users?", "I've run Windows 11 on a fair amount of old hardware, including PCs as old as a late XP-era Core 2 Duo Dell Inspiron desktop. For the first couple of years, I ran it most commonly on an old Dell XPS 13 9333 with a Core i5-4250U and 8GB of RAM and a Dell Latitude 3379 2-in-1 that just barely falls short of the official requirements (both systems are also pressed into service for ChromeOS Flex testing periodically).", "But I've been running the 24H2 update as my main work OS on two machines. The first is a Dell Optiplex 3010 desktop with a 3rd-generation Core i5-3xxx CPU, which had been my mother's main desktop until I upgraded it a year or so ago. The second is a Lenovo ThinkPad X230 with a i5-3320M inside, a little brick of a machine that I picked up for next to nothing on Goodwill's online auction site.", "Both systems, and the desktop in particular, have been upgraded quite a bit; the laptop has 8GB of RAM while the desktop has 16GB, both are running SATA SSDs, and the desktop has a low-profile AMD Radeon Pro WX2100 in it, a cheap way to get support for running multiple 4K monitors. The desktop also has USB Wi-Fi and Bluetooth dongles and an internal expansion card that provides a pair of USB 3.0 Type-A ports and a single USB-C port. Systems of this vintage are pretty easy to refurbish since components are old enough that they've gone way down in price but not <em>so</em> old that they've become rare collectors' items. It's  to get a usable computer for $100—or for free if you know where to look.", "And these systems were <em>meant</em> to be maintained and upgraded. It's one of the beautiful things about a standardized PC platform, though these days we've given a lot of that flexibility up in favor of smaller, thinner devices and larger batteries. It is <em>possible</em> to upgrade and refurbish these 12-year-old computers to the point that they run modern operating systems well because they were designed to leave room for that possibility.", "But no matter how much you upgrade any of these PCs or how well you maintain them, they will never meet Windows 11's official requirements. That's the problem.", "Depending on how you do it, it can be a minor pain to get Windows 11 up and running on a computer that doesn't natively support it. But once the OS is installed, Microsoft's early warnings about instability and the possible ending of updates have proven to be mostly unfounded.", "A Windows 11 PC will still grab all of the same drivers from Windows Update as a Windows 10 PC would, and any post-Vista drivers have at least a <em>chance</em> of working in Windows 11 as long as they're 64-bit. But Windows 10 was widely supported on hardware going back to the turn of the 2010s. If it shipped with Windows 8 or even Windows 7, your hardware should mostly work, give or take the occasional edge case. I've yet to have a catastrophic crash or software failure on any of the systems I'm using, and they're all from the 2012–2016 era.", "Once Windows 11 is installed, routine software updates and app updates from the Microsoft Store are downloaded and installed on my \"unsupported\" systems the same way they are on my \"supported\" ones. You don't have to think about how you're running an unsupported operating system; Windows remains Windows. That's the big takeaway here—if you're happy with the performance of your unsupported PC under Windows 10, nothing about the way Windows 11 runs will give you problems.", "There's one exception for the PCs I've had running unsupported Windows 11 installs in the long term: They don't want to automatically download and install the yearly feature updates for Windows. So a 22H2 install will keep downloading and installing updates for as long as they're offered, but it <em>won't</em> offer to update itself to versions 23H2 or 24H2.", "This behavior may be targeted specifically at unsupported PCs, or it may just be a byproduct of how Microsoft rolls out these yearly updates (if you have a supported system with a known hardware or driver issue, for example, Microsoft will withhold these updates until the issues are resolved). Either way, it's an irritating thing to have to deal with every year or every other year—Microsoft supports most of its annual updates . So 23H2 and 24H2 are currently supported, while 22H2 and 21H2 (the first release of Windows 11) are at the end of the line.", "This essentially means you'll need to repeat the steps for doing a new unsupported Windows 11 install every time you want to upgrade. , that's <em>relatively</em> simple if your PC has Secure Boot and a TPM but doesn't have a supported processor. Make a simple registry tweak, download the Installation Assistant or an ISO file to run Setup from, and the Windows 11 installer will let you off with a warning and then proceed normally, leaving your files and apps in place.", "Without Secure Boot or a TPM, though, installing these upgrades in place is more difficult. Trying to run an upgrade install from within Windows just means the system will yell at you about the things your PC is missing. Booting from a USB drive that has been doctored to overlook the requirements will help you do a clean install, but it will delete all your existing files and apps.", "If you're running into this problem and still want to try an upgrade install, there's one more workaround you can try.", "You'll notice that the subsequent setup screens all say they're \"installing Windows Server\" rather than the regular version of Windows, but that's not actually true—the Windows image that comes with these ISO files is still regular old Windows 11, and that's what the installer is using to upgrade your system. It's just running a Windows Server-branded version of the installer that apparently isn't making the same stringent hardware checks that the normal Windows 11 installer is.", "This workaround allowed me to do an in-place upgrade of Windows 11 24H2 onto a Windows 10 22H2 PC with no TPM enabled. It should also work for upgrading an older version of Windows 11 to 24H2.", "Having to go out of your way to keep Windows 11 up to date on an unsupported PC is a fairly major pain. But unless your hardware is exceptionally wretched (I wouldn't recommend trying to get by with less than 4GB of RAM at an absolute bare minimum, or with a spinning hard drive, or with an aging low-end N-series Pentium or Celeron chip), you'll find that decade-old laptops and desktops can still hold up pretty well when you're sticking to light or medium-sized workloads.", "I haven't found this surprising. Major high-end CPU performance improvements have come in fits and starts over the last decade, and today's (Windows 11-supported) barebones bargain basement Intel N100 PCs perform a lot like decade-old mainstream quad-core desktop processors.", "With its RAM and GPU updates, my Optiplex 3010 and its Core i5 worked pretty well with my normal dual-4K desktop monitor setup (it couldn't drive my Gigabyte M28U at higher than 60 Hz, but that's a GPU limitation). Yes, I could feel the difference between an aging Core i5-3475S and the Core i7-12700 in my regular Windows desktop, and it didn't take much at all for CPU usage to spike to 100 percent and stay there, always a sign that your CPU is holding you back. But once apps were loaded, they felt responsive, and I had absolutely no issues writing, recording and editing audio, and working in Affinity Photo on the odd image or two.", "I wouldn't recommend using this system to play games, nor would I recommend overpaying for a brand-new GPU to pair with an older quad-core CPU like this one (I chose the GPU I did specifically for its display outputs, not its gaming prowess). If you wanted to, you could still probably get respectable midrange gaming performance out of a 4th-, 6th-, or 7th-gen Intel Core i5 or i7 or a first-generation AMD Ryzen CPU paired with a GeForce RTX 4060 or 3060, or a Radeon RX 7600. Resist the urge to overspend, consider used cards as a way to keep costs down, and check your power supply before you install anything—the years-old 300 W power supply in a cheap Dell office desktop will need to be replaced before you can use it with any GPU that has an external power connector.", "My experience with the old Goodwill-sourced ThinkPad was also mostly pretty good. It had both Secure Boot and a TPM, making installation and upgrades easier. The old fingerprint sensor (a slow and finicky swipe-to-scan sensor) and its 2013-era driver even support Windows Hello. I certainly minded the cramped, low-resolution screen—display quality and screen-to-bezel ratio being the most noticeable changes between a 12-year-old system and a modern one—but it worked reliably with a new battery in it. It even helped me focus a bit at work; a 1366×768 screen just doesn't invite heavy multitasking.", "That brings me to my biggest word of warning.", "If you want to run Windows 11 on an older desktop, one where the computer is just a box that you plug stuff into, the age of the hardware isn't all that much of a concern. Upgrading components is easier whether you're talking about a filthy keyboard, a failing monitor, or a stick of RAM. And you don't need to be concerned as much with power use or battery life.", "But for laptops? Let me tell you, there are things about using a laptop from 2012 that you don't want to remember.", "Three important dividing lines: In 2013, Intel's 4th-generation Haswell processors gave huge battery life boosts to laptops thanks to lower power use when idle and the ability to switch more quickly between active and idle states. In 2015, Dell introduced the first with a slim-bezeled design (though it would be some years before it would fix the bottom-mounted up-your-nose webcam), which is probably the single most influential laptop design change since the MacBook Air. And around the same time (though it's hard to pinpoint an exact date), more laptops  rather than using finicky, inconsistent third-party drivers, making PC laptop touchpads considerably less annoying than they had been up until that point.", "And those aren't the only niceties that have become standard or near-standard on midrange and high-end laptops these days. We also have high-resolution, high-density displays; the adoption of taller screen aspect ratios like 16:10 and 3:2, giving us more vertical screen space to use; USB-C charging, replacing the need for proprietary power bricks; and backlit keyboards!", "The ThinkPad X230 I bought doesn't have a backlit keyboard, but it <em>does</em> have a bizarre little booklight next to the webcam that shines down onto the keyboard to illuminate it. This is sort of neat if you're already the kind of person inclined to describe janky old laptops as \"neat,\" but it's not as practical.", "Even if you set aside degraded, swollen, or otherwise broken batteries and the extra wear and tear that comes with portability, a laptop from the last three or four years will have a ton of useful upgrades and amenities aside from extra speed. That's not to say that older laptops can't be useful because they obviously can be. But it's also a place where an upgrade can make a bigger difference than just getting you Windows 11 support.", "Windows 11's system requirements were controversial in part because they were  like TPM 2.0 modules, hypervisor-protected code integrity (HVCI), and mode-based execution control (MBEC). A TPM module makes it possible to seamlessly encrypt your PC's local storage, , while HVCI helps to isolate data in memory from the rest of the operating system to make it harder for malicious software to steal things (MBEC is just a CPU technology that speeds up HVCI, which can come with a hefty performance penalty on older systems).", "Aside from those specific security features, there are other concerns when using old PCs, some of the same ones we've discussed in macOS as Apple has wound down support for Intel Macs. Microsoft's patches can protect against software security vulnerabilities in Windows, and they can provide some partial mitigations for firmware-based vulnerabilities since even fully patched and fully supported systems won't always have all the latest BIOS fixes installed.", "But software can't patch everything, and even the best-supported laptops with 5th- or 6th-generation Core CPUs in them will be a year or two past the days when they could expect new BIOS updates or driver fixes.", "The PC companies and motherboard makers make some of these determinations; cheap consumer laptops tend to get less firmware and software support regardless of whether Intel or AMD are fixing problems on their ends. But Intel (for example) stops supporting its CPUs altogether  (support ended for 7th-generation CPUs in March). For any vulnerabilities discovered after that, you're on your own, or you have to trust in software-based mitigations.", "I don't want to overplay the severity or the riskiness of these kinds of security vulnerabilities. Lots of firmware-level security bugs are the kinds of things that are exploited by sophisticated hackers targeting corporate or government systems—not necessarily everyday people who are just using an old laptop to check their email or do their banking. If you're using good everyday security hygiene otherwise—using strong passwords or passkeys, two-factor authentication, and disk encryption (all things you should already be doing in Windows 10)—an old PC will still be reasonably safe and secure.", "If you have a Windows 10 PC that is still working well or that you can easily upgrade to give it a new lease on life, <em>and</em> you don't want to pay whatever Microsoft is planning to charge for continued Windows 10 update support, installing Windows 11 may be the path of least resistance for you despite the installation and update hurdles.", "Especially for PCs that only miss the Windows 11 support cutoff by a year or two, you'll get an operating system that still runs reasonably well on your PC, should still support all of your hardware, and will continue to run the software you're comfortable with. Yes, the installation process for Windows' annual feature updates is more annoying than it should be. But if you're just trying to squeeze a handful of years out of an older PC, it might not be an issue you have to deal with very often. And though Windows 11 is different from Windows 10, it doesn't come with the same learning curve that switching to an alternate operating system like ChromeOS Flex or Linux would.", "Eventually, these PCs will age out of circulation, and the point will be moot. But even three years into Windows 11's life cycle, I can't help but feel that the system requirements could stand to be relaxed a bit. That ship sailed a long time ago, but given how many PCs are still running Windows 10 less than a year from the end of guaranteed security updates, expanding compatibility is a move Microsoft could consider to close the adoption gap and bring more PCs along.", "Even if that doesn't happen, try running Windows 11 on an older but still functional PC sometime. Once you  to rein in some of modern Microsoft's worst design impulses, I think you'll be pleasantly surprised."]], "https://arstechnica.com/apple/2024/10/apple-teases-week-of-announcements-about-the-mac-starting-on-monday/": ["Andrew Cunningham", "Apple teases “week of announcements” about the Mac starting on Monday", ["Apple has released new iPhones, new Apple Watches, a new iPad mini, and a flotilla of software updates this fall, but Mac hardware has gone unmentioned so far. That's set to change next week, according to  from Apple Worldwide Marketing SVP Greg Joswiak earlier today.", "Imploring readers to \"Mac [sic] their calendars,\" Joswiak's post teases \"an exciting week of announcements ahead, starting on Monday morning.\" If the wordplay wasn't enough, an attached teaser video with a winking neon Mac logo drives the point home.", "Though Joswiak's post was light on additional details, months of reliable rumors have told us the most likely things to expect: refreshed MacBook Pros and 24-inch iMacs with few if any external changes but new Apple M4-series chips on the inside, plus a new M4 Mac mini with a substantial design overhaul. The MacBook Pros and iMacs were  almost exactly a year ago, but the Mac mini was .", "The new Mac mini will allegedly be closer in size to an Apple TV and is said to be slightly taller than current Mac minis but with a smaller footprint. The new design will continue to include a space-saving internal power supply rather than relying on an external power brick, but it will also rely more heavily on USB-C/Thunderbolt ports to save space, cutting down on the number of other ports. At least some models will also include USB-C ports on the front, a design change inherited from the Mac Studio.", "Apple's M4 has been shipping for months, but it debuted in the iPad Pro, not in a Mac. It's the first time since the Mac switched to Apple Silicon that a new M-series chip had launched in anything other than a Mac.", "We already have some idea of how the M4 will perform from the iPad Pro—in , we found roughly 20 percent faster CPU performance and 13 percent faster GPU performance. But M4 chips in any MacBook Pro or Mac mini will likely have active cooling fans and more substantial heatsinks, which could improve performance for some tasks. And any M4 Pro, Max, or Ultra chips that Apple releases will include more CPU and GPU cores than the regular M4, boosting performance even further.", "The new Macs will likely launch alongside the first wave of Apple Intelligence features in macOS Sequoia; Apple published release candidate builds of the iOS 18.1 and macOS 15.1 updates to developers earlier this week. These updates include notification summaries and some tools for automating responses to emails and texts. The company also released the first preview builds for the iOS 18.2 and macOS 15.2 updates this week, which include most of the promised image-generation features. Apple Intelligence features are only supported on very recent iPhones—either the iPhone 15 Pro, the iPhone 16, or the iPhone 16 Pro—but they'll run on all Apple Silicon Macs going all the way back to the 2020 M1 MacBook Air and Mac mini."]], "https://arstechnica.com/information-technology/2024/10/russian-coders-removed-from-linux-maintainers-list-due-to-sanction-concerns/": ["Kevin Purdy", "Removal of Russian coders spurs debate about Linux kernel’s politics", ["\"Remove some entries due to various compliance requirements. They can come back in the future if sufficient documentation is provided.\"", "That , submitted by major Linux kernel maintainer Greg Kroah-Hartman, accompanied a patch that removed about a dozen names from the kernle's MAINTAINERS file. \"Some entries\" notably had either Russian names or .ru email addresses. \"Various compliance requirements\" was, in this case, sanctions against Russia and Russian companies, stemming from that country's invasion of Ukraine.", "This merge did not go unnoticed. Replies on the kernel mailing list asked about this \"very vague\" patch. Kernel developer James Bottomley  that \"we\" (seemingly speaking for Linux maintainers) had \"actual advice\" from Linux Foundation counsel. Employees of companies on the Treasury Department's Office of Foreign Assets Control list of Specially Designated Nationals and Blocked Persons (), or connected to them, will have their collaborations \"subject to restrictions,\" and \"cannot be in the MAINTAINERS file.\" \"Sufficient documentation\" would mean evidence that someone does not work for an OFAC SDN entity, Bottomley wrote.", "There followed a number of messages questioning the legitimacy, suddenness, potentially US-forced, and non-reviewed nature of the commit, along with broader questions about the separation of open source code from international politics. Linux creator  with, \"Ok, lots of Russian trolls out and about.\" He wrote: \"It's entirely clear why the change was done\" and noted that \"Russian troll factories\" will not revert it and that \"the 'various compliance requirements' are not just a US thing.", "\"As to sending me a revert patch - please use whatever mush you call brains. I'm Finnish. Did you think I'd be *supporting* Russian aggression? Apparently it's not just lack of real news, it's lack of history knowledge too,\" Torvalds wrote before signing off.  that he would not go into the details that kernel maintainers \"were told by lawyers,\" and would not \"start discussing legal issues with random internet people,\" which he suspected \"are paid actors and/or have been riled up by them.\"", "The majority of those dropped from the maintainers file work on drivers for hardware from Acer, Cirrus, and, notably, Baikal, a fabless chipmaker that tried to develop Russian-designed ARM CPUs and . One of the removed Russian developers, Serge Semin, whose  indicates having worked for the sanctioned Russian tech firm Baikal, , describing himself as a \"volunteer and hobbyist.\"", "Sanctions against Russia and its businesses have come up against Linux kernel maintenance before. Last year, , networking patches submitted by developers associated with Baikal were refused by one subsystem maintainer, but other Baikal-sourced patches were accepted upstream elsewhere in the kernel.  have had .", "For now, prior contributions from those Russian coders removed from the maintainers list remain in the kernel. Ars reached out to the Linux Foundation for comment and will update this post with its response."]], "https://arstechnica.com/gadgets/2024/10/ios-18-2-developer-beta-adds-chatgpt-and-image-generation-features/": ["Samuel Axon", "iOS 18.2 developer beta adds ChatGPT and image-generation features", ["Today, Apple released the first developer beta of iOS 18.2 for supported devices. This beta release marks the first time several key AI features that Apple teased at its developer conference this June are available.", "Apple is marketing a wide range of generative AI features under the banner \"Apple Intelligence.\" Initially, Apple Intelligence was planned to release as part of iOS 18, but some features slipped to iOS 18.1, others to iOS 18.2, and a few still to future undisclosed software updates.", "iOS 18.1 has been in beta for a while and includes improvements to Siri, generative writing tools that help with rewriting or proofreading, smart replies for Messages, and notification summaries. That update is expected to reach the public next week.", "Today's developer update, iOS 18.2, includes some potentially more interesting components of Apple Intelligence, including Genmoji, Image Playground, Visual Intelligence with Camera Control, and ChatGPT integration.", "Genmoji and Image Playground allow users to generate images on-device to send to friends in Messages; there will be Genmoji and Image Playground APIs to allow third-party messaging apps to work with Genmojis, too.", "ChatGPT integration allows Siri to pass off user queries that are outside Siri's normal scope to be answered instead by OpenAI's ChatGPT. A ChatGPT account is not required, but logging in with an existing account gives you access to premium models available as part of a ChatGPT subscription. If you're using these features without a ChatGPT account, OpenAI won't be able to retain your data or use it to train models. If you connect your ChatGPT account, though, then OpenAI's privacy policies will apply for ChatGPT queries instead of Apple's.", "Genmoji and Image Playground queries will be handled locally on the user's device, but other Apple Intelligence features may dynamically opt to send queries to the cloud for computation.", "There's no word yet on when iOS 18.2 will be released publicly."]], "https://arstechnica.com/gadgets/2024/10/nfl-player-illegally-streams-his-own-teams-game-garners-mostly-sympathy/": ["Kevin Purdy", "Few truly shocked that NFL player used illegal stream to watch his own team", ["Trying to  is a fiendish logistics puzzle, one that doesn't even have a \"just pay for it\" shortcut.", "You can , but that only covers games on Sunday and only those not shown in your local TV market. You can pay for cable or set up an HDTV antenna, but you have to hope it catches NBC, CBS, and Fox for Sunday games (if your local station chooses to carry your team), and for Monday night games, ABC (though most are on ESPN and some even exclusive to ESPN+). Thursday nights? That's Amazon Prime.", "Oh, and this year's Christmas Day games are on Netflix. And the games played in London and Germany are on the NFL Network, which requires either cable or an NFL+ subscription. And Peacock also had that one game in Brazil and is getting another playoff game this year. Many of these games get broadcast options in their home regions, though that doesn't much help ex-pat fans.", "All that is to say that it's not wild to see injured Seattle Seahawks cornerback Tariq Woolen  (seemingly ). You can put that next to his salary of more than $1 million per year, as , and look for obvious chuckles.", "But even with a lot of income at his disposal, streaming a game is just not very easy, even if you play for an NFL team. Witness the numerous knowing and sympathetic replies to , along with reprimands for revealing his reliable stream source.", "If Woolen was in Seattle during the game, he would have needed access to Fox to watch the game against Atlanta, . That could have meant watching Fox on cable, an over-the-air broadcast, or Fox Sports' website.", "Had Woolen been visiting his native Fort Worth, Texas, the local Fox affiliate likely would have been showing Detroit playing Minnesota. This would have meant purchasing a streaming service subscription to view the Seahawks (or, realistically, signing up for a free trial) after doing considerable research to determine the rules around local blackouts.", "Woolen is actually lucky, presuming he only wants to watch his own team. A Sunday Ticket or similar package, or good Fox reception, would have carried Woolen through the next six weeks of Seahawks games (one of them a bye week) and then again until the Seahawks play Arizona on December 8 on CBS. On December 29, a Thursday, he would need a local broadcast or Amazon Prime to watch.", "Of course, Woolen would waste a good portion of the cost of any streaming or cable package once he actually returns to his team and is playing games instead of watching.", "So Woolen could do that kind of location/network/price/date work to find the best legal broadcast option. Or, as suggested by  for that Sunday, turn to any one of dozens of pirate streams of the Seattle game available that day, including the MethStreams service he ended up on.", "br/>\nThese streams tend to stay up, because removal measures by broadcast networks and sports leagues are not all that effective, by their own admission. The UFC, NBA, and NFL have asked the US Patent and Trademark Office to update the Digital Millennium Copyright Act to allow for infringing content to be removed \".\"", "Currently, service providers like Google \"frequently take hours or even days to remove content in response to takedown notices,\" the sports leagues claim, which makes such takedowns beside the point when they arrive after a live event is over.", "Woolen himself may not have a larger argument with availability versus prices. Responding to Kleiman's salary/streaming call-out, : \"It's free it's for me,\" prepended by two \"\" emoji. But even if the NFL wanted to provide players like him with a legitimate option to stream every game, from anywhere in the US, on any given day, it could not, because it does not exist."]], "https://arstechnica.com/gadgets/2024/10/report-arm-cancels-qualcomms-architecture-license-endangering-its-chip-business/": ["Andrew Cunningham", "Report: Arm cancels Qualcomm’s architecture license, endangering its chip business", ["Any company that makes Arm chips must license technology from Arm Holdings plc, the British company that develops the instruction set. Companies can license the instruction set and create their own CPU designs or license one of Arm's ready-made Cortex CPU core designs to incorporate into their own chips.", "Bloomberg  that Arm is canceling Qualcomm's license, an escalation of a fight that began in late 2022 when Arm sued Qualcomm over . Arm has given Qualcomm 60 days' notice of the cancellation, giving the companies two months to come to some kind of agreement before Qualcomm is forced to stop manufacturing and selling its Arm chips.", "\"This is more of the same from ARM—more unfounded threats designed to strongarm a longtime partner, interfere with our performance-leading CPUs, and increase royalty rates regardless of the broad rights under our architecture license,\" a Qualcomm spokesperson told Ars. \"With a trial fast approaching in December, Arm’s desperate ploy appears to be an attempt to disrupt the legal process, and its claim for termination is completely baseless. We are confident that Qualcomm’s rights under its agreement with Arm will be affirmed. Arm’s anticompetitive conduct will not be tolerated.”", "Qualcomm bought Nuvia to assist with developing high-performance Arm chips that could compete with x86 chips from Intel and AMD as well as Apple Silicon chips in iPhones and Macs—Nuvia was founded by people who had headed up Apple's chip design team for years. Arm claimed that the acquisition \"caused Nuvia to breach its Arm licenses,\" and Arm demanded that Qualcomm and Nuvia destroy any designs that Nuvia had created pre-acquisition.", "This apparently didn't happen; Qualcomm's flagship Oryon CPU cores are at the heart of the just-announced  processor for flagship phones and the Snapdragon X Elite and Plus chips that have been shipping in  and many other Windows PCs that launched this summer.", "Qualcomm's shift to using Nuvia's designs means that Arm could make less money from the partnership than it used to. Since 2015, Qualcomm's flagship chips had all used versions of a CPU architecture called , a \"semi-custom\" design that was largely based on Arm's Cortex CPU cores. Arm offers multiple licensing programs, but  companies only pay for \"the IP included in the final SoC design,\" so a company licensing both the Arm instruction set <em>and</em> Arm CPU designs is obviously more attractive for Arm than a company that simply uses the instruction set in its own custom CPUs.", "em>This article was updated with a statement from Qualcomm. </em", "em>This article was updated with a statement from Qualcomm. </em"]], "https://arstechnica.com/gadgets/2024/10/212-million-contract-will-finally-get-san-francisco-trains-off-floppy-disks/": ["Scharon Harding", "San Francisco to pay $212 million to end reliance on 5.25-inch floppy disks", ["The San Francisco Municipal Transportation Agency (SFMTA) board has agreed to spend $212 million to get its Muni Metro light rail off floppy disks.", "The Muni Metro’s Automatic Train Control System (ATCS) has required  since 1998, when it was installed at San Francisco’s Market Street subway station. The system uses three floppy disks for loading DOS software that controls the system’s central servers. Michael Roccaforte, an SFMTA spokesperson, gave further details on how the light rail operates to Ars Technica in April, saying: “When a train enters the subway, its onboard computer connects to the train control system to run the train in automatic mode, where the trains drive themselves while the operators supervise. When they exit the subway, they disconnect from the ATCS and return to manual operation on the street.\" After starting initial planning in 2018, the SFMTA originally expected to move to a floppy-disk-free train control system by 2028. But with COVID-19 preventing work for 18 months, the estimated completion date was delayed.", "On October 15, the SFMTA moved closer to ditching floppies when its board approved a contract with Hitachi Rail for implementing a new train control system that doesn't use floppy disks,  reported. Hitachi Rail tech is said to power train systems, including Japan’s bullet train, in more than 50 countries. The $212 million contract includes support services from Hitachi for \"20 to 25 years,\" the Chronicle said.", "The new control system is supposed to be five generations ahead of what Muni is using now, Muni director Julie Kirschbaum said, per the Chronicle. Further illustrating the light rail's dated tech, the current ATCS was designed to last 20 to 25 years, meaning its expected expiration date was in 2023. The system still works fine, but the risk of floppy disk data degradation and  in maintaining expertise in 1990s programming languages have further encouraged the SFMTA to seek upgrades.", "Beyond the floppies, though, the Muni Metro needs many more upgrades. The SFMTA plans to spend $700 million (including the $212 million Hitachi contract) to overhaul the light rail's control system. This includes replacing the loop cable system for sending data across the servers and trains. The cables are said to be a more pressing concern than the use of floppy disks. The aging cables are fragile, with \"less bandwidth than an old AOL dial-up modem,\" Roccaforte previously told Ars. The SFMTA is reportedly planning for Hitachi to start replacing the loop cables with a new communication system that uses Wi-Fi and cellular signals for tracking trains by 2028. However, the SFMTA's board of supervisors still needs to approve this, the Chronicle said.", "In addition to old storage formats and the communication infrastructure, the Muni's current ATCS includes onboard computers tied to propulsion and brake systems, as well as local and central servers, and more. The SFMTA's  says that the current estimated completion date for the complete overhaul is \"2033/2034.\" According to the provided timeline, it looks like the subway technology replacement phase is expected to take place in “2027/2028,” after which there’s an on-street technology installation phase.", "Like with other entities, the SFMTA’s slow move off floppy disks can be attributed to complacency, budget restrictions, and complications in overhauling critical technology systems. Various other organizations have also been slow to ditch the dated storage format, including Japan, which only  in governmental systems in June, and the German navy, which is still trying to figure out ."]], "https://arstechnica.com/gadgets/2024/10/subscribers-are-paying-more-for-streaming-content-that-they-are-enjoying-less/": ["Scharon Harding", "Streaming subscription fees have been rising while content quality is dropping", ["Subscription fees for video streaming services have been on a . But despite subscribers paying more, surveys suggest they're becoming less satisfied with what's available to watch.", "At the start of 2024, the industry began declaring , a term coined by FX Networks Chairman John Landgraf that refers to an era of rampant content spending that gave us shows like <em>The Wire</em>, <em>Breaking Bad</em>, and <em>Game of Thrones</em>. For streaming services, the Peak TV era meant trying to lure subscribers with original content that was often buoyed by critical acclaim and/or top-tier actors, writers, and/or directors. However, as streaming services struggle to reach or maintain profitability, 2024 saw a drop in the number of new scripted shows for the first time in at least 10 years, FX Research .", "Meanwhile, overall satisfaction with the quality of content available on streaming services seems to have declined for the past couple of years. Most surveys suggest a generally small decline in perceived quality, but that’s still perturbing considering how  streaming services . There was a time when a streaming subscription represented an exclusive ticket to viewing some of the best new TV shows and movies. But we’ve reached a point where the most streamed TV show last year —an original from the USA Network cable channel that ended in 2019.", "Earlier this month, TiVo released its <em>Q2 2024 TiVo Video Trends Report: North America </em> of 4,490 people in the US and Canada ages 18 and up. The survey found a drop in the percentage of subscribers who would rate the content quality of their subscription video on demand (SVOD) services as \"moderate to very good.\" (TiVo’s report defines SVOD as “services offering on-demand streaming content in which users pay a subscription fee.\") The decline is present for subscribers to streaming services with and without ads.", "In Q2 2022, 78.6 percent thought their ad-free SVOD service had \"moderate to very good\" stuff to watch. But in Q2 2023, that dropped to 77.4 percent, and in Q2 2024, the percentage fell further to 74.5 percent. For ad-supported SVOD services, the percentage dropped from 74.2 percent in Q2 2023 to 60.8 percent in Q2 2024.", "Ars Technica asked TiVo why subscribers may be feeling less satisfied with streaming content quality, and Scott Maddux, VP of global content strategy and business at TiVo parent company Xperi, pointed to some potential reasons while noting that other factors could also be contributors.", "\"As more and more consumers shift to ad-supported SVOD services, the perception of the content quality may have also shifted downward a bit,” Maddux said.", "Maddux also suggested that streaming companies' financial challenges could be impacting content quality:", "The amount of new original content overall on SVODs may be down [year over year] as many streamers continue to struggle to hit profitability targets. Without new original content (or exclusive content deals), perceptions of value/differentiation may decline.", "Similarly, a CableTV.com  released in January 2024 of 7,130 US streamers pointed to a drop in subscriber satisfaction with streaming content quality. The publication asked respondents how satisfied they were with their streaming provider's original content. Disney+, Hulu, Max, Netflix, and Paramount+ all saw their satisfaction rates fall  to 2024. However, Apple TV+, Amazon Prime Video, and Peacock all improved from 2023 to 2024.", "In September 2023, Whip Media released its 2023 US Streaming Satisfaction , which surveyed over 2,000 US streaming subscribers. The report said that the 2023 analysis:", "clearly indicates that satisfaction among the top tier of streaming platforms is gradually declining while mid-tier platforms rise in overall satisfaction. The narrowing competitive market suggests there is high demand for showing the right mix of original and library content—and consistently maintaining a delightful viewer experience—in order to drive an overall value that subscribers expect.", "Whip Media's 2023 report found that Apple TV+, Hulu, Peacock, Paramount+, and Prime Video all showed gains in terms of the percentage of subscribers satisfied with the quality and variety of original content available on the platforms from 2022 to 2023.", "However, six of the eight streaming services that Whip Media examined either showed a decline in overall satisfaction or stayed stagnant from 2022 to 2023. Apple TV+ and Peacock were the only services showing gains from 2021 to 2022 and then again from 2022 to 2023, as you can see below:", "It's not just streaming services that may be seeing a dip in content quality. TiVo's survey also recorded a drop in perceived content quality among pay-TV services. (TiVo's report defines pay-TV as \"services that aggregate live and on-demand linear television distributed over a cable, satellite,\" or managed  platform.", "But streaming's rising prices and history of exclusive, original content have led some streaming subscribers, especially early adopters, to expect more. Yet, streaming providers have made notable budget cuts to content spending in the past couple of years, which has also meant the removal of content from services.", "As  calculated in June 2024—citing internal data and numbers from Morgan Stanley—Amazon, Disney, Fox, Netflix, and Warner Bros. Discovery are expected to spend less on content from 2023 to 2026 compared to what they spent from 2019 to 2023. TV spending for Prime Video “is projected to drop from a CAGR of nearly 22 percent between 2019 and 2023 to just 12.6 percent between 2023 and 2026,” Variety reported. Overall, though, global content spending is on the rise, and even during the 2023–2026 period, “content expenses are still broadly expected to grow on an annual basis,” the publication noted. However, some of those growing costs are expected to be related to rising production costs, which are impacted by various external factors, like inflation.", "Recent content spending was heavily impacted by strikes from the writers (from May to September 2023) and actors (from July to November 2023 ) in Hollywood. Variety suspects that 2023 “will likely remain the low point of spending for most companies over the next few years,” which suggests improvement on the horizon.", "Netflix co-CEO Ted Sarandos  earlier this month that Netflix's plans to release some popular original content, like <em>Cobra Kai</em> and <em>Nobody Wants This, </em>were delayed until the second half of 2024 due to the strikes. With the strikes resolved, Sarandos said that Netflix is moving toward a “more normalized output schedule.” TV shows are more on track than movies are, though, and neither category is totally on schedule, he noted.", "Further underscoring the complexity in putting out content that subscribers—an audience that is growing larger and more diverse and that has heightened expectations tied to streaming fees—is the idea that improving content quality is about more than growing content budgets. With most streaming providers still struggling with high churn rates and maintaining profitability, there’s increasing pressure for strong, unique content. Meanwhile, streaming originals like Prime Video's <em>The Lord of the Rings: The Rings of Power</em> have proven that big budgets  beloved content.", "Per Variety, streaming providers can find ways to improve content quality without growing content spend at an unsustainable rate:", "The trick to success in the current market will be spending on the right projects, which will likely be more shows with broad appeal, reasonable budgets, and fewer movie stars.", "With the strikes over and streaming prices constantly climbing, streaming providers will have to do more than  with rivals to satisfy subscribers.", "Notably, TiVo’s survey found content quality to be a huge driver for new streaming subscriptions. Its report said that the top reasons for people subscribing to a new streaming service are because the service “has a large library of good programming,” followed by the service having a “specific show or movie I wanted to watch,\" “good original programming,” and “episodes of an old favorite show.\"", "However, as noted, the Peak TV era and the idea of streaming services having amazing, can't-miss content has faded. On Monday,  reported that “most people in the film business don’t think Netflix makes good movies” and that Netflix wants to shift toward building quality film content rather than buying film studios' leftovers, as Netflix has done in the past. It pointed to Netflix trying to be more selective and make more movies in-house to boost its film reputation. Netflix “wants to make better movies by making fewer and spending less,” Bloomberg said.", "Even without expanding content budgets, streaming providers have found ways to try to build more revenue through  and the introduction of . For better or worse, these methods could push streaming providers to improve content quality as they look to grow and better appeal to advertisers.", "And in this world of ad-driven revenue, subscriber counts are starting to get less attention as the presented measure of success, with industry leader Netflix  pushing so-called engagement numbers—or how much time people spend watching stuff—at investors.", "With streaming more competitive than ever, companies should feel more pressure to offer the type of content quality that helped make streaming so popular in the first place. They can't ride <em>Suits</em>' coattails forever."]], "https://arstechnica.com/gadgets/2024/10/qualcomm-brings-laptop-class-cpu-cores-to-phones-with-snapdragon-8-elite/": ["Andrew Cunningham", "Qualcomm brings laptop-class CPU cores to phones with Snapdragon 8 Elite", ["Qualcomm has , and the best part is that it uses an improved version of the Oryon CPU architecture that the  brought to Windows PCs earlier this year.", "The Snapdragon 8 Elite is the follow-up to last year's —yet another change to the naming convention that Qualcomm uses for its high-end phone chips, though, as usual, the number 8 is still involved. The 8 Elite uses a \"brand-new, 2nd-generation Qualcomm Oryon CPU\" with clock speeds up to 4.32 GHz, which Qualcomm says will improve performance by about 45 percent compared to the Snapdragon 8 Gen 3.", "Rather than a mix of large, medium, and small CPU cores as it has used in the past, the 8 Elite has two \"Prime\" cores for hitting that high peak clock speed, while the other six are all \"Performance\" cores that peak at a lower 3.53 GHz. But it doesn't look like Qualcomm is using a mix of different CPU architectures anymore, choosing to distinguish the higher-performing core from the lower-performing ones by clock speed alone.", "Qualcomm promises a similar 40 percent performance boost from the new Adreno 830 GPU. The chip also includes a marginally improved Snapdragon X80 5G modem, up from an X75 modem in the Snapdragon 8 Gen 3—its main improvement appears to be support for additional antennas, for a total of six, but the download speed still tops out at a theoretical 10Gbps. Wi-Fi 7 support appears to be the same as in the 8 Gen 3, but the 8 Elite does support the Bluetooth 6.0 standard, up from Bluetooth 5.4 in the 8 Gen 3.", "Qualcomm says the new chip's CPU features \"44% improved power efficiency\" and \"40% greater power efficiency\" for the GPU, which ought to keep power usage in line despite the performance improvements—these gains are probably attributable to the new 3 nm TSMC manufacturing process, compared to the 4 nm process used for the Snapdragon 8 Gen 3.", "And no 2024 chip announcement would be complete without some kind of AI mention: Qualcomm's image signal processor is now an \"AI ISP,\" which Qualcomm says \"recognizes and enhances virtually anything in the frame, including faces, hair, clothing, objects, backgrounds, and beyond.\" These capabilities can allow it to remove objects from the background of photos, among other things, using the on-device processing power of the chip's Hexagon neural processing unit (NPU). The NPU is 45 percent faster than the one in the Snapdragon 8 Gen 3.", "Phones using the Snapdragon 8 Elite should begin appearing in \"the coming weeks.\"", "The Oryon CPU architecture's lineage goes back to , a chip-design company founded by former Apple CPU architect Gerard Williams, who was involved with creating Apple Silicon chips. Nuvia was originally founded to develop server chips, but Qualcomm redirected its efforts toward consumer tech, and Williams is now senior VP of engineering at Qualcomm."]], "https://arstechnica.com/gadgets/2024/10/hands-on-with-the-2024-ipad-mini-spot-the-differences/": ["Samuel Axon", "Hands-on with the 2024 iPad mini: Spot the differences", ["The iPad mini is a niche product, that much is clear. But for those who want an extra-small tablet, the launch of the sixth-generation iPad mini in 2021 was a red-letter day. For the first time in ages, the mini got close to the same kind of performance and features as its bigger brethren.", "Then it didn’t get any updates for a couple of years. It was still a good tablet, but it wasn’t positioned to take advantage of new products or features on Apple’s docket like Apple Intelligence or the Apple Pencil Pro.", "Enter the new 2024 refresh of the iPad mini, which releases October 23. For the most part, it’s the same as the previous generation—but Apple has laser-focused on a couple of tweaks to modernize the device just enough to keep it competitive in the company’s current ecosystem.", "I’ve spent a couple of days with the new iPad mini, so let’s take a quick look at what has changed. If you want to learn more about the form factor, basic features, and other stuff that hasn’t changed since last time, take a look at our . Almost everything we said then applies here, too.", "Now, let’s start with the biggest change: a new system-on-a-chip.", "As Apple’s marketing tells it, the iPad mini’s most important update is on the inside: The new model replaces the A15 system-on-a-chip that was first introduced with the iPhone 13 back in 2021 with the A17 Pro, which first appeared in the iPhone 15 Pro last year.", "The A17 Pro has a 6-core CPU, a 5-core GPU, and a 16-core NPU (neural processing unit). The GPU adds features like dynamic caching, hardware-accelerated ray-tracing, and mesh shading. Apple claims that the A17 Pro offers 30 percent better CPU performance, 25 percent better GPU performance, and 100 percent better NPU performance than the A15.", "These boosts are all nice to see, especially for that small sliver of people running demanding professional apps like video editing tools on the iPad—but also for the much larger cadre of users who play graphically intensive games like <em>Genshin Impact</em>.", "But it’s hard not to notice the timing of this release. When the A17 Pro was introduced last year, it was the first from Apple to support the upcoming Apple Intelligence AI features, and those features are now expected to launch just a few days after this seventh-generation iPad mini hits store shelves.", "With the iPad Pro running on Apple’s M4 chip (which is found in the latest Macs) and the iPad Air on the slightly older M2, the addition of the A17 Pro to the iPad mini means that the cheapest base iPad (which has a now quite-long-in-the-tooth A14) is the only iPad that doesn’t support Apple Intelligence. (I expect that to change before too long, of course.)", "Apple Intelligence features were first announced for iOS and iPadOS 18, which went out to the public a few weeks ago. They haven’t yet been released, though, because they were  to iOS 18.1 and iOS 18.2, depending on the feature. iOS 18.1 will launch next week, and iOS 18.2 is expected before the end of the year.", "As we’ve discussed here before, the “Apple Intelligence” label is a catch-all term for a number of new software features that use some form of generative AI, like large language models. It will do things like summarize emails and notifications, help you clean up your writing with edits, enable more robust Siri responses and understanding of context, and generate images or emojis you can use in your texts.", "I’m taking the same approach here that I did with the : That phone was heavily marketed by Apple as an Apple Intelligence-ready device, but I didn’t talk much about Apple Intelligence in that review since it wasn’t yet available. It makes sense to review products for what they’re like now, not what they might be like in the future.", "We’ll have multiple articles diving into Apple Intelligence as it rolls out. For now, just know that the tablet’s main reason for being seems to be to make sure new iPad mini buyers are ready for those features in the coming weeks.", "We ran some quick benchmarks on the iPad mini, and the performance gains are roughly in line with what Apple promised compared to the previous iPad mini. That said, it’s far from the fastest tablet in Apple’s current lineup. Those  found in the current iPad Pro and iPad Air are a lot faster.", "The 2021 iPad mini didn’t give buyers a wide range of configuration options. The base model had a paltry 64GB of storage, with the option to splurge for 256GB. Now, the updated mini addresses a wider range of user needs. It starts at 128GB, so you’re getting double the storage for the same entry-level price—always nice to see. Additionally, you can now upgrade not just to 256GB, but also 512GB—if you really want to splurge, that is.", "Going to 256GB brings the price from $499 to $599, and going up to 512GB takes it all the way to $799. Steep prices aside, these additional options could expand the audience for this tablet a teensy-tiny bit. I’m sure there were a handful of people who wanted a small tablet but couldn’t make the existing storage options work for them.", "It’s worth noting that these prices make the iPad mini one of the cheapest ways to get Apple Intelligence, though I’m not convinced there are people out there looking to buy a new device just to take advantage of Apple’s much-hyped AI features.", "There are some more modest specs changes beyond the A17 Pro and the storage. We’ve gone from Wi-Fi 6 to Wi-Fi 6E, with speeds up to 2.4Gb/s and simultaneous dual-band for staying connected to more than one device at the same time. The new tablet also supports Bluetooth 5.3 compared to its predecessor's 5.0.", "The previous model had already abandoned Apple’s proprietary Lightning connection for the industry-standard USB-C, but this updated USB-C port supports transfer speeds up to 10Gb/s, much faster than the previous model. (That’s data transfer, while charging seems the same.)", "The camera system is mostly the same as before, but Apple has added support for Smart HDR 4, the latest version of its computational photography algorithms that combines multiple rapidly taken photos into one image, using the best features of all of them. This process offers benefits like better low-light photography and improved highlights. There’s also 4K video capture support.", "I don’t think there are many iPad mini photographers out there, but hey, not going to say no to improvements.", "Lastly, there have been improvements to the display that should mitigate some of the jelly scrolling that irritated a subset of owners of the previous generation of the iPad mini.", "Apart from improved CPU, GPU, and NPU performance, the biggest addition here is Apple Pencil Pro support.", "Introduced this spring, the Pencil Pro has lower latency than prior Pencil models, but at least as importantly, it has several new sensors and feedback features to make it more versatile. You can squeeze the pencil lightly to bring up a new options panel to quickly switch tools, among other things. There’s also a sensor that lets you roll the pencil to change the orientation of some tools.", "Pencil Pro isn’t cheap, though—it’s $129. I imagine most digital artists want the largest canvas possible, so they’re not looking at the mini. But for more casual users, it’s nice to have the option.", "There are a lot of things I like about the iPad mini. It’s comfortable to hold, making it ideal among Apple’s tablets for reading or browsing the web. Typing on it while holding it in landscape mode feels ideal for me, though your mileage may vary, as hand sizes, of course, vary.", "It lacks the power of the otherwise similar iPad Air, and it certainly can’t pack the same punch as the beefy iPad Pro. But it’s enough for most passive consumption use. As we noted in our 2021 iPad Air review, you probably wouldn’t want to try to do heavy work on a screen this small anyway.", "All that said, Apple’s intention was clear: get the iPad mini past the minimum spec for Apple Intelligence. We’ll see how much that matters over the next few weeks.", "This update maintains the iPad mini’s position in the market and in Apple’s lineup, but it doesn’t do anything to actually change that position. It’s still a niche product for folks who want a comfortable, one-handed holding size but might want to watch some videos at decently high quality or play a few games. If it were a bit cheaper, it’d be ideal as a tablet for kids.", "By excluding the smart connector for accessories like the Magic Keyboard, Apple made it clear this iPad isn’t designed for all that desktop replacement productivity stuff it promotes on its other iPads. (There was no smart connector in the previous iteration of the iPad mini, either.) It’s not a cutting-edge or premium product. For example, its bezels are quite large for a modern iPad relative to its size—which is a bummer, since you’d think a small chassis would benefit most from using a higher percentage of its size for the screen.", "But if you want something small, it feels great to use, and its specs are pretty good for the price."]], "https://arstechnica.com/gadgets/2024/10/qualcomm-cancels-windows-dev-kit-pc-for-comprehensively-failing-to-meet-standards/": ["Andrew Cunningham", "Qualcomm cancels Windows dev kit PC for “comprehensively” failing to meet standards", ["It's been a big year for Windows running on Arm chips, something that Microsoft and Arm chipmakers have been trying to get off the ground for well over a decade. Qualcomm's Snapdragon X Elite and X Plus are at the heart of dozens of , which promise unique AI features and good battery life without as many of the app and hardware compatibility problems that have plagued Windows-on-Arm in the past.", "Part of the initial wave of Copilot+ PCs was a single desktop,  that would give developers and testers a slightly cheaper way to buy into the Copilot+ ecosystem. Microsoft  two years ago.", "But Qualcomm has unceremoniously canceled the dev kit and is sending out refunds to those who ordered them. That's according to a note received by developer and YouTuber Jeff Geerling, who had already received the Snapdragon Dev Kit and given it a middling review .", "\"The launch of 30+ Snapdragon X-series powered PCs is a testament to our ability to deliver leading technology and the PC industry's desire to move to our next-generation technology,\" reads Qualcomm's statement. \"However, the Developer Kit product comprehensively has not met our usual standards of excellence and so we are reaching out to let you know that unfortunately we have made the decision to pause this product and the support of it, indefinitely.\"", "Qualcomm's statement also says that \"any material, if received\" will not have to be returned—those lucky enough to have gotten one of the Dev Kits up until now may be able to keep it and get their money back, though the PC is no longer officially being supported by Qualcomm.", "The sudden cancellation caps a rocky rollout for the Snapdragon Dev Kit, which was supposed to begin shipping on June 18 but was subject to repeated delays, according to  and .", "A message received by pre-orderers last month pointed to some hardware problems. Qualcomm sent a message informing users that the dev kit's built-in HDMI port was being replaced with a USB-C-to-HDMI dongle, and was handing out 10 percent discounts to customers to apologize for the change. Geerling's teardown showed both a space on the board where an HDMI port would have been, an unused DisplayPort to HDMI converter chip, and an internal display connector that the port would have been connected to, all indicating that the removal of the port happened late and may even have been a reason the shipments were delayed in the first place.", "Geerling's unit was also labeled as \"not FCC approved for resale\" which is not something I've seen stamped on a finished product from a major company that was being sold to end users.", "If you want an Arm system to test on and develop with, this means you'll need to grab one of the Copilot+ laptops or tablets to do it with. But none of those systems come close to the Dev Kit's $899 starting price, especially if you're looking for 32GB of RAM and a fully unlocked Snapdragon X Elite processor; getting the same CPU and RAM in a Surface Pro tablet will run you $2,100, though some laptops like  can be had for a bit closer to $1,000 depending on current promotions."]], "https://arstechnica.com/gadgets/2024/10/redbox-hard-drive-hacked-to-reveal-customer-information-from-2471-rentals/": ["Scharon Harding", "Redbox easily reverse-engineered to reveal customers’ names, zip codes, rentals", ["Since , many have wondered what will happen to those red kiosks and DVDs. Another question worth examining is: What will happen to all the data stored inside the Redboxes?", "Redbox parent company Chicken Soup for the Soul filed for Chapter 7 bankruptcy in June and is in the process of . Meanwhile, stores with Redboxes are eager to remove the obsolete hardware. And tinkerers have reported getting their hands on Redbox kiosks and doing , including .", "But Redboxes falling into technologists' hands can seemingly also result in the uncovering of customer data from kiosks' hard drives. As spotted by today, programmer and expert reverse-engineer  reported via  that she was able to retrieve records for 2,471 transactions from the disk image of a Redbox hard drive. Turing told Ars Technica that she got the image from a Discord channel:", "[The Redbox] logged lots of information, including debugging information from the transaction terminal, and they left old records on the device. This probably saved them some time on QAing software bugs, but it exposed all their users to data being leaked.", "Data went back \"to at least 2015,\" Turing said on Mastodon. She told Lowpass the data included \"records for when stuff is rented,\" including customers' email addresses and zip codes, as well as names of rented discs and when they were rented. Turing was also able to retrieve some numbers of customer credit cards.", "“The device talks to a secure payment transaction device (so there's no logs of full credit info) but it logs a bunch of stuff that it really shouldn't: We've got the first 6 and last 4 [digits] of each credit card used, plus some lower level transaction details,” Turing told Lowpass.", "The information available was enough for Turing to determine the name of a person who rented <em>The Giver</em> and <em>The Maze</em> <em>Runner </em>in Morganton, North Carolina, on May 23, 2015, at 6:43 p.m, she  (Ars is unable to verify the accuracy of this claim).", "Lowpass suggested that the Redboxes only stored data on local hard drives if there was an Internet outage so that rental transactions could continue taking place. That would mean that data for only a very small portion of Redbox transactions was likely stored locally.", "Turing told Ars that finding customer data wasn't hard or time-consuming and that she was able to crack the hard drive image with common free tools:", "The device has a lot of logs, and customer data was scattered throughout several of them—usually fragmentary, but it's not too hard to cross reference them with other logs. It's not super straightforward to directly access the data. Most of it is held in an old database format that's not easy to manipulate, but anyone with basic hacking skills could easily pull data manually out of the files with a hex editor. .... With access to the whole hard drive, it's easy to search for things like email addresses and credit card numbers.", "Turing noted the inherent insecurity of data in a Redbox storing customer data locally.", "\"The root issue is that this is a machine that has to boot by itself, with no chance for a human to enter a decryption password or something. That means that the machine has to be able to decrypt itself,\" she said.", "Worse, it seems like industry experts were aware that improper removal of Redboxes could result in customer data being exposed. As Lowpass pointed out, a court filing [] from August 28 and by Automated Kiosk Advisors LLC emphasized legal and financial pitfalls that it believed could come from \"failure to properly remove and destroy the internal data storage and payment information\" in Redboxes. The filing noted that Redbox \"hard drives must be securely and properly reformatted as these may contain sensitive personal identifying information ... including, but not limited to, private customer information including credit/debit card data, email addresses, zip codes, customer names, and associated movie rental history.\"", "It's worth noting that the amount of data expected to be stored on Redboxes is small compared to Redbox's overall business. Since Redbox once rented out millions of DVDs weekly, the data retrieved only represents a small portion of Redbox's overall business and, likely, of business conducted on that specific kiosk. That might not be much comfort to those whose data is left vulnerable, though.", "The problem is more alarming when considering how many Redboxes are still out in the wild with uncertain futures. High demand for Redbox removals has resulted in all sorts of people, like Turing, gaining access to kiosk hardware and/or data. For example,  reported last week about a \"former Redbox employee who convinced a 7-Eleven franchisee\" to give him a Redbox, a 19-year-old who persuaded a contractor hauling a kiosk away from a drugstore to give it to him instead, as well as a Redbox landing in an Illinois dumpster.", "Chicken Soup's actions may violate consumer privacy regulations, including the Video Privacy Protection Act  \"wrongful disclosure of video tape rental or sale records.\" However, Chicken Soup's bankruptcy (most of its assets are in a holding pattern, Lowpass reported) makes customer remediation more complicated and less likely.", "Mario Trujillo, staff attorney for the Electronic Frontier Foundation, told Ars that this incident \"highlights the importance of security research in uncovering flaws that can leave customers unprotected.\"", "\"While it may be hard to hold a bankrupt company accountable, uncovering the flaw is the first step,\" he added.", "Turing, which reverse-engineers a lot of tech, said that the privacy problems she encountered with Redbox storage \"isn't terribly uncommon.\"", "Overall, the situation underscores the need for stricter controls around consumer data, whether it comes internally from companies or, as some would argue, through government regulation.", "\"This security flaw is a reminder that all companies should be obligated to minimize the amount of data they collect and retain in the first place,\" Trujillo said. \"We need strong data privacy laws to do that.\""]], "https://arstechnica.com/gadgets/2024/10/android-15s-security-and-privacy-features-are-the-updates-highlight/": ["Kevin Purdy", "Android 15’s security and privacy features are the update’s highlight", ["Android 15 started rolling out to Pixel devices Tuesday and will arrive, through various third-party efforts, on other Android devices at some point. There is always a bunch of little changes to discover in an Android release, whether by reading, poking around, or letting your phone show you 25 new things after it restarts.", "In Android 15, some of the most notable involve making your device less appealing to snoops and thieves and more secure against the kids to whom you hand your phone to keep them quiet at dinner. There are also smart fixes for screen sharing, OTP codes, and cellular hacking prevention, but details about them are spread across Google's own docs and blogs and various news site's reports.", "Here's what is notable and new in how Android 15 handles privacy and security.", "In the Android 15 settings, you can find \"Private Space,\" where you can set up a separate PIN code, password, biometric check, and optional Google account for apps you don't want to be available to anybody who happens to have your phone. This could add a layer of protection onto sensitive apps, like banking and shopping apps, or hide other apps for whatever reason.", "In your list of apps, drag any app down to the lock space that now appears in the bottom right. It will only be shown as a lock until you unlock it; you will then see the apps available in your new Private Space. After that, you should probably delete it from the main app list.  and its quirks.", "It's obviously more involved than Apple's \"\" tap option but with potentially more robust hiding of the app.", "A second form of authentication is good security, but allowing apps to access the notification text with the code in it? Not so good. In Android 15, , likely to be given only to the most critical apps, prevents the leaking of one-time passcodes (OTPs) to other apps waiting for them. Sharing your screen will also hide OTP notifications, along with usernames, passwords, and credit card numbers.", "This might also prevent apps from doing the convenient thing of automatically pasting codes they are expecting, but it's likely a good trade-off. Google notes that there are exceptions for apps with companion apps for wearables (i.e., Pixel Watch).", "Thieves' tactics are constantly evolving. One of the more effective ways to steal a phone—and steal something of value from it before the owner can remotely lock it—is to yank it from the owner's hands. So long as the phone is unlocked and functional, a thief who gets far enough away can check emails, apps, and messages for rich targets, like money transfer or banking apps.", "Theft Detection Lock on Android uses AI to sense if someone has yanked a phone and is rapidly moving away with it, automatically locking the phone if so.  suggests it uses \"on-device machine learning\" to \"analyze various device signals\" and determine if a device was yoinked. Google is unlikely to give away the full details of what it's looking for.", "If theft detection didn't work, there are at least two backups. Offline Device Lock activates if the Internet connection is disabled on your phone. And, using another device, you can use Remote Lock at  to quickly lock your device with a phone number and a security challenge. It's a faster way to secure your device while you use  to locate and further lock your gear.", "Those three key features—Theft Detection Lock, Offline Device Lock, and Remote Lock—are not exclusive to Android 15 but are rolling out along with its release. Users on Android 10 or higher should get a Google Play Services update to enable the features, though they'll have to be turned on in the device settings.", "Having an AI core raising the cost of your Pixel may not be an <em>entirely</em> bad thing. In Android 15, the app-scanning Google Play Protect will start using on-device AI from the \"\" to \"analyze additional behavioral signals related to the use of sensitive permissions and interactions with other apps and services.\"", "Should strange happenings be detected, users can send the suspect app to Google for further review and disable the app from a notification in the meantime.", "It can be easy to forget that your phone is actually a phone and is constantly communicating over the air. It's one of the most vulnerable parts of a phone, and Android 15 does some things to address the cellular part of your cell phone—even if none of them are available yet, .", "Android 15 can tell users when they're using an unencrypted cellular connection to prevent potential interception or injection of their traffic or SMS messages. Certain \"at-risk users like journalists or dissidents\" can be alerted to potentially false cellular base stations or attempts to identify their device. But these features are not on by default and require \"OEM integration and compatible hardware,\" with Google saying it expects OEM adoption \"over the next couple of years.\"", "Should a thief or snoop have access to your phone before you can lock it, Android 15 has instituted some smarter defaults for making changes to deeper settings, including:"]], "https://arstechnica.com/gadgets/2024/10/winamp-really-whips-open-source-coders-into-frenzy-with-its-source-release/": ["Kevin Purdy", "Winamp deletes entire GitHub source code repo after a rocky few weeks", ["Winamp, through its Belgian owner Llama Group, posted the source for its \"Legacy Player Code\" on September 24 so that developers could \"contribute their expertise, ideas, and passion to help this iconic software evolve.\"", "Less than a month later, that , after it either bumped up against or broke its strange hodgepodge of code licenses, seemingly revealed the source code for other non-open software packages, and made a pretty bad impression on the open-source community.", "Winamp's code was made available in late September, but not very open. Under the \",\" you may not \"distribute modified versions of the software\" in source or binary, and \"only the maintainers of the official repository are allowed to distribute the software and its modifications.\" Anyone may contribute, in other words, but only to Winamp's benefit.", "Justin Frankel, a key developer of the original Winamp and founder of Nullsoft, which also made SHOUTcast streaming software, was  about contributing to the code. Frankel responded that, even if he had some desire, the license terms \"are completely absurd in the way they are written.\" Even taking them \"as they are likely intended,\" Frankel wrote, \"they are terrible. No thank you.\"", "Despite how this license would seem to bar forks, or perhaps <em>because</em> of that, the code has been . In forking and examining the source when first released, coders have noticed some, shall we say, anomalies:", "As people in the many, many busy GitHub issue threads are suggesting, coding has come a long way since the heyday of the Windows-98-era Winamp player, and Winamp seems to have rushed its code onto a platform it does not really understand.", "Winamp  around the same time as illegal MP3 networks such as Napster, Limewire, and Kazaa, providing a more capable means of organizing and playing deeply compressed music with incorrect metadata. After  that seemed , Winamp's assets were purchased by a company named Radionomy in 2014, and a new version was due out in 2019, one that aimed to combine local music libraries with web streaming of podcasts and radio.", "Winamp did , though the app was \"still in many ways an ancient app,\" Ars' Andrew Cunningham wrote then. There was  added at the end of 2022.", "In its , the Brussels-based Llama Group SA, which claims to have roughly 100 employees (with ), says that \"Tens of millions of users still use Winamp for Windows every month.\" It plans to release \"two major official versions per year with new features,\" as well as offering , intended for artists or labels to manage their music, licensing, distribution, and monetization on various platforms.", "Winamp has not responded to requests for comment, either at the time of source code posting or after its repository deletion.", "em>This post was updated at 12:20 p.m. on Oct. 16 after Winamp's source repository was deleted. It was also updated at 2:05 p.m. to note a reported former worker's lower headcount for Llama Group SA.</em"]], "https://arstechnica.com/gadgets/2024/10/how-to-upgrade-to-windows-11-whether-your-pc-is-supported-or-not/": ["Andrew Cunningham", "How to install Windows 11 on supported and unsupported PCs, 24H2 edition", ["We originally published this install guide for Windows 11 shortly after the OS was released in October 2021. To keep it current and as useful as possible, we updated it in October 2024 to cover changes that Microsoft has made in the Windows 11 2024 Update, also known as 24H2.", "Windows 11 24H2 , and even though it's still called Windows 11 and still looks like Windows 11, it's probably the operating system's most significant update since its release in October of 2021.", "You may or may not be excited about some of the new generative AI features, but it has a lot of other things in it, too. And even if you're not in love with Windows or the current trajectory of Windows, there are still plenty of places you need to use it anyway.", "We've pulled together all kinds of resources to create a comprehensive guide to installing and upgrading to Windows 11. This includes advice and some step-by-step instructions for turning on officially required features like your TPM and Secure Boot, as well as official and unofficial ways to skirt the system-requirement checks on \"unsupported\" PCs, because Microsoft is not your parent and therefore cannot tell you what to do.", "There are some changes in the 24H2 update that will keep you from running it on every ancient system that could run Windows 10, and there are new hardware requirements for some of the operating system's new generative AI features. We've updated our guide with everything you need to know.", "The easiest way to get Windows 11 is by checking Windows Update on a supported, fully up-to-date Windows 10 PC. But if you aren't seeing it there, or if you have several computers to upgrade and only want to download the new OS once, there are other options.", "Microsoft offers several ways to . One is to use the Installation Assistant app, which you install on your PC to trigger a normal upgrade install via Windows Update. The second is to use the Windows 11 Media Creation Tool, which automates the process of creating a bootable USB install drive or downloading an install ISO file. Once you have a USB drive, you can either boot from it to perform a clean install or run the Setup app from within Windows 10 to do a normal upgrade install. You can also burn the ISO to a DVD, but installing from any USB drive, even an old USB 2.0 drive, will be much faster. Finally, you can just download an ISO file .", "Windows 11 is a free upgrade to Windows 10. So if you're running Windows 10 Home or Pro on your PC, regardless of whether your PC is officially supported or not, you'll be able to install and activate the equivalent edition of Windows 11.", "If you're installing Windows 11 on a new PC you've built yourself, officially, you should buy a Windows 10 or Windows 11 license. These can be purchased from retail sites like , , , or  for between $120 and $140. <em>Unofficially</em>, you can buy a working Windows product key from product key resale websites for as little as $12. Many of these sites are sketchy, and we won't link to any of them directly, but it's one option for getting a working key.", "Microsoft has finally  where new OS installs would accept old Windows 7 and Windows 8 product keys to activate equivalent editions of Windows 11. But if you've already managed to use one of these keys to activate an older Windows 10 or 11 install, your system should still be able to activate properly when it connects to the Internet, even if you don't put a product key in during installation.", "Windows 11's official system requirements haven't changed with the 24H2 update. To reiterate, you need:", "Both the Home and Pro versions of Windows 11 require a Microsoft account sign-in, though there are still multiple workarounds if you want to use a local account. We'll cover these later.", "The processor requirement is the most restrictive; supported processors include 8th-generation and newer Intel Core processors as well as AMD Ryzen 2000-series processors and newer. These are all chips that launched in late 2017 and early 2018. Older computers can’t officially run Windows 11. This is a big departure from Windows 10, which made a point of supporting pretty much anything that could run Windows 7 <em>or</em> Windows 8.", "We get more into the reasoning behind these requirements (and whether they hold water) . But the three big ones are the CPU requirement, the TPM requirement, and the Secure Boot requirement.", "When you open Windows Update in Windows 10, it might tell you whether your PC is supported or not. But the easiest way to check manually is with . Early versions of this app weren’t very good, but the current version will tell you whether your PC is compatible and <em>why</em> it is or isn’t compatible.", "If you aren’t using a supported processor, either plan to upgrade to a CPU that is supported or skip ahead to the section where we talk about installing Windows 11 on unsupported PCs.", "If your processor is supported but you don’t meet the TPM or Secure Boot requirements, the good news is that unless something is very wrong with your system, they should both be features you can enable in your PC’s BIOS.", "Since Windows 11's launch, most motherboard manufacturers have also released new BIOS updates that automatically enable the features needed to support Windows 11. Check your motherboard manufacturer's support page for the latest BIOS updates and flashing instructions.", "Usually, you can enter your BIOS by pressing some key after turning on your PC but before Windows begins to boot. The key varies, but common ones include the Delete key, F2 (for Dell systems), F1 (for Lenovo systems), or F10 (for HP systems).", "The consistent but more roundabout way of opening your BIOS is to go to the Windows Settings app, then Windows Update, then Recovery, and then Restart Now under “Advanced startup.” In the basic blue screen you see next, click Troubleshoot, then Advanced options, then UEFI Firmware Settings.", "Enabling your processor’s built-in firmware TPM is easy, but finding the setting to do it sometimes isn’t. If you’re unsure what you’re doing, try searching for “[manufacturer of your computer or motherboard] enable TPM” because many manufacturers have created help pages specifically because of Windows 11.", "For Intel systems, if you can’t find a setting marked “TPM” somewhere in the chipset or security settings, look for “Platform Trust Technology” or “PTT” and enable that. AMD systems usually just refer to it as an “fTPM,” though you may also see it called the “Platform Security Processor,” or “PSP.”", "Once you’ve enabled your TPM, reboot into Windows and look at the Device Manager or use the Health Check app to ensure it’s working properly.", "Any computer made since Windows 8 was released in 2012 ought to support Secure Boot, which helps prevent unsigned and potentially malicious software from being loaded during your PC’s boot process. You should be able to turn it on in your PC’s BIOS if it isn’t already enabled, usually either in a “Security” or “Boot” section. As with enabling your TPM, if you can’t find the setting, check your PC's or motherboard’s manual.", "If your computer won’t boot after you enable Secure Boot, don’t worry—you just need to go through a couple of additional steps. Failure to boot is most likely because your hard drive or SSD is set up with an MBR (or Master Boot Record) partition table rather than the newer GPT (GUID Partition Table) format that Secure Boot and UEFI both require.", "To check, right-click the Start button or use the Windows + X keyboard shortcut and then click Disk Management in the menu that pops up. Right-click whatever drive that Windows is installed on (in most computers, it will be Disk 0, but not always if you have multiple hard drives), then click Properties, then check the Volumes tab. If your partition style is listed as MBR, that's when you'll need to convert the drive.", "To convert from MBR to GPT in Windows 10:", "If this conversion fails for some reason, the easiest option may be to do a clean reinstall of Windows 10 or 11 with Secure Boot enabled. When you format the drive and install Windows from a bootable USB stick, it will use GPT instead of MBR.", "Windows 11 24H2 includes some new AI and machine learning-related features that are designed to be run locally on your device, unlike the Copilot chatbot or earlier image generation features that use (and continue to use) server-side computing resources.", "Meeting the requirements for Copilot+ features requires a brand-new PC, and there's currently no way to upgrade any existing system to make it compatible. Here are the formal requirements:", "As of this writing, only three processor families meet the Copilot+ requirements: Qualcomm's Snapdragon X Elite and Plus chips, Intel's 200-series Core Ultra chips (codenamed Lunar Lake), and AMD's Ryzen AI 300-series. Intel will likely release the first Copilot+ compatible desktop processors late this year, when its next-gen \"Arrow Lake\" architecture is slated to be released.", "Several processors, like Intel's Core Ultra 100-series laptop CPUs and Core Ultra 200-series desktop CPUs, AMD's Ryzen 7040 and 8040 series laptop chips and 8000G-series desktop chips, and Qualcomm's Snapdragon 8cx Gen 3/Microsoft SQ3, include NPUs, but they all fall short of the performance Microsoft requires for the new features.", "None of these requirements affect whether you can install Windows 11 on your PC. But we have entered into a new phase of the operating system's life cycle when not all Windows 11 PCs will get the full superset of Windows 11 features.", "Here’s where things start to get fun (and by “fun,\" I mean “frustrating and moderately risky”).", "Officially, any PC that doesn’t meet all of Windows 11’s requirements gets treated the same. Unsupported means unsupported, and Microsoft doesn’t want you running Windows 11 on your PC.", "Unofficially, the Windows 11 installer distinguishes between two broad groups of unsupported PCs: there are PCs that support Secure Boot and have any kind of TPM at all, even an older TPM 1.2 module. And there are PCs that are missing one or both of those features.", "The short version is that if you bought your PC with Windows 8 or Windows 10 on it, an unsupported installation isn’t too difficult. If your PC was made to run Windows 7 or something even older (and if it still meets the 64-bit processor and RAM requirements), then it’s more difficult.", "The official system requirements for Windows 11 haven't changed, but Microsoft <em>has</em> made changes that will keep even unsupported installations from running on some older PCs. Changes to the kernel, compiler, and scheduler in Windows 11 24H2 mean that the update has dropped support for older 64-bit CPUs that don't support SSE 4.2 instructions.", "For Intel PCs, SSE 4.2 was introduced in 2008's first-generation Core CPUs; older Core 2 Duo and Core 2 Quad CPUs and 64-bit Pentium D and Celeron D CPUs won't run the 24H2 update. For AMD, SSE 4.2 was introduced in its Bulldozer architecture in 2011, eliminating older Athlon, Sempron, and Phenom models. None of these CPUs could run Windows 10 or Windows 11 very well; now they won't run Windows 11 at all.", "If you have a PC with one of these CPUs and you want to run Windows 11, the version 23H2 should still install and will be eligible for updates until 2026. But for hardware this old, recycling and replacing it is the better move.", "It should also go without saying that you still can't install a 32-bit version of Windows 11 because there is no 32-bit version of Windows 11.", "If you’re running the Windows 11 installer from within Windows to perform an upgrade install, the installer will refuse to run if your PC fails to meet the CPU or TPM requirements. This barrier to entry will keep casual users from easily downloading and installing Windows 11 on unsupported computers.", "But Microsoft  for those who really want to install Windows 11 on hardware that at least supports Secure Boot and some kind of TPM. It requires a trip to the Registry Editor, so tread lightly and ensure your important data is backed up.", "Windows 11 will now install normally, though you will see this update warning before you’re allowed to progress:", "These are also the steps you'll need to follow if you want to upgrade-in-place from one version of Windows 11 to another version (like going from version 22H2 or 23H2 to 24H2). My experience has been that Microsoft will not offer the major annual releases automatically to unsupported PCs.", "If you just want to do a clean install from a bootable USB drive, the Windows 11 USB installer will run normally on any PC as long as Secure Boot is enabled and some flavor of TPM is present, no registry edits required. This is convenient if you’re just installing Windows 11 for testing purposes or if you typically do a clean install any time you install a major OS update.", "If you were paying close attention right after Windows 11 was announced, you might remember that Microsoft briefly published a document with both “hard floor” and “soft floor” requirements for Windows, pictured above. Microsoft quickly removed this language, but it’s worth noting that the “hard floor” specs do seem to be what the bootable USB version of the Windows 11 installer is actually looking for.", "Systems without a TPM or Secure Boot support are trickier but not impossible. We'll outline all of the steps you need to use to manually skirt Windows 11's install requirements for those of you who prefer to know exactly what settings you're changing and why.", "But since the launch of Windows 11, an open source tool called  has  that automate some of the install tricks we outline below, and it can remove the Microsoft Account requirement for Windows 11 Home and Windows 11 22H2.", "To use Rufus, you'll want an 8GB-or-larger USB drive, plus . Select both the USB drive and the ISO file from within Rufus and hit Start, leaving all other settings at their default values; a confirmation pop-up will appear asking you whether you want to customize your installation. It's here that you can choose to remove the various install checks, including not just the Secure Boot and TPM requirements but also the RAM and storage requirements (though this isn't something we recommend).", "If you want to remove the Microsoft account sign-in requirement, note that the Rufus tool doesn't totally remove it but instead reverts the installer to the Windows 10-era status quo. If you connect to the Internet during setup, you'll still be asked to sign in before you can do anything else. If you leave your PC disconnected, you'll see a \"limited setup\" fallback option that will let you go ahead with a local Windows account.", "Importantly, removing these requirement checks (using Rufus or any other method) doesn't prevent Secure Boot or TPM features from working once you've installed Windows 11. The same Rufus-created USB stick can be used to install Windows 11 on both supported and unsupported systems with no loss of security or functionality.", "If you don't want to use Rufus, there are some relatively simple registry edits you can do to a vanilla Windows USB installer to get it working on a system that's missing a TPM, Secure Boot support, or both. (As far as I can tell, there's no way to do an upgrade install from within Windows 10 on one of these old computers, so a clean install is your best bet.)", "Using this method, you can get Windows 10 running on anything that meets the 24H2 update's more stringent CPU requirements. This method should also work on newer computers where Secure Boot was disabled for some reason. But in those cases, I think the easier path forward is to enable Secure Boot, install Windows 11, and then disable it again.", "The most prominent risk you take with an unsupported Windows 11 PC is the one Microsoft makes you acknowledge before you install the OS: The company reserves the right to withhold updates, including security updates, from these machines.", "Based on the last three years, I don't think Microsoft is likely to simply stop updating these machines randomly. But we may see more of what happened in the 24H2 update: Microsoft could decide to make under-the-hood changes that keep these computers from running Windows 11 at all since the company is under no obligation to keep supporting them.", "And just because your unsupported PC is getting new Windows security updates doesn't mean it's fully secure. Systems without TPMs will lack disk encryption features that newer PCs can benefit from. Old, insecure driver software stands almost no chance of being patched. Fixes for firmware-level security vulnerabilities will be infrequent at best or altogether unavailable (though some mitigations can be provided via software, a reason to at least keep Windows updated on these machines).", "Another risk you run, especially on computers made before 2015 or 2016, is the potential instability and incompatibility that comes from relying on older drivers. First-generation AMD Ryzen chips and 6th- and 7th-generation Intel Core processors aren’t on Microsoft’s support list, but they at least support the kinds of modern “DCH” drivers that Microsoft points to when it talks about the stability of Windows 11 systems.", "But the farther back you go, the more you risk running into old graphics, trackpad, or networking drivers that can cause big problems if they’re not working properly. And PC makers and chipmakers are not going back to their 2013-era chips to release new drivers or check that their old ones are working because, as a rule, there is no incentive for doing that.", "That’s up to you. If you’re not ready to drop everything and do a clean reinstall of Windows if something breaks, definitely not.", "But if you're running a first-gen Ryzen processor or a 6th- or 7th-generation Core processor and have 8GB or more of RAM, a reasonably modern integrated or dedicated GPU, and some kind of SSD, your Windows 11 experience should be pretty good. On the 6th-generation Dell Latitude laptop and Asus prebuilt gaming desktop I’ve tested the operating system on, I’ve generally found that driver support hasn’t been a problem and that Windows 11 runs about as well as Windows 10 did.", "On older computers, particularly those that shipped with Windows 7, Windows 8, or Windows 8.1, you’re probably better off continuing to run Windows 10 until Microsoft stops providing security updates next year. Just know that if you intend to keep using that system after October 2025,  you'll either need to pay an as-yet-undetermined amount to keep getting Windows 10 updates or you'll need to jump to an unsupported Windows 11 install or another OS entirely to stay up t0 date.", "One thing you probably don’t want to do on an unsupported system is enable . Older processors take a larger performance hit from enabling this feature than newer ones do, as . Microsoft has been enabling it by default more widely in the upcoming 22H2 version of Windows 11, so if you notice abnormally slow performance on an older PC that was running Windows 10 just fine, check to see whether that feature is enabled."]], "https://arstechnica.com/gadgets/2024/10/amazon-refreshes-its-monochrome-kindle-lineup-including-a-bigger-paperwhite/": ["Andrew Cunningham", "Amazon refreshes its monochrome Kindle lineup, including a bigger Paperwhite", ["Amazon is shaking up  today, at least by the slow-moving and relatively placid standards of the e-reader market. The company is announcing a major refresh to the , a screen-size bump for , and small tweaks to —a rare simultaneous refresh for devices that the company usually updates one or two at a time.", "In addition to the monochrome e-readers, Amazon introduced its first color e-reader today. The new , covered in more detail , looks almost identical to the new Paperwhite and launches on October 30 for $279.99.", "Going from most to least significant: The new Kindle Scribe's upgrades are mostly meant to make it a more paper-like writing experience. It has a new textured screen coating, a white screen bezel that blends into the screen (we've also seen this deployed in tablets like ), and a tweaked Premium Pen accessory with a \"new soft-tipped eraser\" that feels more like an actual pencil eraser.", "Other improvements are being implemented in software, not hardware. A new note-taking feature called Active Canvas allows you to draw in the margins of e-books, making text reflow around your notes—previously, handwritten notes opened a separate pop-up, just like typed notes.", "A future software update will let you hide and show those notes. What Amazon calls \"an AI-powered notebook\" will \"quickly summarize pages and pages of notes into concise bullets in a script font that can be easily shared directly from the notebook tab,\" and you'll be able to make a custom script font out of your own handwriting. Amazon tells us these features will ship out to the 2022 version of the Kindle Scribe starting in December.", "The new Kindle Scribe begins shipping on December 4 and starts at $399.99. This is a hefty increase over the first Scribe's $339.99 starting price, though the new Scribe does include the Premium Pen accessory by default. The old Scribe came with a cheaper Basic Pen accessory instead.", "The Kindle Paperwhite has been the mainstream default-choice Kindle since the very first one came out in 2012, and the new model continues in that tradition. It has a 7-inch screen, slightly increased from , with improved contrast thanks to \"an oxide thin-film transistor.\" Amazon also says page turns should be 25 percent faster than on the previous model.", "The new Paperwhite also inherits other niceties from older models: waterproofing, a USB-C port, and an even front light with adjustable brightness and color temperature.", "The regular Paperwhite starts at $159.99 for 16GB of storage and is now available. This is a $20 increase over the 2021 model, though it also doubles the storage. Amazon will continue to offer a Signature Edition of the Paperwhite starting at $199.99 with 32GB of storage, a sensor for automatic brightness and color temperature adjustments, and wireless charging.", "The basic Kindle may be the least upgraded of the three. Most of the core specs remain the same as they were for : a 6-inch 300 PPI screen, a weight of just 5.56 ounces (158 g), and a USB-C port with basic water intrusion detection. It's still not waterproof, but Amazon says the new version offers faster page turns, better contrast, and a 25 percent brighter front light that can now match the Paperwhite's brightness (though not the number of LEDs, the warm light, or the automatic brightness or color temperature sensors).", "The basic Kindle still has 16GB of internal storage and offers \"weeks\" of battery life. Like the Paperwhite, it's available to order today, and it's getting a small price increase, from $100 to $109.99.", "Both the Kindle and Kindle Paperwhite also come in Kindle Kids editions with two-year warranties, colorful cases, and a six-month subscription to . These upgrades usually add $20 to the prices of both models."]], "https://arstechnica.com/gadgets/2024/10/amazons-first-color-kindle-e-reader-the-kindle-colorsoft-will-run-you-280/": ["Andrew Cunningham", "Amazon’s first color Kindle e-reader, the Kindle Colorsoft, will run you $280", ["Amazon is overhauling . And nestled among the  to the base model Kindle, the mainstream Kindle Paperwhite, and the pen-centric Kindle Scribe is a first: the , Amazon's first color e-reader.", "The Colorsoft will launch on October 30 and starts at $279.99. That's quite a bit higher than the new Kindle Paperwhite, which starts at $159.99, but it's a little less than the $290 launch price of . The Colorsoft also includes 32GB of storage, wireless charging support, and sensors for automatically adjusting screen brightness and color temperature, all features that are only available in the $200 Kindle Paperwhite Signature Edition.", "Book covers and illustrations will be displayed in color on the Colorsoft's screen, and it will also support the same color-coded highlighting as the Kindle phone and tablet apps. Monochrome text and images are displayed at 300 PPI, the same as all other devices in the Kindle lineup, while color is displayed at 150 PPI.", "Stylistically, the Colorsoft looks essentially identical to the new 7-inch Kindle Paperwhite, just with a 7-inch color screen instead of a black-and-white one (the Colorsoft is also a shade heavier at 7.7 ounces instead of 7.4 for the Paperwhite). This separates it from older \"premium\" Kindles like the Oasis or the Voyage, which offered other niche features like capacitive or physical page-turn buttons or nicer front lights to separate themselves from the Paperwhite. The Colorsoft comes with a color screen. That's it.", "Amazon is hardly on the cutting edge of technology (or pricing) here. Kobo for considerably lower prices. No-name e-readers and e-ink Android tablets on Amazon have offered different kinds of color screens for several years. But the Kindle's popularity and the reach of Amazon's e-bookstore mean this is still a significant launch.", "Though it won't please the portion of the user base that still pines for physical buttons, for $10 <em>less</em> than the Kindle Oasis' launch price, a color screen is a more compelling and easier-to-explain feature. It may end up being a bit small for comics, and we'll need to see how saturated the color looks and how responsive the display is (both have been issues for some other color e-readers). But it's nice that Amazon's ecosystem now offers a color e-reader as an option."]], "https://arstechnica.com/apple/2024/10/first-ipad-mini-update-since-2021-gets-a-faster-chip-and-apple-intelligence/": ["Andrew Cunningham", "Apple A17 Pro chip is the star of the first iPad mini update in three years", ["Apple quietly announced a new version of its iPad mini tablet , the tablet's first update since 2021.", "The seventh-generation iPad mini looks mostly identical to , with a power-button-mounted Touch ID sensor and a slim-bezeled display. But Apple has swapped out the A15 Bionic chip for the Apple A17 Pro, the same processor it used in the iPhone 15 Pro last year.", "The new iPad mini is available for preorder now and starts at $499 for 128GB (an upgrade over the previous base model's 64GB of storage). 256GB and 512GB versions are available for $599 and $799, and cellular connectivity is an additional $150 on top of any of those prices.", "Apple says the A17 Pro's CPU performance is 30 percent faster than the A15's and that its GPU performance is 25 percent faster (in addition to supporting hardware-accelerated ray tracing). But the biggest improvement will be an increase in RAM—the A17 Pro comes with 8GB instead of the A15's 4GB, which appears to be Apple's floor for the new Apple Intelligence AI features. The new iPad mini will be the only iPad mini capable of supporting Apple Intelligence, which will begin rolling out with the iPadOS 18.1 update within the next few weeks.", "Other hardware upgrades are more marginal. All models upgrade from Wi-Fi 6 to Wi-Fi 6E, and the USB-C port now supports 10Gbps data transfers instead of topping out at 5Gbps. The 12 MP rear camera is the same resolution as the previous model, though it should benefit from any marginal improvements to the image signal processor in the A17.", "Like the iPad Pro and iPad Air refreshes earlier this year, the new iPad mini will only work with either the Apple Pencil Pro or the cheaper USB-C Apple Pencil, not the first- or second-generation Apple Pencils.", "Reliable rumors indicate that this won't quite be Apple's last hardware refresh of the year—we're also due for the first wave of M4 Macs, which  following an announcement at the end of the month."]], "https://arstechnica.com/gadgets/2024/10/ward-christensen-bbs-inventor-and-architect-of-our-online-age-dies-at-age-78/": ["Benj Edwards", "Ward Christensen, BBS inventor and architect of our online age, dies at age 78", ["Ward Christensen, co-inventor of the computer bulletin board system (), has died at age 78 in Rolling Meadows, Illinois. He was found deceased at his home on Friday after friends requested a wellness check. Christensen, along with , created the first BBS in Chicago in 1978, leading to an  of digital community-building that presaged much of our online world today.", "In the 1980s and 1990s, BBSes introduced many home computer users to multiplayer online gaming, message boards, and online community building in an era before the Internet became widely available to people outside of science and academia. It also gave rise to the  that led to companies like  today.", "Friends and associates remember Christensen as humble and unassuming, a quiet innovator who never sought the spotlight for his groundbreaking work. Despite creating one of the foundational technologies of the digital age, Christensen maintained a low profile throughout his life, content with his long-standing career at IBM and showing no bitterness or sense of missed opportunity as the Internet age dawned.", "\"Ward was the quietest, pleasantest, gentlest dude,\" said  creator Jason Scott in a conversation with Ars Technica. Scott documented Christensen's work extensively in a 2002 interview for that project. \"He was exactly like he looks in his pictures,\" he said, \"like a groundskeeper who quietly tends the yard.\"", "Tech veteran Lauren Weinstein initially  news of Christensen's passing on Sunday, and a close friend of Christensen's confirmed to Ars that Christensen likely died at his house overnight between October 10 and October 11. Friends called Police for a wellness check for Christensen on Friday when they had not heard from him as usual. The cause of death has not yet been announced.", "Prior to creating the first BBS, Christensen invented , a 1977 file transfer protocol that made much of the later BBS world possible by breaking binary files into packets and ensuring that each packet was safely delivered over sometimes unstable and noisy analog telephone lines. It inspired other file transfer protocols that allowed ad-hoc online file sharing to flourish.", "Christensen and Suess  for the first computer bulletin board system during the  when they wanted to keep up with their computer club, the Chicago Area Computer Hobbyists’ Exchange (CACHE), when physical travel was difficult. Beginning in January of that year, Suess assembled the hardware, and Christensen wrote the software, called .", "\"They finished the bulletin board in two weeks but they called it four because they didn't want people to feel that it was rushed and that it was made up,\" Scott told Ars. They canonically \"finished\" the project on February 16, 1978, and later wrote about their achievement in a  of Byte magazine.", "Their new system allowed personal computer owners with modems to dial up a dedicated machine and leave messages that others would see later. The BBS concept represented a digital version of a push-pin bulletin board that might flank a grocery store entrance, town hall, or college dorm hallway.", "Christensen and Suess openly shared the concept of the BBS, and others began writing their own BBS software. As these programs grew in complexity over time, the often hobbyist-run BBS systems that resulted allowed callers to transfer computer files and  as well as leave messages.", "Suess  in 2019, and with the passing of both BBS originators, we find ourselves at the symbolic end of an era, although many BBSes . These are typically piped through the Internet instead of a dial-up telephone line.", "While Christensen himself was always humble about his role in creating the first BBS, his contributions to the field did not go unrecognized. In 1992, Christensen received two , including a lifetime achievement award for \"outstanding contributions to PC telecommunications.\" The following year, the Electronic Frontier Foundation honored him with the .", "Professionally, Christensen enjoyed a long and successful career at IBM, where he worked from 1968 until his retirement in 2012. His final position at the company was as a field technical sales specialist.", "But mostly, Christensen kept a low profile.  When visiting online communities in his later years, Ward presented no ostentation, and there was no bragging about having made much of it possible. This amazed Scott, who said, \"I was always fascinated that Ward kept a Twitter account, just messing around.\"", "Scott feels like humility, openness, and the spirit of sharing are key legacies that Christensen has left behind.", "\"It would be like a person who was in a high school band saying, 'Eh, never really got into touring, never really had the urge to record albums or become a rock star,'\" Scott said.  \"And then later people come and go, 'Oh, you made the first [whatever] in your high school band,' but that sense of being at that locus of history and the fact that his immediate urge was to share all the code everywhere—that's to me what I think people should remember about this guy.\""]], "https://arstechnica.com/gadgets/2024/10/smart-gardening-firms-shutdown-a-reminder-of-internet-of-things-fickle-nature/": ["Scharon Harding", "Smart gardening firm’s shutdown a reminder of Internet of Things’ fickle nature", ["AeroGarden, which sells Wi-Fi-connected indoor gardening systems, is going out of business on January 1. While Scotts Miracle-Gro has continued selling AeroGarden products after announcing the impending shutdown, the future of the devices' companion app is uncertain.", "AeroGarden systems use hydroponics and LED lights to grow indoor gardens without requiring sunlight or soil. The smart gardening system arrived in 2006, and Scotts Miracle-Gro took over complete ownership . Some AeroGardens work with the iOS and Android apps that connect to the gardens via Wi-Fi and tell users when their plants need water or nutrients. AeroGarden also marketed the app as a way for users to easily monitor multiple AeroGardens and control the amount of light, water, and nutrients they should receive. The app offers gardening tips and can access AeroGarden customer service representatives and AeroGarden communities on Facebook and other social media outlets.", "Regarding the reasoning for the company's closure, AeroGarden's FAQ page only states:", "This was a difficult decision, but one that became necessary due to a number of challenges with this business.", "It's possible that AeroGarden struggled to compete with rivals, which include cheaper options for gardens and seed pods that are sold on Amazon and other retailers or made through DIY efforts.", "AeroGarden's closure is somewhat more surprising considering that it updated its app in June. But now it's unknown how long the app will be available. In an announcement last week, AeroGarden said that its app \"will be available for an extended period of time\" and that it'll inform customers about the app's \"longer-term status as we work through the transition period.\"", "However, that doesn't provide much clarity to people who may have invested in AeroGarden's Wi-Fi-enabled Bounty and Farm models. The company refreshed both lines in 2020, with the Farm line starting at $595 at the time. The gardens also marketed compatibility with Amazon Alexa. The gardens will still work without the app, but remote control features most likely won't whenever the app ultimately shuts down.", "Some users have  that AeroGarden's app protocol be open-sourced so that customers could continue to get full functionality of their AeroGardens, but much like , no such plans have been announced. While open-sourcing could help some AeroGardens maintain its value and better avoid becoming e-waste, there's also risk of the devices being hacked for alternative purposes that Scotts Miracle-Gro may not want to be associated with.", "AeroGarden's FAQ page states that moving forward, \"firmware updates may be performed on your devices to maintain security, but no action is required from you.\"", "AeroGarden customers can keep accessing their AeroGarden.com account and account history through March 1, and AeroGarden products will still be sold on Amazon through the end of 2024, the company's website states.", "The demise of AeroGarden is a reminder of the fickle nature of the Internet of Things, which can impress people with new, inventive products that may meet their demise sooner than their flashy, web-powered features originally imply. The Internet has enabled new features for consumer devices, but smart gadgets are also subject to the possibility of companies , , or otherwise ruining the user experience with updates that are  or .", "Sudden changes to consumer tech products' functionality are a concern for customers who sometimes spend  for smart capabilities, as well as the environment. The uncertainty of connected gadgets' longevity has led to calls for the US government to step in and require smart device packaging to clearly show."]], "https://arstechnica.com/gadgets/2024/10/lots-of-pcs-are-poised-to-fall-off-the-windows-10-update-cliff-one-year-from-today/": ["Andrew Cunningham", "Lots of PCs are poised to fall off the Windows 10 update cliff one year from today", ["One year from today, , Microsoft will stop releasing security updates for PCs that are still running Windows 10.", "Organizations and individuals will  for three more years of updates, with prices that go up steadily each year (Microsoft still hasn't provided pricing for end users, only saying that it will release pricing info \"closer to the October 2025 date.\") But for most PCs running Windows 10, the end of the line is in sight.", "Normally, this wouldn't be a huge deal; the last dregs of support for Windows 7 and Windows 8 dried up , and the world didn't end even though some PCs continue to run those OS versions. But there are three things about the end of Windows 10 support that are slightly different from other recent end-of-life dates:", "All of these factors taken together are setting us up for something we haven't really seen in the Windows ecosystem before: a majority or a large minority of active Internet-connected PCs that will suddenly stop getting security updates, leaving either paid support, a new PC, or a switch to an entirely different operating system as the easiest paths forward.", "Now that we're a year out from the end of Windows 10, and because Windows 10 does not appear to be going anywhere, we're publishing a series of articles exploring alternatives to spending money, either on a new PC or on continued Windows 10 updates.", "The path of least resistance is probably upgrading to an unsupported Windows 11 installation since the operating system will mostly run any software you're currently using in Windows 10. We're updating our guide for upgrading to Windows 11 to account for some small changes in the 24H2 update—whether you're using a supported PC that hasn't been configured properly or an unsupported PC. We're also planning to publish articles about the experience of actually using Windows 11 day-to-day on an unsupported PC, and we're also exploring alternate operating systems like Linux and ChromeOS Flex.", "All of these are reasonable options for keeping an old-but-working system up to date without spending money, assuming it's already got a properly activated Windows 10 installation. Whether you're trying to keep your own hardware going or you're trying to make some old hardware useful again, at least one of these should be a workable alternative to going over the Windows 10 update cliff a year from now."]], "https://arstechnica.com/apple/2024/10/asahi-linuxs-bespoke-gpu-driver-is-running-windows-games-on-apple-silicon-macs/": ["Andrew Cunningham", "Asahi Linux’s bespoke GPU driver is running Windows games on Apple Silicon Macs", ["A few years ago, the idea of running PC games on a Mac, in Linux, or on Arm processors would have been laughable. But the developers behind Asahi Linux—the independent project that is getting Linux working on Apple Silicon Macs—have managed to do all three of these things at once.", "The feat brings together a perfect storm of open source projects,  Asahi Linux GPU lead Alyssa Rosenzweig: the FEX project to translate x86 CPU code to Arm, the Wine project to get Windows binaries running on Linux, DXVK and the Proton project to translate DirectX 12 API calls into Vulkan API calls, and of course the Asahi project's Vulkan-conformant driver for Apple's graphics hardware.", "Games are technically run  because of differences in how Apple Silicon and x86 systems address memory—Apple's systems use 16 KB memory pages, while x86 systems use 4 KB pages, something that causes issues for Asahi and some other Arm Linux distros on  and a gap that the VM bridges.", "Rosenzweig's post shows off screenshots of <em>Control</em>, <em>Fallout 4</em>, <em>The Witcher 3</em>, <em>Ghostrunner</em>, <em>Cyberpunk 2077</em>, <em>Portal 2</em>, and <em>Hollow Knight</em>, though as she notes, most of these games won't run at anywhere near 60 frames per second yet.", "\"Correctness comes first. Performance improves next,\" she writes.", "The work on Asahi's Vulkan and OpenGL drivers is particularly impressive because Apple's own graphics drivers for macOS don't support most of these APIs. Apple's deprecated-but-not-removed OpenGL support tops out at version 4.1, the same level it's been , the year before Apple introduced the first version of .", "Rosenzweig published her first Vulkan 1.3-conformant version of the Asahi GPU driver, codenamed Honeykrisp, back in April, and since then she's added additional extensions required to support the DXVK translation layer. Some of these extensions have required emulating hardware features that the M-series GPUs don't support natively. The Asahi driver has also added support for OpenCL 3.0.", "The new driver and game compatibility is available in current Fedora Asahi Remix distros as an alpha, with a 1.0 release coming at some point down the line. It will run on M1- and M2-series Macs—Asahi doesn't support M3 systems yet, as the team —and Rosenzweig says that most games will require 16GB of RAM \"due to emulation overhead.\" But even with the current list of caveats, that games written for x86 Windows PCs can run on Arm Linux Macs is a huge technical achievement and a sign of how far Linux and all of these app and API translation layers have come."]], "https://arstechnica.com/gadgets/2024/10/trek-carback-bike-radar-lets-you-know-when-cars-are-approaching/": ["Eric Bangeman", "Trek CarBack bike radar lets you know when cars are approaching", [" class=\"p1\">\"Car back!\"", " class=\"p1\">If you've ever been on a group bike ride, you've no doubt heard these two words shouted by a nearby rider. It's also the name of Trek's new $199 bike radar.", " class=\"p1\">For safety-conscious cyclists, bike radars have been a game-changer. Usually mounted on the seat post, the radar units alert cyclists to cars approaching from behind. While they will work on any bike on any road, bike radar is most useful in suburban and rural settings. After all, if you're doing some urban bike commuting, you'll just assume cars are behind you because that's how it is. But on more open roads with higher speed limits or free-flowing traffic, bike radars are fantastic.", " class=\"p1\">While a handful of companies make them, the Garmin Varia is the best-known and most popular option. The Varia is so popular that it is nearing the proprietary eponym status of Kleenex and Taser among cyclists. Trek hopes to change that with its new .", " class=\"p1\">Like other bike radars, the CarBack can be used with either a cycling computer or your smartphone. Mounted either on a seat post or the back of a Bontrager saddle, the CarBack can detect vehicles approaching from as far away as 150 meters, beeping at you once one is in its range.", " class=\"p1\">The CarBack plays just as nicely with Garmin bike computers as the Varia does. When a car comes within range, your bike computer will chirp, the edges of the screen turn orange, and a dot showing the car's relative position travels up the right side of the screen—exactly the same as riding with a Varia.", " class=\"p1\">Speaking of the Varia, there are three significant differences between it and the CarBack. The first is the effective range, 140 meters for the Varia versus the CarBack's 150 meters. While riding, I didn't have the feeling that I was getting alerts sooner. But testing on a busy street demonstrated that the CarBack does have at least a few more meters of range than the Varia.", " class=\"p1\">When using the Trek Connections app, the CarBack will tell you if the approaching vehicle will give you the requisite three feet on the left, as the display shows the relative x-axis position of the car as well as the distance. Unfortunately, this feature doesn't work with a cycling computer.", " class=\"p1\">The biggest difference is battery life. The Varia claims 16 hours and the CarBack seven. That's about what I got, and as someone who regularly rides eight to 12 hours a week, I found myself having to charge the CarBack more frequently, running out of battery on one long ride after forgetting to check the charge after my previous ride. The CarBack does have a row of LED lights on one side that shows battery life at a glance.", " class=\"p1\">If you already own a Trek bike, the CarBack can be mounted to the back of your saddle using Trek's . More significantly, the CarBack has better range and, when used with the Trek app, a more granular display. But Trek missed an opportunity here to have the CarBack integrated with the TrekConnect app used with its e-bikes, such as the .", " class=\"p1\">Ultimately, the CarBack is a solid product. It does everything the Varia does for the same price, and it works just as well with a phone or a bike computer as Garmin's bike radar. Trek's radar does have a couple of advantages over the competition. Along with the greater range, there are little things, like USB-C charging and being able to check the battery level at a glance.", " class=\"p1\">But the tradeoff is significantly less battery life. Rated at seven hours, the CarBack has less than half the battery life of the Varia's 16-hour max. If recharging frequency is important to you, Varia is the clear recommendation. Otherwise, you can't go wrong with the CarBack."]], "https://arstechnica.com/gaming/2024/10/xbox-plans-to-set-up-shop-in-androids-play-store-if-court-order-holds/": ["Kevin Purdy", "Xbox plans to set up shop on Android devices if court order holds", ["After a  that Google must open its Play Store to allow for third-party app stores and alternative payment options, Microsoft is moving quickly to slide into this slightly ajar door.", "Sarah Bond, president of Xbox,  Thursday evening that the ruling \"will allow more choice and flexibility.\" \"Our mission is to allow more players to play on more devices so we are thrilled to share that starting in November, players will be able to play and purchase Xbox games directly from the Xbox App on Android,\" Bond wrote.", "Because the court order requires Google to stop forcing apps to use its own billing system and allow for third-party app stores inside Google Play itself, Microsoft now intends to offer Xbox games directly through its app. Most games will likely not run directly on Android, but a revamped Xbox Android app could also directly stream purchased or subscribed games to Android devices.", "Until now, buying Xbox games (or most any game) on a mobile device has typically involved either navigating to a web-based store in a browser—while avoiding attempts by the phone to open a store's official app—or simply using a different device entirely to buy the game, then playing or streaming it on the phone.", "Microsoft has been quick to expand its Xbox brand's availability outside its hardware. It made similar moves to capitalize on EU regulators' attempts to disentangle Google's and Apple's app stores  last year. It has considered  and itch.io onto its Xbox platform. Xbox had planned to  on the web in July, though that has yet to arrive.", "A more robust Android app/store/streaming tool could be another way for Xbox to , not just a console hardware vendor.", "Google has announced that  and specifically ask for the remedies that would make Xbox's app more capable to be paused while the appeal is pending. In defending Google's position, Lee-Anne Mulholland, vice president for regulatory affairs, claims that \"most Android devices come preloaded with two or more app stores right out of the box\" and notes that Epic Games' <em>Fortnite</em> has been available through the Samsung Galaxy Store and through sideloading—\"options that developers have never been able to offer to their American users on iPhones.\"", "em>This post was update at 10:54 a.m. to clarify language about the US court's ruling.</em"]], "https://arstechnica.com/gadgets/2024/10/eleven-things-to-know-about-in-the-windows-11-2024-update/": ["Andrew Cunningham", "Eleven things to know about in the Windows 11 2024 Update", ["The , also known as Windows 11 24H2, started rolling out last week. Your PC may have even installed it already!", "The continuous feature development of Windows 11 (and Microsoft's phased update rollouts) can make it a bit hard to track exactly what features you can expect to be available on any given Windows PC, even if it seems like it's fully up to date.", "This isn't a comprehensive record of all the changes in the 2024 Update, and it doesn't reiterate some basic but important things like Wi-Fi 7 or 80Gbps USB4 support. But we've put together a small list of new and interesting changes that you're guaranteed to see when your version number rolls over from 22H2 or 23H2 to 24H2. And while Microsoft's announcement post spent most of its time on Copilot and features unique to Copilot+ PCs, here, we'll only cover things that will be available on any PC you install Windows 11 on ().", "The Quick Settings panel sees a few nice quality-of-life improvements. The biggest is a little next/previous page toggle that makes all of the Quick Settings buttons accessible without needing to edit the menu to add them. Instead of clicking a button and entering an edit menu to add and remove items from the menu, you click and drag items between pages. The downside is that you can't see all of the buttons at once across three rows as you could before, but it's definitely more handy if there are some items you want to access sometimes but don't want to see <em>all</em> the time.", "A couple of individual Quick Settings items see small improvements: a refresh button in the lower-right corner of the Wi-Fi settings will rescan for new Wi-Fi networks instead of making you exit and reopen the Wi-Fi settings entirely. Padding in the Accessibility menu has also been tweaked so that all items can be clearly seen and toggled without scrolling. If you use one or more VPNs that are managed by Windows' settings, it will be easier to toggle individual VPN connections on and off, too. And a  accessibility button to generate automatic captions for audio and video is also present in Quick Settings starting in 24H2.", "One of the first things a fresh Windows install does when it connects to the Internet is dump a small collection of icons into your Start menu, things grabbed from the Microsoft Store that you didn't ask for and may not want. The exact apps change from time to time, but these auto-installs have been happening since the Windows 10 days.", "The 24H2 update makes this problem subtly worse by adding more \"recommendations\" to the lower part of the Start menu below your pinned apps. This lower part of the Start menu is usually used for recent files or newly (intentionally) installed apps, but with recommendations enabled, it can also pull recommended apps from the Microsoft Store, giving Microsoft's app store yet another place to push apps on you.", "These recommendations change every time you open the Start menu—sometimes you'll see no recommended apps at all, and sometimes you'll see one of a few different app recommendations. The only thing that distinguishes these items from the apps and files you have actually interacted with is that there's no timestamp or \"recently added\" tag attached to the recommendations; otherwise, you'd think you had downloaded and installed them already.", "These recommendations can be turned off in the Start menu section of the Personalization tab in Settings.", "When Windows 11 redesigned the right-click/context menu to help clean up years of clutter, it changed basic commands like copy and paste from text labels to small text-free glyphs. The 2024 Update doesn't walk this back, but it does add text labels back to the glyphs, just in case the icons by themselves didn't accurately communicate what each button was used for.", "Windows 11's user interface is full of little things like this—stuff that was changed from Windows 10, only to be changed <em>back </em>in subsequent updates, either because people complained or because the old way was actually better (few text-free glyphs are truly as unambiguously, universally understood as a text label can be, even for basic commands like cut, copy, and paste).", "The 24H2 update introduces something that Microsoft calls \".\"", "To recap, each annual Windows update also has a new major build number; for 24H2, that build number is 26100. In 22H2 and 23H2, it was 22621 and 22631. There's also a minor build number, which is how you track which of Windows' various monthly feature and security updates you've installed. This number starts at zero for each new annual update and slowly increases over time. The PC I'm typing this on is running Windows 11 build 26100.1882; the first version released to the Release Preview Windows Insider channel in June was 26100.712.", "In previous versions of Windows, any monthly cumulative update that your PC downloads and installs can update <em>any </em>build of Windows 11 22H2/23H2 to the newest build. That's true whether you're updating a fresh install that's missing months' worth of updates or an actively used PC that's only a month or two out of date. As more and more updates are released, these cumulative updates get larger and take longer to install.", "Starting in Windows 11 24H2, Microsoft will be able to designate specific monthly updates as \"checkpoint\" updates, which then become a new update baseline. The next few months' worth of updates you download to that PC will contain <em>only</em> the files that have been changed since the last checkpoint release instead of every single file that has been changed since the original release of 24H2.", "If you're already letting Windows do its update thing automatically in the background, you probably won't notice a huge difference. But Microsoft says these checkpoint cumulative updates will \"save time, bandwidth, and hard drive space\" compared to the current way of doing things, something that may be more noticeable for IT admins with dozens or hundreds of systems to keep updated.", "A Windows version of the venerable Linux sudo command—short for \"superuser do\" or \"substitute user do\" and generally used to grant administrator-level access to whatever command you're trying to run—first showed up in experimental Windows builds . The feature has formally been added in the 24H2 update, though it's off by default, and you'll need to head to the System settings and then the \"For developers\" section to turn it on.", "When enabled, Sudo for Windows (as Microsoft ) allows users to run software as administrator without doing the dance of launching a separate console window as an administrator.", "By default, using Sudo for Windows will still open a separate console window with administrator privileges, similar to the existing <code>runas</code> command. But it can also be configured to run inline, similar to how it works from a Linux or macOS Terminal window, so you could run a mix of elevated and unelevated software from within the same window. A third option, \"with input disabled,\" will run your software with administrator privileges but won't allow additional input, which Microsoft says reduces the risk of malicious software gaining administrator privileges via the sudo command.", "One thing the <code>runas</code> command supports that Sudo for Windows doesn't is the ability to run software as any local user—you can run software as the currently-logged-in user or as administrator, but not as another user on the machine, or using an account you've set up to run some specific service. Microsoft says that \"this functionality is on the roadmap for the sudo command but does not yet exist.\"", "Microsoft is gradually phasing out third-party print drivers in Windows in favor of more widely compatible universal drivers. Printer manufacturers will still be able to add things on top of those drivers with their own apps, but the drivers themselves will rely on standards like the Internet Printing Protocol (IPP), defined by the Mopria Alliance.", "Windows 11 24H2 doesn't end support for third-party print drivers yet; Microsoft's plan for switching over . But 24H2 does give users and IT administrators the ability to flip the switch early. In the Settings app, navigate to \"Bluetooth &amp; devices\" and then to \"Printers &amp; scanners\" and enable Windows protected print mode to default to the universal drivers and disable compatibility. You may need to reconnect to any printer you had previously set up on your system—at least, that was how it worked with a network-connected Brother HL-L2340D I use.", "This isn't a one-way street, at least not yet. If you discover your printer won't work in protected print mode, you can switch the setting off as easily as you turned it on.", "When you create a bootable USB drive to install a fresh copy of Windows—because you've built a new PC, installed a new disk in an existing PC, or just want to blow away all the existing partitions on a disk when you do your new install—the interface has stayed essentially the same since Windows Vista launched back in 2006. Color schemes and some specific dialog options have been tweaked, but the interface itself has not.", "For the 2024 Update, Microsoft has spruced up the installer you see when booting from an external device. It accomplishes the same basic tasks as before, giving you a user interface for entering your product key/Windows edition and partitioning disks. The disk-partitioning interface has gotten the biggest facelift, though one of the changes is potentially a bit confusing—the volumes on the USB drive you're booted from also show up alongside any internal drives installed in your system. For most PCs with just a single internal disk, disk 0 should be the one you're installing to.", "Microsoft's obnoxious no-exceptions Microsoft account requirement for all new PCs (and new Windows installs) is at its most obnoxious when you're installing on a system without a functioning network adapter. This scenario has come up most frequently for me when clean-installing Windows on a brand-new PC with a brand-new, as-yet-unknown Wi-Fi adapter that Windows 11 doesn't have built-in drivers for. Windows Update is usually good for this kind of thing, but you can't use an Internet connection to fix not having an Internet connection.", "Microsoft has added a fallback option to the first-time setup process for Windows 11 that allows users to install drivers from a USB drive if the Windows installer doesn't already include what you need. As a failover, would we prefer to see an easy-to-use option that <em>didn't</em> require Microsoft account sign-in? Sure. But this is better than it was before.", "To bypass this entirely, there are still local account workarounds available for experts. Pressing Shift + F10, typing OOBE\\BYPASSNRO in the Command Prompt window that opens, and hitting Enter is still there for you in these situations.", "The 24H2 update has boosted the default security for SMB file-sharing connections, though, as Microsoft Principal Program Manager Ned Pyle , it may result in some broken things. In this case, that's generally a <em>good</em> thing, as they're only breaking because they were less secure than they ought to be. Still, it may be dismaying if something suddenly stops functioning when it was working before.", "The two big changes are that all SMB connections need to be  to prevent  and that Guest access for SMB shares is disabled in the Pro edition of Windows 11 (it had already been disabled in Enterprise, Education, and Pro for Workstation editions of Windows in the Windows 10 days). Guest fallback access is still available by default in Windows 11 Home, though the SMB signing requirement does apply to all Windows editions.", "Microsoft notes that this will mainly cause problems for home NAS products or when you use your router's USB port to set up network-attached storage—situations where security tends to be disabled by default or for ease of use.", "If you run into network-attached storage that won't work because of the security changes to 24H2, Microsoft's  is to make the network-attached storage more secure. That usually involves configuring a username and password for access, enabling signing if it exists, and installing firmware updates that might <em>enable</em> login credentials and SMB signing on devices that don't already support it. Microsoft also recommends replacing older or insecure devices that don't meet these requirements.", "That said, advanced users can turn off both the SMB signing requirements and guest fallback protection by using the Local Group Policy Editor. Those steps are outlined . That post also outlines the process for disabling the SMB signing requirement for Windows 11 Home, where the Local Group Policy Editor doesn't exist.", "Several technology hype cycles ago, before the Metaverse and when most \"AI\" stuff was still called \"machine learning,\" Microsoft  called Windows Mixed Reality. Built on top of work it had done on its HoloLens headset in 2015, Windows Mixed Reality was meant to bring in app developers and the PC makers and allowed them to build interoperable hardware and software for both virtual reality headsets that covered your eyes entirely and augmented reality headsets that superimpose objects over the real world.", "But like some other mid-2010s VR-related initiatives, both HoloLens and Windows Mixed Reality kind of fizzled and flailed, and both are on their way out. Microsoft officially announced  at the beginning of the month, and Windows 11 24H2 utterly removes everything Mixed Reality from Windows.", "Microsoft  (in a message that proclaims \"we remain committed to HoloLens\"), though this is a shorter off-ramp than some deprecated features (like the Android Subsystem for Windows) have gotten. Users who want to keep using Windows Mixed Reality can continue to use Windows 23H2, though support will end for good in November 2026 when .", "We've , but the 24H2 update is the one that , the rich text editor that has always existed a notch above Notepad and many, many notches below Word in the hierarchy of Microsoft-developed Windows word processors.", "WordPad's last update of any real substance came in 2009, when it was given the then-new \"ribbon\" user interface from the then-recent Office 2007 update. It's one of the few in-box Windows apps not to see some kind of renaissance in the Windows 11 era; Notepad, by contrast, has gotten more new features in the last two years than it had in the preceding two decades. And now it has been totally removed, gone the way of  and Encarta."]], "https://arstechnica.com/gadgets/2024/10/intels-core-ultra-200s-cpus-are-its-biggest-desktop-refresh-in-three-years/": ["Andrew Cunningham", "Intel’s Core Ultra 200S CPUs are its biggest desktop refresh in three years", ["Intel's 14th-generation desktop processors were a mild update on top of a mild update: a barely faster revision of the 13th-gen Core CPUs, which were themselves a modest tweak to 2021's 12th-gen Core processors. The new Core Ultra CPUs (and their underlying architectural changes) were exclusive to laptops.", "Today, that changes: The Core Ultra 200S processors (codenamed Arrow Lake) will bring to desktops many of the changes Intel has made to its Core Ultra 100- and 200-series laptop CPUs (Meteor Lake and Lunar Lake, respectively). Changes include a new chiplet-based design, new manufacturing technologies, updated CPU and GPU architectures, and a neural processing unit (NPU) for accelerating some AI and machine learning workloads.", "All of the new processors launch on October 24th.", "As with the Lunar Lake-based laptop chips, Intel has said that power efficiency is a big focus for Arrow Lake—a welcome change after seeing how much power the 13th- and 14th-generation CPUs could consume when they were allowed. But also as with the laptop processors, the Core Ultra desktop CPUs aren't always a straightforward performance upgrade from their predecessors—they're usually faster, but how <em>much</em> faster depends a lot on what you're asking them to do, at least according to the Intel-provided performance figures.", "The big under-the-hood change to Arrow Lake is that it shifts to a chiplet-based design, where multiple silicon dies are bound together using Intel's Foveros packaging technology. Foveros uses an Intel-manufactured \"base tile\" as an interconnect, allowing for communication between four TSMC-manufactured tiles: a compute tile for the CPU cores; a GPU tile for the graphics cores; an SoC tile that includes the NPU, video encoding and decoding blocks, and display outputs; and an I/O tile that mainly handles the DDR5 memory controller (Core Ultra 200S no longer supports DDR4, following AMD's lead).", "Like the Lunar Lake laptop chips, Arrow Lake will be an Intel-designed processor where most of the silicon won't actually be made in Intel's factories, aside from the base tile. The compute tile is manufactured on a 3 nm TSMC process, the GPU is a 5 nm TSMC process, and both the SoC and I/O tiles use a 6 nm process.", "Compared to 14th-generation processors, Intel says that Core Ultra 200S chips should provide a 10 percent increase in multi-core performance while using 30 percent less power. Though the integrated GPU will remain nothing to write home about, it should also be about twice as fast as the UHD 770 integrated GPU included in 12th-, 13th-, and 14th-generation Core chips.", "Intel is announcing three distinct processors today, five if you count the GPU-less variants: the $589 Core Ultra 9 285K, the $394 and $379 Core Ultra 7 265K and KF, and the $309 and $294 Core Ultra 5 245K and KF. These are all unlocked, overclockable processors, and they differ primarily by clock speed and core count. The GPUs and NPUs are the same across the lineup for the chips that include GPUs.", "The 245K has six P-cores and eight E-cores and tops out at 5.2 GHz, the 265K has eight P-cores and 12 E-cores and tops out at 5.5 GHz, and the 285K has eight P-cores and 16 E-cores and maxes out at 5.7 GHz. Those core counts match what Intel was offering in analogous 14th-generation CPUs, and pricing is also roughly in line with Intel's initial list prices for the 14th-generation CPUs.", "The P-cores use Intel's Lion Cove architecture, the same that Intel uses for Lunar Lake. Intel has totally removed Hyper-threading from these cores, lowering the overall thread count substantially compared to 13th- and 14th-gen Core processors, but Intel has said that the silicon space needed for Hyper-threading is better spent elsewhere now that gobs of low-power E-cores are available to split up heavily threaded workloads; the company says that Lion Cove features a 9 percent increase in instructions per clock compared to previous-generation Raptor Cove P-cores. Because the Core Ultra CPUs run at slightly slower peak clock speeds, this means that single-core performance should more or less break even.", "Performance gains for the Skymont E-cores are a bit more pronounced; Intel says they're 32 percent faster on average than the old Gracemont E-cores in integer workloads, 72 percent faster on average in single-core floating-point workloads, and 55 percent faster on average in multi-threaded floating-point workloads. Though you lose the performance benefits of Hyper-threading on the P-cores, these IPC improvements on the E-cores are where Intel is getting its claimed 10 percent generational performance boost over the 14th-generation CPUs.", "In games—which generally benefit most from single-core performance improvements—Intel's figures show that performance is basically a wash between the Core Ultra 200S chips and the 14th-generation Core processors. Sometimes Arrow Lake is a little faster, sometimes it's a little slower, but on average, it's about the same. But it achieves those frame rates using 73 W less power on average, and while running cooler by an average of 13 degrees Celsius.", "Though these are Intel's first desktop processors with NPUs included—AMD beat Intel to the punch here with the Ryzen 8000G series, though these are technically laptop silicon repackaged for desktop use—the NPU won't be good enough to meet Microsoft's requirements for .", "Microsoft wants an NPU that can process at least 40 trillion operations per second (TOPS); Arrow Lake's NPU offers 13 TOPS, barely more than the 11 TOPS that the Core Ultra 100-series laptop CPUs offered. That may be because it's the same basic NPU—Intel just refers to this architecture as \"NPU 3,\" while the Core Ultra 200V laptop chips use NPU 4.", "Though I don't really see any of the current Copilot+ features as must-haves—right now, they're mostly focused on image generation and webcam effects, and they'll eventually power Windows' controversial Recall feature—it is a little disappointing that we still don't have a desktop processor that will support a superset of all Windows 11 features.", "New chips do require a long lead time, and it's possible (probable, even) that Arrow Lake's design was finalized well before Microsoft defined its Copilot+ performance requirements back in May. But given that Intel worked Lunar Lake's more advanced P-core and E-core architectures into the Arrow Lake desktop chips, it's too bad that the newer NPU couldn't also come along for the ride. Maybe next year.", "Arrow Lake includes a better GPU than the old 12th-through-14th-generation Core CPUs, though like the NPU, it's more similar to last year's Meteor Lake Core Ultra 100-series GPU than the new GPU from the Lunar Lake laptop chips.", "All three of the processors with GPUs use four Xe cores based on a version of the older \"Alchemist\" GPU architecture from the A-series Intel Arc GPUs. Like those Arc GPUs, the integrated Xe GPU here supports hardware-accelerated ray tracing, high-quality XeSS upscaling, and hardware-accelerated encoding and decoding for the AV1 video codec.", "But despite these improvements and Intel's claimed 2x performance increase compared to the UHD 770 integrated GPU, this still isn't meant for anything other than basic low-end gaming. In high-end desktops, it will mainly be useful for driving additional displays on top of whatever your dedicated GPU can handle. (It's not clear whether the KF-series processors without GPUs will feature hardware-accelerated video encoding and decoding; they typically don't, but only because those features are normally a part of the GPU. In Arrow Lake, that hardware is in the SoC tile instead).", "Intel's desktop platforms will continue to use a chipset that's totally separate from the CPU package, unlike its laptop chips, which combine a CPU/GPU/chipset. The new 800-series chipsets can support \"up to\" 24 PCIe 4.0 lanes, which can be used for M.2 SSDs and various ports depending on how your motherboard maker decides to use them.", "The chipsets will support up to two integrated Thunderbolt 4 ports—the first time these have been integrated directly into a desktop chipset rather than requiring a separate controller—up to 10 USB 3.2 ports that can transfer at speeds up to 20Gbps and include Wi-Fi 6E, Bluetooth 5.3, and 1Gbps Ethernet support. Some motherboard makers are already advertising Z890 motherboards, which will be required if you want to do any CPU overclocking—lower-end 800-series chipsets haven't been announced yet, but expect more affordable versions to come with fewer PCIe lanes and port options.", "While 12th-, 13th-, and 14th-generation Core CPUs all used the same LGA1700 processor socket and could all work in any 600- or 700-series motherboard as long as you'd installed a BIOS update, this year's new 800-series chipsets come with an all-new LGA1851 socket. According to announcements from CPU cooler manufacturers like  and , most coolers that work with LGA1700-series CPUs and motherboards should also be compatible with LGA1851, though you should check your manufacturer's website to make sure you don't need some kind of adapter or bracket for installation."]], "https://arstechnica.com/gadgets/2024/10/amazon-apple-make-a-deal-to-offer-apple-tv-in-a-prime-bundle/": ["Samuel Axon", "Amazon, Apple make a deal to offer Apple TV+ in a Prime bundle", ["Apple TV+ will now be available as an add-on in Amazon Prime Video bundles, and users will be able to watch Apple TV+ films and shows in Prime Video apps and devices without downloading a separate app, the two companies .", "The offering from Amazon promises to give users the option to stick with a familiar app and manage payments through one billing system.", "Despite considerable media buzz and critical acclaim for its shows, Apple TV+ has lagged behind many of its competitors in terms of both total subscribers and retention. The deal with Amazon could expose Apple TV+ to new customers, and the bundled nature of this subscription could help retain them even in slower content periods.", "Apple TV+ will cost $9.99 as an add-on in the Prime Video app—the same price users pay when they subscribe to Apple's service directly.", "Given Apple's history with TV, this move is actually somewhat surprising, despite the benefits. That's because Apple has long held ambitions of doing exactly what Amazon is doing here: establishing itself as the central library, viewing, search, and payment hub for a variety of subscription offerings.", "That vision goes back to Steve Jobs, who often talked in interviews about how he wanted to have the same kind of impact on the TV industry as Apple had on music.", "He and other Apple leaders have noted that cable TV bundles were a hassle and were too expensive, forcing customers to pay to subsidize content they weren't interested in. For example, a significant part of the cost of basic cable goes toward sports networks, but not everyone wants to watch sports regularly.", "The Apple TV platform, tvOS, and the original Apple TV app were to solve this problem by offering an a la carte, consumer-friendly way to manage the options in a burgeoning streaming-TV industry.", "However, Apple's attempt to make the TV app a universal hub of content has been continually stymied by the fact that industry giant Netflix has declined to participate.", "Users of the TV app and Apple TV set-top-box still must launch a separate Netflix app to see their watch history on that service, or to see if movies or shows they want to watch are available. Content from most other services—including Amazon Prime Video—is exposable through search within the app and rolls into a unified watch history.", "Further, streaming services have become increasingly expensive, and streamers have begun trying to find new revenue from sources like  and . The reasons for these trends are complex, but one of the key problems is that scripted television content is immensely expensive to produce—especially as the prestige TV era has driven up viewer expectations in terms of quality and production values.", "As an early leader in the industry, Netflix established unrealistic expectations for everyone involved—consumers, production houses, investors, and so on—by simply throwing immense amounts of money into content without immediately seeing a return.", "When larger economic factors put an end to that practice, streamers had to adjust—including Apple, which among other things is  for the new landscape.", "Apple still offers several of those central hub features—for example, you can subscribe to services like Paramount+ and launch their shows from the Apple TV app, just like Amazon is doing with its app and Apple TV+ here. But the realities of the mess the industry finds itself in have clearly led Apple to keep an open mind about how it can attract and retain viewers."]], "https://arstechnica.com/gadgets/2024/10/former-apple-hardware-chief-dan-riccio-is-retiring/": ["Samuel Axon", "Former Apple hardware chief Dan Riccio is retiring", ["Dan Riccio, one of Apple's most prominent executives for more than two decades, will retire from the company this month, according to a report in  that cites people with knowledge of the move.", "Reportedly, Riccio has said he has been planning his retirement for the past five years, and his last day will be Friday, October 11.", "Riccio began working at Apple in 1998, and by 2012, he had become the chief of hardware engineering. In that role, he oversaw several major hardware developments for Apple, including AirPods, the evolution of the modern iPhone, the iPad Pro, and more.", "He held the title of senior vice president of hardware engineering during that time, then  within the company in January of 2021. The public at first only knew that he was working on a \"new project\" at that time, but before long it became clear the project in question was , Apple's augmented-reality headset that .", "The group that produced the Vision Pro is called the Vision Products Group within the company; that's the 2,000-engineer-strong group Riccio has overseen since 2021. He was also involved in developing Project Titan, Apple's smart car initiative that was eventually abandoned.", "John Ternus took on the SVP of hardware engineering mantle when Riccio switched his focus to the Vision platform in 2021, and Ternus appears set to continue in that capacity. Ternus will now oversee the Vision Products Group at the top level alongside the other hardware projects he's already responsible for, while Mike Rockwell will continue managing the group day to day.", "As both Bloomberg and Daring Fireball note, this transition was planned long before the launch of the Vision Pro and began with his move from the broader hardware role to the Vision-focused one, so it should not be interpreted as a repercussion of Vision Pro's slow sales.", "Apple did not price or market Vision Pro as a mass consumer product in the same way as the iPhone or Apple Watch. Instead, it seems positioned as the opening move in a long journey to develop, perfect, and gain a foothold in a new area of computing of future interest.", "A number of prominent executives have left Apple in recent years, and some of the others have also followed the process of first narrowing the role to something focused on a single concern or product, followed by actual retirement."]], "https://arstechnica.com/ai/2024/10/man-learns-hes-being-dumped-via-dystopian-ai-summary-of-texts/": ["Benj Edwards", "Man learns he’s being dumped via “dystopian” AI summary of texts", ["On Wednesday, NYC-based  Nick Spreen received a surprising alert on his iPhone 15 Pro, delivered through an early test version of Apple's upcoming  text message summary feature. \"No longer in a relationship; wants belongings from the apartment,\" the AI-penned message reads, summing up the content of several separate breakup texts from his girlfriend.", "Spreen shared a screenshot of the AI-generated message in a  on the X social network, writing, \"for anyone who’s wondered what an apple intelligence summary of a breakup text looks like.\" Spreen told Ars Technica that the screenshot does not show his ex-girlfriend's full real name, just a nickname.", "This summary feature of Apple Intelligence, announced by the iPhone maker in June, isn't expected to fully ship until an iOS 18.1 . However, it has been  of iOS 18 since July, which is what Spreen is running on his iPhone. It works akin to something like a stripped-down , reading your incoming text messages and delivering its own simplified version of their content.", "On X, Spreen  to skepticism over whether the message was real in a follow-up post. \"Y<span class=\"css-1jxf684 r-bcqeeo r-1ttztb7 r-qvutc0 r-poiln3\">es this was real / yes it happened yesterday / yes it was my birthday</span>,\" Spreen wrote. In response to a  about it being a fair summary of his girlfriend's messages, he , \"it is.\"", "We reached out to Spreen directly via email and he delivered his own summary of his girlfriend's messages. \"It was something along the lines of i can’t believe you just did that, we’re done, i want my stuff. we had an argument in a bar and I got up and left, then she sent the text,\" he wrote.", "How did he feel about getting the news via AI summary? \"I do feel like it added a level of distance to it that wasn’t a bad thing,\" he told Ars Technica. \"Maybe a bit like a personal assistant who stays professional and has your back even in the most awful situations, but yeah, more than anything it felt unreal and dystopian.\"", "Spreen's message is the first time we've seen an AI-mediated relationship breakup, but it likely won't be the last. As the Apple Intelligence feature rolls out widely and other tech companies embrace AI message summarization, many people will probably be receiving bad news through AI summaries soon. For example, since March, Google's Android Auto AI has been able to  to users while driving.", "If that sounds horrible, consider our ever-evolving social tolerance for tech progress. Back in the 2000s when SMS texting was still novel, some etiquette experts considered breaking up a relationship through text messages to be inexcusably rude, and it was unusual enough to generate a . The sentiment apparently extended to Americans in general: According to , a 2007 survey commissioned by Samsung showed that only about 11 percent of Americans thought it was OK to break up that way.", "By 2009, as texting became more commonplace, the stance on texting break-ups began to soften. That year, ABC News  Kristina Grish, author of \"The Joy of Text: Mating, Dating, and Techno-Relating,\" as saying, \"When Britney Spears dumped Kevin Federline I thought doing it by text message was an abomination, that it was insensitive and without reason.\" Grish was referring to a  with the pop singer that made headline news. \"But it has now come to the point where our cell phones and BlackBerries are an extension of ourselves and our personality. It's not unusual that people are breaking up this way so much.\"", "Today, with text messaging basically being the default way most adults communicate remotely, breaking up through text is commonplace enough that Cosmopolitan  in a 2023 article. \"I can tell you with complete confidence as an experienced professional in the field of romantic failure that of these options, I would take the breakup text any day,\" wrote Kayle Kibbe.", "Who knows, perhaps in the future, people will be able to ask their personal AI assistants to contact their girlfriend or boyfriend directly to deliver a personalized break-up for them with a sensitive message that attempts to ease the blow. But what's next—break-ups on the moon?"]], "https://arstechnica.com/gadgets/2024/10/maze-of-adapters-software-patches-gets-a-dedicated-gpu-working-on-a-raspberry-pi/": ["Andrew Cunningham", "Maze of adapters, software patches get a dedicated GPU working on a Raspberry Pi", ["Raspberry Pi owners have always been prone to coming up with elaborate, technically interesting but practically questionable projects, and Pi enthusiast Jeff Geerling has: connecting an old AMD Radeon RX 460 GPU to the Raspberry Pi 5's PCI Express bus and managing to play demanding titles like <em>Doom 3</em> (2004) and <em>Tux Racer </em>at a crisp 4K resolution.", "Geerling's maze of adapters, software tweaks, and workarounds is a testament both to his ingenuity and the flexibility of the Raspberry Pi and its ecosystem. By default, the Pi 5 provides a single PCI Express 2.0 lane for use with external accessories (most commonly M.2 SSDs for storage). Geerling uses an M.2 slot on the Pi and then connects it to an external GPU dock using an M.2-to-Oculink adapter. This gets the GPU connected to the Pi's PCIe bus.", "But there were other problems that had to be solved as well. The Pi's PCIe slot can only provide 5 W of power for external accessories, far short of the 75 W that a desktop graphics card would be able to get from a typical PCIe slot in a motherboard. Geerling needed to provide external power to both the GPU and to the slot itself to make sure that the RX 460 could draw all the power it needed to.", "With the hardware end of things set up, turn your attention to the array of software fixes needed to get an Arm64 version of Linux working with an external GPU. Geerling first applied a documented software patch that bumps the Pi's PCIe lane from version 2.0 to 3.0, providing an important bandwidth boost to a GPU that's only getting 1/8th as many PCIe lanes as it normally would.", "Actually getting the GPU working required patching the Linux kernel to include the open source AMDGPU driver, which  and provides decent support for the RX 460 (Geerling says the card and its Polaris architecture were chosen because they were new enough to be practically useful and to be supported by the AMDGPU driver, old enough that driver support is pretty mature, and because the card is cheap and uses PCIe 3.0). Nvidia's GPUs generally aren't really an option for projects like this because the open source drivers lag far behind the ones available for Radeon GPUs.", "Once various kernel patches were applied and the kernel was recompiled, installing AMD's graphics firmware got both graphics output and 3D acceleration working more or less normally.", "Despite their age and relative graphical simplicity, running <em>Doom 3</em> or<em> Tux Racer</em> on the Pi 5's GPU is a tall order, even at 1080p. The RX 460 was able to run both at 4K, albeit with some settings reduced; Geerling also said that the card rendered the Pi operating system's UI smoothly at 4k (the Pi's integrated GPU does support 4K output, but things get framey quickly , especially when using multiple monitors).", "Though a qualified success, anything this hacky is likely to have at least <em>some</em> software problems; Geerling noted that graphics acceleration in the Chromium browser and GPU-accelerated video encoding and decoding support weren't working properly.", "Most Pi owners aren't going to want to run out and recreate this setup themselves, but it is interesting to see progress when it comes to using dedicated GPUs with Arm CPUs. So far, Arm chips across all major software ecosystems—including Windows, macOS, and Android—have mostly been restricted to using their own integrated GPUs. But if Arm processors are really going to compete with those of Intel and AMD in every PC market segment, we'll eventually need to see better support for external graphics chips."]], "https://arstechnica.com/gadgets/2024/10/thunderbird-android-client-is-k-9-mail-reborn-and-its-in-solid-beta/": ["Kevin Purdy", "Thunderbird Android client is K-9 Mail reborn, and it’s in solid beta", ["Thunderbird's Android app, which is , is almost out. You can check it out a bit early in a beta that will feel pretty robust to most users.", "Thunderbird, maintained by the Mozilla Foundation subsidiary MZLA, acquired the source code and naming rights to K-9 Mail, as . The group also brought K-9 maintainer Christian Ketterer (or \"cketti\") onto the project. Their initial goals, before a full rebrand into Thunderbird, involved importing Thunderbird's automatic account setup, message filters, and mobile/desktop Thunderbird syncing.", "At the tail end of 2023, however, Ketterer wrote on K-9's blog that the punchlist of items before official Thunderbird-dom was . But when it's fully released, Thunderbird for Android will have those features. As such, beta testers are asked to  to see if they work, including automatic setup, folder management, and K-9-to-Thunderbird transfer. The beta will not be \"addressing longstanding issues,\" Thunderbird's blog post notes.", "Launching Thunderbird for Android from K-9 Mail's base makes a good deal of sense. Thunderbird's desktop client has had  and is only just starting to regain a cohesive vision for what it wants to provide. For , K-9 Mail has been the Android email of choice for people who don't want Gmail or Outlook, will not tolerate the default \"Email\" app on non-Google-blessed Android systems, and just want to see their messages.", ", which ships as version 8.0b2, reminds me of what I love about K-9 whenever I've used it: configurability. However you want your mail to look and act when you see it, you can make K-9 do it. Fixed-width fonts, colorized contact images, hiding your mail client or time zone from outgoing email headers—check the settings. It's snappy as heck in response to taps and actions. And as you might have guessed, there are no nudges to use Chat or Meet tabs, bring in an AI summary, or otherwise connect your email more tightly to a provider.", "As , if you live that , it's a lot  on K-9/Thunderbird (ThunderDog?) than with most clients.", "At the moment, Thunderbird's Android release plan is to further bring out a release candidate in the third week of October, then a full release in the fourth week of October. Meanwhile, K-9 Mail has suggested that K-9 Mail should continue to be available with its own name, icon, and color scheme, but the same code base, after Thunderbird becomes official."]], "https://arstechnica.com/gadgets/2024/10/apple-adds-dark-mode-and-other-features-to-icloud-com/": ["Samuel Axon", "Apple brings years-old features to iCloud web interface", ["In a rare event, Apple has rolled out substantial updates to the  meant to allow users to access Apple services like Mail and Photos when they're away from a Mac, iPad, or iPhone.", "The flagship addition is dark mode; it \"will automatically match your device settings with a Light Mode or Dark Mode color scheme,\" Apple explains as part of the update.", "There is also now a way to customize the background for the iCloud web interface—specifically, you can choose between several colors.", "A few apps received features that have been available on iOS and macOS for a while. For example, the Notes web app now supports pinned notes, and iCloud Drive supports shared views.", "If you think all that seems like it's pretty basic and late to the game, you're not wrong.", "The iCloud web interface has long seemed like an afterthought for Apple, and it has always been far behind Apple's native software platforms in terms of features. How far behind? Well, consider this: dark mode was previously added to iOS way back in iOS 13.", "Apple's  has long said that its services like iCloud are key to making up for slowed hardware sales in the mature smartphone market. To that end, the company has made this web interface available and has brought some of its services like Music and TV+ to other platforms like Windows and Android.", "However, there seem to be limits to that. As noted, iCloud for web has historically been a subpar experience, and other key services like Messages have not been made available on other platforms at all, possibly to avoid losing the  for iOS. (Messages is notably absent in the web app.)", "Still, it's nice to see any movement at all here. While iCloud.com gets infrequent and small updates, it remains actively supported at a basic level."]], "https://arstechnica.com/gadgets/2024/10/samsung-foldable-that-debuted-at-2k-in-2020-stops-receiving-security-updates/": ["Scharon Harding", "Samsung quits updating Galaxy Z Fold 2 that came out in 2020 for $2,000", ["Samsung is no longer providing software or security updates for the Galaxy Z Fold 2 foldable smartphone that it  in September 2020.", " ahead of its full unveiling, the Z Fold 2 released with a Qualcomm Snapdragon 865+, 12GB of RAM, 256GB of UFS 3.1 storage, and a 4500 mAh battery. The phone’s hallmark is, of course, a foldable 7.6-inch OLED screen with 2208×1768 pixels running at a refresh rate of up to 120 Hz. Surpassing its predecessor, the Fold 2’s outside screen is 6.2 inches (2260×816 pixels), compared to the Fold 1’s 4.6 inches. The Fold 2 also introduced to Samsung devices.", "With the Fold 1 having , the Fold 2 represented another chance for Samsung. And Samsung continued with the line in 2021 in the form of the cheaper ($1,800 upon release) . Samsung is now up to its , which came out in July for $1,900.", "Now Samsung is no longer interested in updating the Fold 2. As  noticed today, Samsung removed the Fold 2 from its  that receive security updates. The foldable phone received its last big Android OS update last year and received a One UI update at the end of 2023. Similarly, Samsung’s Galaxy Tab A7 is no longer on Samsung's list of supported devices, as  spotted. The tablet came out in September 2020 for $230.", "In February 2022, Samsung started promising up to four generations of Android OS and One UI upgrades to “select” Galaxy devices, as well as “up to five years of security updates.” And in January, it announced moving to of security and OS updates, matching a move from Google. However, the Fold 2 wasn’t included in Samsung’s list of “select” Galaxy devices.", "Thus, one could have estimated that the Fold 2 might stop receiving OS and security updates by 2024, four years after its debut. But it's still hard to reconcile with paying four figures for a phone that became a security risk after four years, despite functioning properly otherwise. Apple, by comparison, now promises at least  of security updates. Apple only started making that promise in 2023 with the iPhone 15 series. However, the current-generation  is supported by iPhones released in 2020, like the second-generation iPhone SE, and even older ones, like the iPhone XR that came out in 2018. Arguably short-lived expensive devices like the Fold 2 are part of the reason some activists are pushing for the FTC to require that.", "However, unlike iPhones, Samsung phones aren't all powered by a proprietary chip, making promises of upgrades require commitments from third-party vendors, like Qualcomm. With Qualcomm known for being resistant to longer chip life cycles in the past, seven years of updates is progress for Samsung users—just not those who invested in the Z Fold 2."]]}