{"https://arstechnica.com/gadgets/2024/10/for-the-first-time-beloved-ide-jetbrains-rider-will-be-available-for-free/": ["Samuel Axon", "For the first time, beloved IDE JetBrains Rider will be available for free", "The integrated development environment (IDE) Rider by JetBrains is now available for free for the first time ever.After trialing non-commercial free licenses with other products like RustRover and Aqua, JetBrains has introduced a similar option for Rider. It also says this is a permanent situation, not a limited-time initiative.In a  announcing the change, JetBrains' Ekaterina Ryabukha acknowledges that there are numerous cases where people use an IDE without any commercial intent—for example, hobbyists, open source developers, and educators or students. She also cites a Stack Overflow survey that 68 percent of professional developers \"code outside of work as a hobby.\"Rider has always been a bit niche, but it's often beloved by those who use it. Making it free could greatly expand its user base, and it could also make it more popular in the long run because learners could start with it without having to pay an annual fee, and some learners go pro.It's also good news for some macOS developers, as Microsoft not long ago chose to end support for Visual Studio on that platform. Yes, you can use VS Code, Xcode, or other options, but there were some types of projects that were left in the lurch, especially for developers who don't find VS Code robust enough for their purposes.There is one drawback that might matter to some: users working in Rider on the non-commercial free license \"cannot opt out of the collection of anonymous usage statistics.\"There are some edge cases that are in a bit of a gray area when it comes to using a free license versus a paid one. Sometimes, projects that start without commercial intent can become commercial later on. JetBrains simply says that \"if your intentions change over time, you’ll need to reassess whether you still qualify for non-commercial use.\""], "https://arstechnica.com/gadgets/2024/10/fake-restaurant-tips-on-reddit-a-reminder-of-google-ai-overviews-inherent-flaws/": ["Scharon Harding", "Annoyed Redditors tanking Google Search results illustrates perils of AI scrapers", "A trend on Reddit that sees Londoners giving false restaurant recommendations in order to keep their favorites clear of tourists and social media influencers highlights the inherent flaws of Google Search’s reliance on Reddit and Google's AI Overview.In May, Google launched AI Overviews in the US, an experimental feature that populates the top of Google Search results with a summarized answer based on an AI model built into Google’s web rankings. When Google first debuted AI Overview, it quickly became apparent that the feature  and its ability to properly summarize information from online sources. AI Overviews are “built to only show information that is backed up by top web results,\" Liz Reid, VP and head of Google Search, wrote in a May . But as my colleague Benj Edwards  at the time, that setup could contribute to inaccurate, misleading, or even dangerous results: “The design is based on the false assumption that Google's page-ranking algorithm favors accurate results and not SEO-gamed garbage.\"As Edwards alluded to, many have complained about Google Search results' quality declining in recent years, as  and, more recently, AI slop float to the top of searches. As a result, people often turn to the  to make Google results more helpful. By adding \"site:reddit.com” to search results, users can hone their search to more easily find answers from real people. Google seems to understand the value of Reddit and signed an the company that’s reportedly worth $60 million per year.But disgruntled foodies in London are reminding us of the inherent dangers of relying on the scraping of user-generated content to provide what’s supposed to be factual, helpful information."], "https://arstechnica.com/gadgets/2024/10/what-i-learned-from-3-years-of-running-windows-11-on-unsupported-pcs/": ["Andrew Cunningham", "What I learned from 3 years of running Windows 11 on “unsupported” PCs", " in October 2025. We've explained why that's a big deal, and we have a  (recently updated to account for changes in Windows 11 24H2) so you can keep getting security updates, whether you're on an officially supported PC or not.But this is more than just a theoretical exercise; I've been using Windows 11 on some kind of \"unsupported\" system practically since it launched to stay abreast of what the experience is actually like and to keep tabs on whether Microsoft would make good on its threats to pull support from these systems at any time.Now that we're three years in, and since I've been using Windows 11 24H2 on a 2012-era desktop and laptop as my primary work machines on and off for a few months now, I can paint a pretty complete picture of what Windows 11 is like on these PCs. As the Windows 10 update cliff approaches, it's worth asking: Is running \"unsupported\" Windows 11 a good way to keep an older but still functional machine running, especially for non-technical users?I've run Windows 11 on a fair amount of old hardware, including PCs as old as a late XP-era Core 2 Duo Dell Inspiron desktop. For the first couple of years, I ran it most commonly on an old Dell XPS 13 9333 with a Core i5-4250U and 8GB of RAM and a Dell Latitude 3379 2-in-1 that just barely falls short of the official requirements (both systems are also pressed into service for ChromeOS Flex testing periodically).But I've been running the 24H2 update as my main work OS on two machines. The first is a Dell Optiplex 3010 desktop with a 3rd-generation Core i5-3xxx CPU, which had been my mother's main desktop until I upgraded it a year or so ago. The second is a Lenovo ThinkPad X230 with a i5-3320M inside, a little brick of a machine that I picked up for next to nothing on Goodwill's online auction site."], "https://arstechnica.com/apple/2024/10/apple-teases-week-of-announcements-about-the-mac-starting-on-monday/": ["Andrew Cunningham", "Apple teases “week of announcements” about the Mac starting on Monday", "Apple has released new iPhones, new Apple Watches, a new iPad mini, and a flotilla of software updates this fall, but Mac hardware has gone unmentioned so far. That's set to change next week, according to  from Apple Worldwide Marketing SVP Greg Joswiak earlier today.Imploring readers to \"Mac [sic] their calendars,\" Joswiak's post teases \"an exciting week of announcements ahead, starting on Monday morning.\" If the wordplay wasn't enough, an attached teaser video with a winking neon Mac logo drives the point home.Though Joswiak's post was light on additional details, months of reliable rumors have told us the most likely things to expect: refreshed MacBook Pros and 24-inch iMacs with few if any external changes but new Apple M4-series chips on the inside, plus a new M4 Mac mini with a substantial design overhaul. The MacBook Pros and iMacs were  almost exactly a year ago, but the Mac mini was .The new Mac mini will allegedly be closer in size to an Apple TV and is said to be slightly taller than current Mac minis but with a smaller footprint. The new design will continue to include a space-saving internal power supply rather than relying on an external power brick, but it will also rely more heavily on USB-C/Thunderbolt ports to save space, cutting down on the number of other ports. At least some models will also include USB-C ports on the front, a design change inherited from the Mac Studio."], "https://arstechnica.com/information-technology/2024/10/russian-coders-removed-from-linux-maintainers-list-due-to-sanction-concerns/": ["Kevin Purdy", "Removal of Russian coders spurs debate about Linux kernel’s politics", "\"Remove some entries due to various compliance requirements. They can come back in the future if sufficient documentation is provided.\"That , submitted by major Linux kernel maintainer Greg Kroah-Hartman, accompanied a patch that removed about a dozen names from the kernle's MAINTAINERS file. \"Some entries\" notably had either Russian names or .ru email addresses. \"Various compliance requirements\" was, in this case, sanctions against Russia and Russian companies, stemming from that country's invasion of Ukraine.This merge did not go unnoticed. Replies on the kernel mailing list asked about this \"very vague\" patch. Kernel developer James Bottomley  that \"we\" (seemingly speaking for Linux maintainers) had \"actual advice\" from Linux Foundation counsel. Employees of companies on the Treasury Department's Office of Foreign Assets Control list of Specially Designated Nationals and Blocked Persons (), or connected to them, will have their collaborations \"subject to restrictions,\" and \"cannot be in the MAINTAINERS file.\" \"Sufficient documentation\" would mean evidence that someone does not work for an OFAC SDN entity, Bottomley wrote.There followed a number of messages questioning the legitimacy, suddenness, potentially US-forced, and non-reviewed nature of the commit, along with broader questions about the separation of open source code from international politics. Linux creator  with, \"Ok, lots of Russian trolls out and about.\" He wrote: \"It's entirely clear why the change was done\" and noted that \"Russian troll factories\" will not revert it and that \"the 'various compliance requirements' are not just a US thing."], "https://arstechnica.com/gadgets/2024/10/ios-18-2-developer-beta-adds-chatgpt-and-image-generation-features/": ["Samuel Axon", "iOS 18.2 developer beta adds ChatGPT and image-generation features", "Today, Apple released the first developer beta of iOS 18.2 for supported devices. This beta release marks the first time several key AI features that Apple teased at its developer conference this June are available.Apple is marketing a wide range of generative AI features under the banner \"Apple Intelligence.\" Initially, Apple Intelligence was planned to release as part of iOS 18, but some features slipped to iOS 18.1, others to iOS 18.2, and a few still to future undisclosed software updates.iOS 18.1 has been in beta for a while and includes improvements to Siri, generative writing tools that help with rewriting or proofreading, smart replies for Messages, and notification summaries. That update is expected to reach the public next week.Today's developer update, iOS 18.2, includes some potentially more interesting components of Apple Intelligence, including Genmoji, Image Playground, Visual Intelligence with Camera Control, and ChatGPT integration.Genmoji and Image Playground allow users to generate images on-device to send to friends in Messages; there will be Genmoji and Image Playground APIs to allow third-party messaging apps to work with Genmojis, too.ChatGPT integration allows Siri to pass off user queries that are outside Siri's normal scope to be answered instead by OpenAI's ChatGPT. A ChatGPT account is not required, but logging in with an existing account gives you access to premium models available as part of a ChatGPT subscription. If you're using these features without a ChatGPT account, OpenAI won't be able to retain your data or use it to train models. If you connect your ChatGPT account, though, then OpenAI's privacy policies will apply for ChatGPT queries instead of Apple's.Genmoji and Image Playground queries will be handled locally on the user's device, but other Apple Intelligence features may dynamically opt to send queries to the cloud for computation.There's no word yet on when iOS 18.2 will be released publicly."], "https://arstechnica.com/gadgets/2024/10/nfl-player-illegally-streams-his-own-teams-game-garners-mostly-sympathy/": ["Kevin Purdy", "Few truly shocked that NFL player used illegal stream to watch his own team", "Trying to  is a fiendish logistics puzzle, one that doesn't even have a \"just pay for it\" shortcut.You can , but that only covers games on Sunday and only those not shown in your local TV market. You can pay for cable or set up an HDTV antenna, but you have to hope it catches NBC, CBS, and Fox for Sunday games (if your local station chooses to carry your team), and for Monday night games, ABC (though most are on ESPN and some even exclusive to ESPN+). Thursday nights? That's Amazon Prime.Oh, and this year's Christmas Day games are on Netflix. And the games played in London and Germany are on the NFL Network, which requires either cable or an NFL+ subscription. And Peacock also had that one game in Brazil and is getting another playoff game this year. Many of these games get broadcast options in their home regions, though that doesn't much help ex-pat fans.All that is to say that it's not wild to see injured Seattle Seahawks cornerback Tariq Woolen  (seemingly ). You can put that next to his salary of more than $1 million per year, as , and look for obvious chuckles.But even with a lot of income at his disposal, streaming a game is just not very easy, even if you play for an NFL team. Witness the numerous knowing and sympathetic replies to , along with reprimands for revealing his reliable stream source.If Woolen was in Seattle during the game, he would have needed access to Fox to watch the game against Atlanta, . That could have meant watching Fox on cable, an over-the-air broadcast, or Fox Sports' website."], "https://arstechnica.com/gadgets/2024/10/report-arm-cancels-qualcomms-architecture-license-endangering-its-chip-business/": ["Andrew Cunningham", "Report: Arm cancels Qualcomm’s architecture license, endangering its chip business", "Any company that makes Arm chips must license technology from Arm Holdings plc, the British company that develops the instruction set. Companies can license the instruction set and create their own CPU designs or license one of Arm's ready-made Cortex CPU core designs to incorporate into their own chips.Bloomberg  that Arm is canceling Qualcomm's license, an escalation of a fight that began in late 2022 when Arm sued Qualcomm over . Arm has given Qualcomm 60 days' notice of the cancellation, giving the companies two months to come to some kind of agreement before Qualcomm is forced to stop manufacturing and selling its Arm chips.\"This is more of the same from ARM—more unfounded threats designed to strongarm a longtime partner, interfere with our performance-leading CPUs, and increase royalty rates regardless of the broad rights under our architecture license,\" a Qualcomm spokesperson told Ars. \"With a trial fast approaching in December, Arm’s desperate ploy appears to be an attempt to disrupt the legal process, and its claim for termination is completely baseless. We are confident that Qualcomm’s rights under its agreement with Arm will be affirmed. Arm’s anticompetitive conduct will not be tolerated.”"], "https://arstechnica.com/gadgets/2024/10/212-million-contract-will-finally-get-san-francisco-trains-off-floppy-disks/": ["Scharon Harding", "San Francisco to pay $212 million to end reliance on 5.25-inch floppy disks", "The San Francisco Municipal Transportation Agency (SFMTA) board has agreed to spend $212 million to get its Muni Metro light rail off floppy disks.The Muni Metro’s Automatic Train Control System (ATCS) has required  since 1998, when it was installed at San Francisco’s Market Street subway station. The system uses three floppy disks for loading DOS software that controls the system’s central servers. Michael Roccaforte, an SFMTA spokesperson, gave further details on how the light rail operates to Ars Technica in April, saying: “When a train enters the subway, its onboard computer connects to the train control system to run the train in automatic mode, where the trains drive themselves while the operators supervise. When they exit the subway, they disconnect from the ATCS and return to manual operation on the street.\" After starting initial planning in 2018, the SFMTA originally expected to move to a floppy-disk-free train control system by 2028. But with COVID-19 preventing work for 18 months, the estimated completion date was delayed.On October 15, the SFMTA moved closer to ditching floppies when its board approved a contract with Hitachi Rail for implementing a new train control system that doesn't use floppy disks,  reported. Hitachi Rail tech is said to power train systems, including Japan’s bullet train, in more than 50 countries. The $212 million contract includes support services from Hitachi for \"20 to 25 years,\" the Chronicle said.The new control system is supposed to be five generations ahead of what Muni is using now, Muni director Julie Kirschbaum said, per the Chronicle. Further illustrating the light rail's dated tech, the current ATCS was designed to last 20 to 25 years, meaning its expected expiration date was in 2023. The system still works fine, but the risk of floppy disk data degradation and  in maintaining expertise in 1990s programming languages have further encouraged the SFMTA to seek upgrades."], "https://arstechnica.com/gadgets/2024/10/subscribers-are-paying-more-for-streaming-content-that-they-are-enjoying-less/": ["Scharon Harding", "Streaming subscription fees have been rising while content quality is dropping", "Subscription fees for video streaming services have been on a . But despite subscribers paying more, surveys suggest they're becoming less satisfied with what's available to watch.At the start of 2024, the industry began declaring , a term coined by FX Networks Chairman John Landgraf that refers to an era of rampant content spending that gave us shows like <em>The Wire</em>, <em>Breaking Bad</em>, and <em>Game of Thrones</em>. For streaming services, the Peak TV era meant trying to lure subscribers with original content that was often buoyed by critical acclaim and/or top-tier actors, writers, and/or directors. However, as streaming services struggle to reach or maintain profitability, 2024 saw a drop in the number of new scripted shows for the first time in at least 10 years, FX Research .Meanwhile, overall satisfaction with the quality of content available on streaming services seems to have declined for the past couple of years. Most surveys suggest a generally small decline in perceived quality, but that’s still perturbing considering how  streaming services . There was a time when a streaming subscription represented an exclusive ticket to viewing some of the best new TV shows and movies. But we’ve reached a point where the most streamed TV show last year —an original from the USA Network cable channel that ended in 2019.Earlier this month, TiVo released its <em>Q2 2024 TiVo Video Trends Report: North America </em> of 4,490 people in the US and Canada ages 18 and up. The survey found a drop in the percentage of subscribers who would rate the content quality of their subscription video on demand (SVOD) services as \"moderate to very good.\" (TiVo’s report defines SVOD as “services offering on-demand streaming content in which users pay a subscription fee.\") The decline is present for subscribers to streaming services with and without ads."], "https://arstechnica.com/gadgets/2024/10/qualcomm-brings-laptop-class-cpu-cores-to-phones-with-snapdragon-8-elite/": ["Andrew Cunningham", "Qualcomm brings laptop-class CPU cores to phones with Snapdragon 8 Elite", "Qualcomm has , and the best part is that it uses an improved version of the Oryon CPU architecture that the  brought to Windows PCs earlier this year.The Snapdragon 8 Elite is the follow-up to last year's —yet another change to the naming convention that Qualcomm uses for its high-end phone chips, though, as usual, the number 8 is still involved. The 8 Elite uses a \"brand-new, 2nd-generation Qualcomm Oryon CPU\" with clock speeds up to 4.32 GHz, which Qualcomm says will improve performance by about 45 percent compared to the Snapdragon 8 Gen 3.Rather than a mix of large, medium, and small CPU cores as it has used in the past, the 8 Elite has two \"Prime\" cores for hitting that high peak clock speed, while the other six are all \"Performance\" cores that peak at a lower 3.53 GHz. But it doesn't look like Qualcomm is using a mix of different CPU architectures anymore, choosing to distinguish the higher-performing core from the lower-performing ones by clock speed alone.Qualcomm promises a similar 40 percent performance boost from the new Adreno 830 GPU. The chip also includes a marginally improved Snapdragon X80 5G modem, up from an X75 modem in the Snapdragon 8 Gen 3—its main improvement appears to be support for additional antennas, for a total of six, but the download speed still tops out at a theoretical 10Gbps. Wi-Fi 7 support appears to be the same as in the 8 Gen 3, but the 8 Elite does support the Bluetooth 6.0 standard, up from Bluetooth 5.4 in the 8 Gen 3."], "https://arstechnica.com/gadgets/2024/10/hands-on-with-the-2024-ipad-mini-spot-the-differences/": ["Samuel Axon", "Hands-on with the 2024 iPad mini: Spot the differences", "The iPad mini is a niche product, that much is clear. But for those who want an extra-small tablet, the launch of the sixth-generation iPad mini in 2021 was a red-letter day. For the first time in ages, the mini got close to the same kind of performance and features as its bigger brethren.Then it didn’t get any updates for a couple of years. It was still a good tablet, but it wasn’t positioned to take advantage of new products or features on Apple’s docket like Apple Intelligence or the Apple Pencil Pro.Enter the new 2024 refresh of the iPad mini, which releases October 23. For the most part, it’s the same as the previous generation—but Apple has laser-focused on a couple of tweaks to modernize the device just enough to keep it competitive in the company’s current ecosystem.I’ve spent a couple of days with the new iPad mini, so let’s take a quick look at what has changed. If you want to learn more about the form factor, basic features, and other stuff that hasn’t changed since last time, take a look at our . Almost everything we said then applies here, too.Now, let’s start with the biggest change: a new system-on-a-chip.As Apple’s marketing tells it, the iPad mini’s most important update is on the inside: The new model replaces the A15 system-on-a-chip that was first introduced with the iPhone 13 back in 2021 with the A17 Pro, which first appeared in the iPhone 15 Pro last year.The A17 Pro has a 6-core CPU, a 5-core GPU, and a 16-core NPU (neural processing unit). The GPU adds features like dynamic caching, hardware-accelerated ray-tracing, and mesh shading. Apple claims that the A17 Pro offers 30 percent better CPU performance, 25 percent better GPU performance, and 100 percent better NPU performance than the A15."], "https://arstechnica.com/gadgets/2024/10/qualcomm-cancels-windows-dev-kit-pc-for-comprehensively-failing-to-meet-standards/": ["Andrew Cunningham", "Qualcomm cancels Windows dev kit PC for “comprehensively” failing to meet standards", "It's been a big year for Windows running on Arm chips, something that Microsoft and Arm chipmakers have been trying to get off the ground for well over a decade. Qualcomm's Snapdragon X Elite and X Plus are at the heart of dozens of , which promise unique AI features and good battery life without as many of the app and hardware compatibility problems that have plagued Windows-on-Arm in the past.Part of the initial wave of Copilot+ PCs was a single desktop,  that would give developers and testers a slightly cheaper way to buy into the Copilot+ ecosystem. Microsoft  two years ago.But Qualcomm has unceremoniously canceled the dev kit and is sending out refunds to those who ordered them. That's according to a note received by developer and YouTuber Jeff Geerling, who had already received the Snapdragon Dev Kit and given it a middling review .\"The launch of 30+ Snapdragon X-series powered PCs is a testament to our ability to deliver leading technology and the PC industry's desire to move to our next-generation technology,\" reads Qualcomm's statement. \"However, the Developer Kit product comprehensively has not met our usual standards of excellence and so we are reaching out to let you know that unfortunately we have made the decision to pause this product and the support of it, indefinitely.\"Qualcomm's statement also says that \"any material, if received\" will not have to be returned—those lucky enough to have gotten one of the Dev Kits up until now may be able to keep it and get their money back, though the PC is no longer officially being supported by Qualcomm."], "https://arstechnica.com/gadgets/2024/10/redbox-hard-drive-hacked-to-reveal-customer-information-from-2471-rentals/": ["Scharon Harding", "Redbox easily reverse-engineered to reveal customers’ names, zip codes, rentals", "Since , many have wondered what will happen to those red kiosks and DVDs. Another question worth examining is: What will happen to all the data stored inside the Redboxes?Redbox parent company Chicken Soup for the Soul filed for Chapter 7 bankruptcy in June and is in the process of . Meanwhile, stores with Redboxes are eager to remove the obsolete hardware. And tinkerers have reported getting their hands on Redbox kiosks and doing , including .But Redboxes falling into technologists' hands can seemingly also result in the uncovering of customer data from kiosks' hard drives. As spotted by today, programmer and expert reverse-engineer  reported via  that she was able to retrieve records for 2,471 transactions from the disk image of a Redbox hard drive. Turing told Ars Technica that she got the image from a Discord channel:[The Redbox] logged lots of information, including debugging information from the transaction terminal, and they left old records on the device. This probably saved them some time on QAing software bugs, but it exposed all their users to data being leaked.Data went back \"to at least 2015,\" Turing said on Mastodon. She told Lowpass the data included \"records for when stuff is rented,\" including customers' email addresses and zip codes, as well as names of rented discs and when they were rented. Turing was also able to retrieve some numbers of customer credit cards.“The device talks to a secure payment transaction device (so there's no logs of full credit info) but it logs a bunch of stuff that it really shouldn't: We've got the first 6 and last 4 [digits] of each credit card used, plus some lower level transaction details,” Turing told Lowpass.The information available was enough for Turing to determine the name of a person who rented <em>The Giver</em> and <em>The Maze</em> <em>Runner </em>in Morganton, North Carolina, on May 23, 2015, at 6:43 p.m, she  (Ars is unable to verify the accuracy of this claim)."], "https://arstechnica.com/gadgets/2024/10/android-15s-security-and-privacy-features-are-the-updates-highlight/": ["Kevin Purdy", "Android 15’s security and privacy features are the update’s highlight", "Android 15 started rolling out to Pixel devices Tuesday and will arrive, through various third-party efforts, on other Android devices at some point. There is always a bunch of little changes to discover in an Android release, whether by reading, poking around, or letting your phone show you 25 new things after it restarts.In Android 15, some of the most notable involve making your device less appealing to snoops and thieves and more secure against the kids to whom you hand your phone to keep them quiet at dinner. There are also smart fixes for screen sharing, OTP codes, and cellular hacking prevention, but details about them are spread across Google's own docs and blogs and various news site's reports.Here's what is notable and new in how Android 15 handles privacy and security.In the Android 15 settings, you can find \"Private Space,\" where you can set up a separate PIN code, password, biometric check, and optional Google account for apps you don't want to be available to anybody who happens to have your phone. This could add a layer of protection onto sensitive apps, like banking and shopping apps, or hide other apps for whatever reason.In your list of apps, drag any app down to the lock space that now appears in the bottom right. It will only be shown as a lock until you unlock it; you will then see the apps available in your new Private Space. After that, you should probably delete it from the main app list.  and its quirks.It's obviously more involved than Apple's \"\" tap option but with potentially more robust hiding of the app.A second form of authentication is good security, but allowing apps to access the notification text with the code in it? Not so good. In Android 15, , likely to be given only to the most critical apps, prevents the leaking of one-time passcodes (OTPs) to other apps waiting for them. Sharing your screen will also hide OTP notifications, along with usernames, passwords, and credit card numbers."], "https://arstechnica.com/gadgets/2024/10/winamp-really-whips-open-source-coders-into-frenzy-with-its-source-release/": ["Kevin Purdy", "Winamp deletes entire GitHub source code repo after a rocky few weeks", "Winamp, through its Belgian owner Llama Group, posted the source for its \"Legacy Player Code\" on September 24 so that developers could \"contribute their expertise, ideas, and passion to help this iconic software evolve.\"Less than a month later, that , after it either bumped up against or broke its strange hodgepodge of code licenses, seemingly revealed the source code for other non-open software packages, and made a pretty bad impression on the open-source community.Winamp's code was made available in late September, but not very open. Under the \",\" you may not \"distribute modified versions of the software\" in source or binary, and \"only the maintainers of the official repository are allowed to distribute the software and its modifications.\" Anyone may contribute, in other words, but only to Winamp's benefit.Justin Frankel, a key developer of the original Winamp and founder of Nullsoft, which also made SHOUTcast streaming software, was  about contributing to the code. Frankel responded that, even if he had some desire, the license terms \"are completely absurd in the way they are written.\" Even taking them \"as they are likely intended,\" Frankel wrote, \"they are terrible. No thank you.\"Despite how this license would seem to bar forks, or perhaps <em>because</em> of that, the code has been . In forking and examining the source when first released, coders have noticed some, shall we say, anomalies:"], "https://arstechnica.com/gadgets/2024/10/how-to-upgrade-to-windows-11-whether-your-pc-is-supported-or-not/": ["Andrew Cunningham", "How to install Windows 11 on supported and unsupported PCs, 24H2 edition", "We originally published this install guide for Windows 11 shortly after the OS was released in October 2021. To keep it current and as useful as possible, we updated it in October 2024 to cover changes that Microsoft has made in the Windows 11 2024 Update, also known as 24H2.Windows 11 24H2 , and even though it's still called Windows 11 and still looks like Windows 11, it's probably the operating system's most significant update since its release in October of 2021.You may or may not be excited about some of the new generative AI features, but it has a lot of other things in it, too. And even if you're not in love with Windows or the current trajectory of Windows, there are still plenty of places you need to use it anyway.We've pulled together all kinds of resources to create a comprehensive guide to installing and upgrading to Windows 11. This includes advice and some step-by-step instructions for turning on officially required features like your TPM and Secure Boot, as well as official and unofficial ways to skirt the system-requirement checks on \"unsupported\" PCs, because Microsoft is not your parent and therefore cannot tell you what to do.There are some changes in the 24H2 update that will keep you from running it on every ancient system that could run Windows 10, and there are new hardware requirements for some of the operating system's new generative AI features. We've updated our guide with everything you need to know.The easiest way to get Windows 11 is by checking Windows Update on a supported, fully up-to-date Windows 10 PC. But if you aren't seeing it there, or if you have several computers to upgrade and only want to download the new OS once, there are other options.Microsoft offers several ways to . One is to use the Installation Assistant app, which you install on your PC to trigger a normal upgrade install via Windows Update. The second is to use the Windows 11 Media Creation Tool, which automates the process of creating a bootable USB install drive or downloading an install ISO file. Once you have a USB drive, you can either boot from it to perform a clean install or run the Setup app from within Windows 10 to do a normal upgrade install. You can also burn the ISO to a DVD, but installing from any USB drive, even an old USB 2.0 drive, will be much faster. Finally, you can just download an ISO file ."], "https://arstechnica.com/gadgets/2024/10/amazon-refreshes-its-monochrome-kindle-lineup-including-a-bigger-paperwhite/": ["Andrew Cunningham", "Amazon refreshes its monochrome Kindle lineup, including a bigger Paperwhite", "Amazon is shaking up  today, at least by the slow-moving and relatively placid standards of the e-reader market. The company is announcing a major refresh to the , a screen-size bump for , and small tweaks to —a rare simultaneous refresh for devices that the company usually updates one or two at a time.In addition to the monochrome e-readers, Amazon introduced its first color e-reader today. The new , covered in more detail , looks almost identical to the new Paperwhite and launches on October 30 for $279.99.Going from most to least significant: The new Kindle Scribe's upgrades are mostly meant to make it a more paper-like writing experience. It has a new textured screen coating, a white screen bezel that blends into the screen (we've also seen this deployed in tablets like ), and a tweaked Premium Pen accessory with a \"new soft-tipped eraser\" that feels more like an actual pencil eraser.Other improvements are being implemented in software, not hardware. A new note-taking feature called Active Canvas allows you to draw in the margins of e-books, making text reflow around your notes—previously, handwritten notes opened a separate pop-up, just like typed notes.A future software update will let you hide and show those notes. What Amazon calls \"an AI-powered notebook\" will \"quickly summarize pages and pages of notes into concise bullets in a script font that can be easily shared directly from the notebook tab,\" and you'll be able to make a custom script font out of your own handwriting. Amazon tells us these features will ship out to the 2022 version of the Kindle Scribe starting in December."], "https://arstechnica.com/gadgets/2024/10/amazons-first-color-kindle-e-reader-the-kindle-colorsoft-will-run-you-280/": ["Andrew Cunningham", "Amazon’s first color Kindle e-reader, the Kindle Colorsoft, will run you $280", "Amazon is overhauling . And nestled among the  to the base model Kindle, the mainstream Kindle Paperwhite, and the pen-centric Kindle Scribe is a first: the , Amazon's first color e-reader.The Colorsoft will launch on October 30 and starts at $279.99. That's quite a bit higher than the new Kindle Paperwhite, which starts at $159.99, but it's a little less than the $290 launch price of . The Colorsoft also includes 32GB of storage, wireless charging support, and sensors for automatically adjusting screen brightness and color temperature, all features that are only available in the $200 Kindle Paperwhite Signature Edition.Book covers and illustrations will be displayed in color on the Colorsoft's screen, and it will also support the same color-coded highlighting as the Kindle phone and tablet apps. Monochrome text and images are displayed at 300 PPI, the same as all other devices in the Kindle lineup, while color is displayed at 150 PPI.Stylistically, the Colorsoft looks essentially identical to the new 7-inch Kindle Paperwhite, just with a 7-inch color screen instead of a black-and-white one (the Colorsoft is also a shade heavier at 7.7 ounces instead of 7.4 for the Paperwhite). This separates it from older \"premium\" Kindles like the Oasis or the Voyage, which offered other niche features like capacitive or physical page-turn buttons or nicer front lights to separate themselves from the Paperwhite. The Colorsoft comes with a color screen. That's it."], "https://arstechnica.com/apple/2024/10/first-ipad-mini-update-since-2021-gets-a-faster-chip-and-apple-intelligence/": ["Andrew Cunningham", "Apple A17 Pro chip is the star of the first iPad mini update in three years", "Apple quietly announced a new version of its iPad mini tablet , the tablet's first update since 2021.The seventh-generation iPad mini looks mostly identical to , with a power-button-mounted Touch ID sensor and a slim-bezeled display. But Apple has swapped out the A15 Bionic chip for the Apple A17 Pro, the same processor it used in the iPhone 15 Pro last year.The new iPad mini is available for preorder now and starts at $499 for 128GB (an upgrade over the previous base model's 64GB of storage). 256GB and 512GB versions are available for $599 and $799, and cellular connectivity is an additional $150 on top of any of those prices.Apple says the A17 Pro's CPU performance is 30 percent faster than the A15's and that its GPU performance is 25 percent faster (in addition to supporting hardware-accelerated ray tracing). But the biggest improvement will be an increase in RAM—the A17 Pro comes with 8GB instead of the A15's 4GB, which appears to be Apple's floor for the new Apple Intelligence AI features. The new iPad mini will be the only iPad mini capable of supporting Apple Intelligence, which will begin rolling out with the iPadOS 18.1 update within the next few weeks."], "https://arstechnica.com/gadgets/2024/10/ward-christensen-bbs-inventor-and-architect-of-our-online-age-dies-at-age-78/": ["Benj Edwards", "Ward Christensen, BBS inventor and architect of our online age, dies at age 78", "Ward Christensen, co-inventor of the computer bulletin board system (), has died at age 78 in Rolling Meadows, Illinois. He was found deceased at his home on Friday after friends requested a wellness check. Christensen, along with , created the first BBS in Chicago in 1978, leading to an  of digital community-building that presaged much of our online world today.In the 1980s and 1990s, BBSes introduced many home computer users to multiplayer online gaming, message boards, and online community building in an era before the Internet became widely available to people outside of science and academia. It also gave rise to the  that led to companies like  today.Friends and associates remember Christensen as humble and unassuming, a quiet innovator who never sought the spotlight for his groundbreaking work. Despite creating one of the foundational technologies of the digital age, Christensen maintained a low profile throughout his life, content with his long-standing career at IBM and showing no bitterness or sense of missed opportunity as the Internet age dawned.\"Ward was the quietest, pleasantest, gentlest dude,\" said  creator Jason Scott in a conversation with Ars Technica. Scott documented Christensen's work extensively in a 2002 interview for that project. \"He was exactly like he looks in his pictures,\" he said, \"like a groundskeeper who quietly tends the yard.\"Tech veteran Lauren Weinstein initially  news of Christensen's passing on Sunday, and a close friend of Christensen's confirmed to Ars that Christensen likely died at his house overnight between October 10 and October 11. Friends called Police for a wellness check for Christensen on Friday when they had not heard from him as usual. The cause of death has not yet been announced."], "https://arstechnica.com/gadgets/2024/10/smart-gardening-firms-shutdown-a-reminder-of-internet-of-things-fickle-nature/": ["Scharon Harding", "Smart gardening firm’s shutdown a reminder of Internet of Things’ fickle nature", "AeroGarden, which sells Wi-Fi-connected indoor gardening systems, is going out of business on January 1. While Scotts Miracle-Gro has continued selling AeroGarden products after announcing the impending shutdown, the future of the devices' companion app is uncertain.AeroGarden systems use hydroponics and LED lights to grow indoor gardens without requiring sunlight or soil. The smart gardening system arrived in 2006, and Scotts Miracle-Gro took over complete ownership . Some AeroGardens work with the iOS and Android apps that connect to the gardens via Wi-Fi and tell users when their plants need water or nutrients. AeroGarden also marketed the app as a way for users to easily monitor multiple AeroGardens and control the amount of light, water, and nutrients they should receive. The app offers gardening tips and can access AeroGarden customer service representatives and AeroGarden communities on Facebook and other social media outlets.Regarding the reasoning for the company's closure, AeroGarden's FAQ page only states:This was a difficult decision, but one that became necessary due to a number of challenges with this business.It's possible that AeroGarden struggled to compete with rivals, which include cheaper options for gardens and seed pods that are sold on Amazon and other retailers or made through DIY efforts.AeroGarden's closure is somewhat more surprising considering that it updated its app in June. But now it's unknown how long the app will be available. In an announcement last week, AeroGarden said that its app \"will be available for an extended period of time\" and that it'll inform customers about the app's \"longer-term status as we work through the transition period.\"However, that doesn't provide much clarity to people who may have invested in AeroGarden's Wi-Fi-enabled Bounty and Farm models. The company refreshed both lines in 2020, with the Farm line starting at $595 at the time. The gardens also marketed compatibility with Amazon Alexa. The gardens will still work without the app, but remote control features most likely won't whenever the app ultimately shuts down."], "https://arstechnica.com/gadgets/2024/10/lots-of-pcs-are-poised-to-fall-off-the-windows-10-update-cliff-one-year-from-today/": ["Andrew Cunningham", "Lots of PCs are poised to fall off the Windows 10 update cliff one year from today", "One year from today, , Microsoft will stop releasing security updates for PCs that are still running Windows 10.Organizations and individuals will  for three more years of updates, with prices that go up steadily each year (Microsoft still hasn't provided pricing for end users, only saying that it will release pricing info \"closer to the October 2025 date.\") But for most PCs running Windows 10, the end of the line is in sight.Normally, this wouldn't be a huge deal; the last dregs of support for Windows 7 and Windows 8 dried up , and the world didn't end even though some PCs continue to run those OS versions. But there are three things about the end of Windows 10 support that are slightly different from other recent end-of-life dates:"], "https://arstechnica.com/apple/2024/10/asahi-linuxs-bespoke-gpu-driver-is-running-windows-games-on-apple-silicon-macs/": ["Andrew Cunningham", "Asahi Linux’s bespoke GPU driver is running Windows games on Apple Silicon Macs", "A few years ago, the idea of running PC games on a Mac, in Linux, or on Arm processors would have been laughable. But the developers behind Asahi Linux—the independent project that is getting Linux working on Apple Silicon Macs—have managed to do all three of these things at once.The feat brings together a perfect storm of open source projects,  Asahi Linux GPU lead Alyssa Rosenzweig: the FEX project to translate x86 CPU code to Arm, the Wine project to get Windows binaries running on Linux, DXVK and the Proton project to translate DirectX 12 API calls into Vulkan API calls, and of course the Asahi project's Vulkan-conformant driver for Apple's graphics hardware.Games are technically run  because of differences in how Apple Silicon and x86 systems address memory—Apple's systems use 16 KB memory pages, while x86 systems use 4 KB pages, something that causes issues for Asahi and some other Arm Linux distros on  and a gap that the VM bridges.Rosenzweig's post shows off screenshots of <em>Control</em>, <em>Fallout 4</em>, <em>The Witcher 3</em>, <em>Ghostrunner</em>, <em>Cyberpunk 2077</em>, <em>Portal 2</em>, and <em>Hollow Knight</em>, though as she notes, most of these games won't run at anywhere near 60 frames per second yet."], "https://arstechnica.com/gadgets/2024/10/trek-carback-bike-radar-lets-you-know-when-cars-are-approaching/": ["Eric Bangeman", "Trek CarBack bike radar lets you know when cars are approaching", " class=\"p1\">\"Car back!\" class=\"p1\">If you've ever been on a group bike ride, you've no doubt heard these two words shouted by a nearby rider. It's also the name of Trek's new $199 bike radar. class=\"p1\">For safety-conscious cyclists, bike radars have been a game-changer. Usually mounted on the seat post, the radar units alert cyclists to cars approaching from behind. While they will work on any bike on any road, bike radar is most useful in suburban and rural settings. After all, if you're doing some urban bike commuting, you'll just assume cars are behind you because that's how it is. But on more open roads with higher speed limits or free-flowing traffic, bike radars are fantastic. class=\"p1\">While a handful of companies make them, the Garmin Varia is the best-known and most popular option. The Varia is so popular that it is nearing the proprietary eponym status of Kleenex and Taser among cyclists. Trek hopes to change that with its new . class=\"p1\">Like other bike radars, the CarBack can be used with either a cycling computer or your smartphone. Mounted either on a seat post or the back of a Bontrager saddle, the CarBack can detect vehicles approaching from as far away as 150 meters, beeping at you once one is in its range. class=\"p1\">The CarBack plays just as nicely with Garmin bike computers as the Varia does. When a car comes within range, your bike computer will chirp, the edges of the screen turn orange, and a dot showing the car's relative position travels up the right side of the screen—exactly the same as riding with a Varia. class=\"p1\">Speaking of the Varia, there are three significant differences between it and the CarBack. The first is the effective range, 140 meters for the Varia versus the CarBack's 150 meters. While riding, I didn't have the feeling that I was getting alerts sooner. But testing on a busy street demonstrated that the CarBack does have at least a few more meters of range than the Varia."], "https://arstechnica.com/gaming/2024/10/xbox-plans-to-set-up-shop-in-androids-play-store-if-court-order-holds/": ["Kevin Purdy", "Xbox plans to set up shop on Android devices if court order holds", "After a  that Google must open its Play Store to allow for third-party app stores and alternative payment options, Microsoft is moving quickly to slide into this slightly ajar door.Sarah Bond, president of Xbox,  Thursday evening that the ruling \"will allow more choice and flexibility.\" \"Our mission is to allow more players to play on more devices so we are thrilled to share that starting in November, players will be able to play and purchase Xbox games directly from the Xbox App on Android,\" Bond wrote.Because the court order requires Google to stop forcing apps to use its own billing system and allow for third-party app stores inside Google Play itself, Microsoft now intends to offer Xbox games directly through its app. Most games will likely not run directly on Android, but a revamped Xbox Android app could also directly stream purchased or subscribed games to Android devices.Until now, buying Xbox games (or most any game) on a mobile device has typically involved either navigating to a web-based store in a browser—while avoiding attempts by the phone to open a store's official app—or simply using a different device entirely to buy the game, then playing or streaming it on the phone."], "https://arstechnica.com/gadgets/2024/10/eleven-things-to-know-about-in-the-windows-11-2024-update/": ["Andrew Cunningham", "Eleven things to know about in the Windows 11 2024 Update", "The , also known as Windows 11 24H2, started rolling out last week. Your PC may have even installed it already!The continuous feature development of Windows 11 (and Microsoft's phased update rollouts) can make it a bit hard to track exactly what features you can expect to be available on any given Windows PC, even if it seems like it's fully up to date.This isn't a comprehensive record of all the changes in the 2024 Update, and it doesn't reiterate some basic but important things like Wi-Fi 7 or 80Gbps USB4 support. But we've put together a small list of new and interesting changes that you're guaranteed to see when your version number rolls over from 22H2 or 23H2 to 24H2. And while Microsoft's announcement post spent most of its time on Copilot and features unique to Copilot+ PCs, here, we'll only cover things that will be available on any PC you install Windows 11 on ().The Quick Settings panel sees a few nice quality-of-life improvements. The biggest is a little next/previous page toggle that makes all of the Quick Settings buttons accessible without needing to edit the menu to add them. Instead of clicking a button and entering an edit menu to add and remove items from the menu, you click and drag items between pages. The downside is that you can't see all of the buttons at once across three rows as you could before, but it's definitely more handy if there are some items you want to access sometimes but don't want to see <em>all</em> the time.A couple of individual Quick Settings items see small improvements: a refresh button in the lower-right corner of the Wi-Fi settings will rescan for new Wi-Fi networks instead of making you exit and reopen the Wi-Fi settings entirely. Padding in the Accessibility menu has also been tweaked so that all items can be clearly seen and toggled without scrolling. If you use one or more VPNs that are managed by Windows' settings, it will be easier to toggle individual VPN connections on and off, too. And a  accessibility button to generate automatic captions for audio and video is also present in Quick Settings starting in 24H2."], "https://arstechnica.com/gadgets/2024/10/intels-core-ultra-200s-cpus-are-its-biggest-desktop-refresh-in-three-years/": ["Andrew Cunningham", "Intel’s Core Ultra 200S CPUs are its biggest desktop refresh in three years", "Intel's 14th-generation desktop processors were a mild update on top of a mild update: a barely faster revision of the 13th-gen Core CPUs, which were themselves a modest tweak to 2021's 12th-gen Core processors. The new Core Ultra CPUs (and their underlying architectural changes) were exclusive to laptops.Today, that changes: The Core Ultra 200S processors (codenamed Arrow Lake) will bring to desktops many of the changes Intel has made to its Core Ultra 100- and 200-series laptop CPUs (Meteor Lake and Lunar Lake, respectively). Changes include a new chiplet-based design, new manufacturing technologies, updated CPU and GPU architectures, and a neural processing unit (NPU) for accelerating some AI and machine learning workloads.All of the new processors launch on October 24th.As with the Lunar Lake-based laptop chips, Intel has said that power efficiency is a big focus for Arrow Lake—a welcome change after seeing how much power the 13th- and 14th-generation CPUs could consume when they were allowed. But also as with the laptop processors, the Core Ultra desktop CPUs aren't always a straightforward performance upgrade from their predecessors—they're usually faster, but how <em>much</em> faster depends a lot on what you're asking them to do, at least according to the Intel-provided performance figures.The big under-the-hood change to Arrow Lake is that it shifts to a chiplet-based design, where multiple silicon dies are bound together using Intel's Foveros packaging technology. Foveros uses an Intel-manufactured \"base tile\" as an interconnect, allowing for communication between four TSMC-manufactured tiles: a compute tile for the CPU cores; a GPU tile for the graphics cores; an SoC tile that includes the NPU, video encoding and decoding blocks, and display outputs; and an I/O tile that mainly handles the DDR5 memory controller (Core Ultra 200S no longer supports DDR4, following AMD's lead).Like the Lunar Lake laptop chips, Arrow Lake will be an Intel-designed processor where most of the silicon won't actually be made in Intel's factories, aside from the base tile. The compute tile is manufactured on a 3 nm TSMC process, the GPU is a 5 nm TSMC process, and both the SoC and I/O tiles use a 6 nm process."], "https://arstechnica.com/gadgets/2024/10/amazon-apple-make-a-deal-to-offer-apple-tv-in-a-prime-bundle/": ["Samuel Axon", "Amazon, Apple make a deal to offer Apple TV+ in a Prime bundle", "Apple TV+ will now be available as an add-on in Amazon Prime Video bundles, and users will be able to watch Apple TV+ films and shows in Prime Video apps and devices without downloading a separate app, the two companies .The offering from Amazon promises to give users the option to stick with a familiar app and manage payments through one billing system.Despite considerable media buzz and critical acclaim for its shows, Apple TV+ has lagged behind many of its competitors in terms of both total subscribers and retention. The deal with Amazon could expose Apple TV+ to new customers, and the bundled nature of this subscription could help retain them even in slower content periods.Apple TV+ will cost $9.99 as an add-on in the Prime Video app—the same price users pay when they subscribe to Apple's service directly.Given Apple's history with TV, this move is actually somewhat surprising, despite the benefits. That's because Apple has long held ambitions of doing exactly what Amazon is doing here: establishing itself as the central library, viewing, search, and payment hub for a variety of subscription offerings.That vision goes back to Steve Jobs, who often talked in interviews about how he wanted to have the same kind of impact on the TV industry as Apple had on music.He and other Apple leaders have noted that cable TV bundles were a hassle and were too expensive, forcing customers to pay to subsidize content they weren't interested in. For example, a significant part of the cost of basic cable goes toward sports networks, but not everyone wants to watch sports regularly."], "https://arstechnica.com/gadgets/2024/10/former-apple-hardware-chief-dan-riccio-is-retiring/": ["Samuel Axon", "Former Apple hardware chief Dan Riccio is retiring", "Dan Riccio, one of Apple's most prominent executives for more than two decades, will retire from the company this month, according to a report in  that cites people with knowledge of the move.Reportedly, Riccio has said he has been planning his retirement for the past five years, and his last day will be Friday, October 11.Riccio began working at Apple in 1998, and by 2012, he had become the chief of hardware engineering. In that role, he oversaw several major hardware developments for Apple, including AirPods, the evolution of the modern iPhone, the iPad Pro, and more.He held the title of senior vice president of hardware engineering during that time, then  within the company in January of 2021. The public at first only knew that he was working on a \"new project\" at that time, but before long it became clear the project in question was , Apple's augmented-reality headset that .The group that produced the Vision Pro is called the Vision Products Group within the company; that's the 2,000-engineer-strong group Riccio has overseen since 2021. He was also involved in developing Project Titan, Apple's smart car initiative that was eventually abandoned."], "https://arstechnica.com/ai/2024/10/man-learns-hes-being-dumped-via-dystopian-ai-summary-of-texts/": ["Benj Edwards", "Man learns he’s being dumped via “dystopian” AI summary of texts", "On Wednesday, NYC-based  Nick Spreen received a surprising alert on his iPhone 15 Pro, delivered through an early test version of Apple's upcoming  text message summary feature. \"No longer in a relationship; wants belongings from the apartment,\" the AI-penned message reads, summing up the content of several separate breakup texts from his girlfriend.Spreen shared a screenshot of the AI-generated message in a  on the X social network, writing, \"for anyone who’s wondered what an apple intelligence summary of a breakup text looks like.\" Spreen told Ars Technica that the screenshot does not show his ex-girlfriend's full real name, just a nickname.This summary feature of Apple Intelligence, announced by the iPhone maker in June, isn't expected to fully ship until an iOS 18.1 . However, it has been  of iOS 18 since July, which is what Spreen is running on his iPhone. It works akin to something like a stripped-down , reading your incoming text messages and delivering its own simplified version of their content.On X, Spreen  to skepticism over whether the message was real in a follow-up post. \"Y<span class=\"css-1jxf684 r-bcqeeo r-1ttztb7 r-qvutc0 r-poiln3\">es this was real / yes it happened yesterday / yes it was my birthday</span>,\" Spreen wrote. In response to a  about it being a fair summary of his girlfriend's messages, he , \"it is.\"We reached out to Spreen directly via email and he delivered his own summary of his girlfriend's messages. \"It was something along the lines of i can’t believe you just did that, we’re done, i want my stuff. we had an argument in a bar and I got up and left, then she sent the text,\" he wrote.How did he feel about getting the news via AI summary? \"I do feel like it added a level of distance to it that wasn’t a bad thing,\" he told Ars Technica. \"Maybe a bit like a personal assistant who stays professional and has your back even in the most awful situations, but yeah, more than anything it felt unreal and dystopian.\""], "https://arstechnica.com/gadgets/2024/10/maze-of-adapters-software-patches-gets-a-dedicated-gpu-working-on-a-raspberry-pi/": ["Andrew Cunningham", "Maze of adapters, software patches get a dedicated GPU working on a Raspberry Pi", "Raspberry Pi owners have always been prone to coming up with elaborate, technically interesting but practically questionable projects, and Pi enthusiast Jeff Geerling has: connecting an old AMD Radeon RX 460 GPU to the Raspberry Pi 5's PCI Express bus and managing to play demanding titles like <em>Doom 3</em> (2004) and <em>Tux Racer </em>at a crisp 4K resolution.Geerling's maze of adapters, software tweaks, and workarounds is a testament both to his ingenuity and the flexibility of the Raspberry Pi and its ecosystem. By default, the Pi 5 provides a single PCI Express 2.0 lane for use with external accessories (most commonly M.2 SSDs for storage). Geerling uses an M.2 slot on the Pi and then connects it to an external GPU dock using an M.2-to-Oculink adapter. This gets the GPU connected to the Pi's PCIe bus.But there were other problems that had to be solved as well. The Pi's PCIe slot can only provide 5 W of power for external accessories, far short of the 75 W that a desktop graphics card would be able to get from a typical PCIe slot in a motherboard. Geerling needed to provide external power to both the GPU and to the slot itself to make sure that the RX 460 could draw all the power it needed to.With the hardware end of things set up, turn your attention to the array of software fixes needed to get an Arm64 version of Linux working with an external GPU. Geerling first applied a documented software patch that bumps the Pi's PCIe lane from version 2.0 to 3.0, providing an important bandwidth boost to a GPU that's only getting 1/8th as many PCIe lanes as it normally would."], "https://arstechnica.com/gadgets/2024/10/thunderbird-android-client-is-k-9-mail-reborn-and-its-in-solid-beta/": ["Kevin Purdy", "Thunderbird Android client is K-9 Mail reborn, and it’s in solid beta", "Thunderbird's Android app, which is , is almost out. You can check it out a bit early in a beta that will feel pretty robust to most users.Thunderbird, maintained by the Mozilla Foundation subsidiary MZLA, acquired the source code and naming rights to K-9 Mail, as . The group also brought K-9 maintainer Christian Ketterer (or \"cketti\") onto the project. Their initial goals, before a full rebrand into Thunderbird, involved importing Thunderbird's automatic account setup, message filters, and mobile/desktop Thunderbird syncing.At the tail end of 2023, however, Ketterer wrote on K-9's blog that the punchlist of items before official Thunderbird-dom was . But when it's fully released, Thunderbird for Android will have those features. As such, beta testers are asked to  to see if they work, including automatic setup, folder management, and K-9-to-Thunderbird transfer. The beta will not be \"addressing longstanding issues,\" Thunderbird's blog post notes.Launching Thunderbird for Android from K-9 Mail's base makes a good deal of sense. Thunderbird's desktop client has had  and is only just starting to regain a cohesive vision for what it wants to provide. For , K-9 Mail has been the Android email of choice for people who don't want Gmail or Outlook, will not tolerate the default \"Email\" app on non-Google-blessed Android systems, and just want to see their messages."], "https://arstechnica.com/gadgets/2024/10/apple-adds-dark-mode-and-other-features-to-icloud-com/": ["Samuel Axon", "Apple brings years-old features to iCloud web interface", "In a rare event, Apple has rolled out substantial updates to the  meant to allow users to access Apple services like Mail and Photos when they're away from a Mac, iPad, or iPhone.The flagship addition is dark mode; it \"will automatically match your device settings with a Light Mode or Dark Mode color scheme,\" Apple explains as part of the update.There is also now a way to customize the background for the iCloud web interface—specifically, you can choose between several colors.A few apps received features that have been available on iOS and macOS for a while. For example, the Notes web app now supports pinned notes, and iCloud Drive supports shared views.If you think all that seems like it's pretty basic and late to the game, you're not wrong.The iCloud web interface has long seemed like an afterthought for Apple, and it has always been far behind Apple's native software platforms in terms of features. How far behind? Well, consider this: dark mode was previously added to iOS way back in iOS 13.Apple's  has long said that its services like iCloud are key to making up for slowed hardware sales in the mature smartphone market. To that end, the company has made this web interface available and has brought some of its services like Music and TV+ to other platforms like Windows and Android.However, there seem to be limits to that. As noted, iCloud for web has historically been a subpar experience, and other key services like Messages have not been made available on other platforms at all, possibly to avoid losing the  for iOS. (Messages is notably absent in the web app.)Still, it's nice to see any movement at all here. While iCloud.com gets infrequent and small updates, it remains actively supported at a basic level."], "https://arstechnica.com/gadgets/2024/10/samsung-foldable-that-debuted-at-2k-in-2020-stops-receiving-security-updates/": ["Scharon Harding", "Samsung quits updating Galaxy Z Fold 2 that came out in 2020 for $2,000", "Samsung is no longer providing software or security updates for the Galaxy Z Fold 2 foldable smartphone that it  in September 2020. ahead of its full unveiling, the Z Fold 2 released with a Qualcomm Snapdragon 865+, 12GB of RAM, 256GB of UFS 3.1 storage, and a 4500 mAh battery. The phone’s hallmark is, of course, a foldable 7.6-inch OLED screen with 2208×1768 pixels running at a refresh rate of up to 120 Hz. Surpassing its predecessor, the Fold 2’s outside screen is 6.2 inches (2260×816 pixels), compared to the Fold 1’s 4.6 inches. The Fold 2 also introduced to Samsung devices.With the Fold 1 having , the Fold 2 represented another chance for Samsung. And Samsung continued with the line in 2021 in the form of the cheaper ($1,800 upon release) . Samsung is now up to its , which came out in July for $1,900.Now Samsung is no longer interested in updating the Fold 2. As  noticed today, Samsung removed the Fold 2 from its  that receive security updates. The foldable phone received its last big Android OS update last year and received a One UI update at the end of 2023. Similarly, Samsung’s Galaxy Tab A7 is no longer on Samsung's list of supported devices, as  spotted. The tablet came out in September 2020 for $230."], "https://arstechnica.com/gadgets/2024/10/samsung-says-its-in-crisis-apologizes-for-missing-profit-target/": ["Song Jung-a and Christian Davies, Financial Times", "Samsung says it’s in “crisis,” apologizes for missing profit target", "Samsung Electronics has issued a public apology and acknowledged the company is considered to be in “crisis,” following the release of worse than expected profit guidance on Tuesday.The South Korean chip giant reported a preliminary operating profit of ₩9.1 trillion ($6.8 billion) for the third quarter, undershooting market expectations of a ₩10.3 trillion profit, according to LSEG SmartEstimates.While its expected operating profit has almost tripled compared with the same period a year ago, following a surge in memory chip prices, it is down almost 13 percent on the second quarter of this year.The company’s share price has fallen almost 30 percent over the past six months amid growing concern over its competitiveness in cutting-edge chips used in artificial intelligence systems.“The leadership team at Samsung Electronics wishes to apologize for not meeting your expectations with our performance,” Young Hyun Jun, the head of Samsung’s chip division, wrote in a letter to customers, investors, and employees on Tuesday.“We have caused concerns about our technical competitiveness, with some talking about the crisis facing Samsung. As leaders of the business, we take full responsibility for this,” said Jun, who took over the division in a management shake-up in May.The worse than expected guidance on Tuesday underlines investor concern about deteriorating memory market conditions and the possibility of slowing AI investment by big tech groups, though some concerns were relieved by Micron Technology’s recent upbeat forecast for the current quarter.“Concerns are growing as legacy memory demand is slowing and smartphone demand is weaker than expected while its entry into the [advanced high-bandwidth memory] HBM market gets delayed compared with rivals,” said Kim Hyun-tae, an analyst at Shinhan Securities.Concern about the industry outlook has intensified after Morgan Stanley forecast a looming memory downturn, citing falling demand for conventional Dram memory and possible HBM oversupply.“Memory conditions are beginning to deteriorate,” said analysts Shawn Kim and Duan Liu in a recent report. “It will get tougher for revenue growth and margins from here as we move past late-cycle conditions.”"]}