{
  "https://www.theverge.com/2024/12/21/24326402/google-search-antitrust-remedies-proposal-browser-default-android": [
    ["Richard Lawler"],
    [
      "verge",
      "front-page",
      "news",
      "tech",
      "google",
      "antitrust",
      "regulation",
      "politics",
      "policy",
      "stream-23633524"
    ],
    "Google’s counteroffer to the government trying to break it up is unbundling Android apps",
    "Here’s how Google would fix its monopoly on search.",
    [
      [
        ["The Department of Justice’s "],
        [
          "list of solutions",
          "https://www.theverge.com/2024/10/8/24265832/google-search-antitrust-remedies-framework-android-chrome-play"
        ],
        [
          " for fixing Google’s illegal antitrust behavior and restoring competition in the search engine market started with forcing the company to sell Chrome, and late Friday night, Google responded with a "
        ],
        [
          "list of its own",
          "https://s3.documentcloud.org/documents/25467251/googles-proposed-final-judgment-in-search-antitrust.pdf"
        ],
        [" (included below). "]
      ],
      [
        [
          "Instead of breaking off Chrome, Android, or Google Play as the DOJ’s filing considers, Google’s proposed fixes aim at the payments it makes to companies like Apple and Mozilla for exclusive, prioritized placement of its services, its licensing deals with companies that make Android phones, and contracts with wireless carriers. They don’t address a DOJ suggestion about possibly "
        ],
        [
          "forcing Google to share its valuable search data",
          "https://www.theverge.com/2024/11/27/24302415/doj-google-search-antitrust-remedies-chrome-android#:~:text=Selling%20precious%20data"
        ],
        [" with other companies to help their products catch up."]
      ],
      [
        [""],
        [
          "According to Google’s lawyers",
          "https://blog.google/outreach-initiatives/public-policy/google-remedies-proposal-dec-2024/"
        ],
        [
          ", the ruling pointed to arrangements with Apple and Mozilla for their browsers, the companies that make Android phones, and wireless carriers. Google regulatory VP Lee-Anne Mulholland "
        ],
        [
          "writes on the company blog",
          "https://blog.google/outreach-initiatives/public-policy/google-remedies-proposal-dec-2024/"
        ],
        [
          ", “This was a decision about our search distribution contracts, so our proposed remedies are directed to that. "
        ]
      ],
      [
        [
          "For three years, its proposal would block Google from signing deals that link licenses for Chrome, Search, and its Android app store, Google Play, with placement or preinstallation of its other apps, including Chrome, Google Assistant, or the Gemini AI assistant. "
        ]
      ],
      [
        [
          "It would also still allow Google to pay for default search placement in browsers but allow for multiple deals across different platforms or browsing modes and require the ability to revisit the deals at least once a year."
        ]
      ],
      [
        [
          "While the company still plans to appeal Judge Amit Mehta’s ruling that said, “Google is a monopolist, and it has acted as one to maintain its monopoly,” first, it says it will submit a revised proposal on March 7th, ahead of a two-week trial over the issue in April."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/24303052/modretro-chromatic-review-game-boy-color-handheld-palmer-luckey": [
    ["Sean Hollister"],
    [
      "verge",
      "front-page",
      "games",
      "entertainment",
      "reviews",
      "guidebook",
      "tech",
      "gadgets",
      "featured-story"
    ],
    "ModRetro Chromatic review: an arms dealer’s Game Boy is among the best ever made",
    "Stellar hardware from a controversial figure.",
    [
      [
        [
          "In the 1990s, I was among the kids who thought military aircraft were devastatingly cool. By then, Tom Cruise and Top Gun had long established the F-14 Tomcat and a pair of aviator shades as "
        ],
        [
          "a fantasy for young men",
          "https://www.military.com/daily-news/2022/08/11/top-gun-boosted-recruiting-and-brought-tailhook-scandal-so-what-happens-after-blockbuster-sequel.html"
        ],
        [
          "; I personally preferred the Lockheed F-117A, the high-tech angular “Stealth Fighter” that could invisibly sneak past enemy radar, and was partial to the legendary Lockheed SR-71 that flew so fast it could outrun missiles."
        ]
      ],
      [
        [
          "At the time, I probably would have snapped up a jet-black Lockheed Game Boy without a second thought. But I’m old enough now to realize that cool aerodynamics are just the tip of a deadlier geopolitical iceberg. Lockheed makes weapons, and I don’t have a say in who gets to buy them or who they’re used against. I don’t have a say in whether that tech should exist at all."
        ]
      ],
      [
        [
          "I’ve been thinking about Lockheed Martin as I review a much simpler gadget: the ModRetro Chromatic. The Chromatic is a high-end remake of Nintendo’s Game Boy, and it might be the best version of a Game Boy ever made. But it’s connected to a company much like Lockheed: Anduril, the defense contractor that makes weaponized drones, networked surveillance systems, and other military tech."
        ]
      ],
      [
        [
          "Both Anduril and ModRetro are founded by Palmer Luckey, the creator of the Oculus Rift VR headset. Luckey is now an "
        ],
        [
          "almost unbelievable character",
          "https://www.tabletmag.com/feature/american-vulcan-palmer-luckey-anduril"
        ],
        [
          ", a devout anime and video game lover who reportedly stores his vast collection of games in a decommissioned US nuclear missile silo — one of "
        ],
        [
          "several silos he says he owns",
          "https://www.latimes.com/la-influential/story/2024-06-30/palmer-luckey-anduril#:~:text=And%20then%20there%20are%20the%20nuclear%20missile%20silos."
        ],
        [". "]
      ],
      [
        [
          "He plays with a lavish collection of military hardware including helicopters and a Mark V Special Operations Craft used by Navy SEALs. He once "
        ],
        [
          "made the cover of Time Magazine",
          "https://time.com/3987059/in-the-latest-issue-41/"
        ],
        [
          " as a floating barefoot “visionary” with an Oculus headset atop his head, though these days he’s more likely to make headlines "
        ],
        [
          "propagandizing for",
          "https://gizmodo.com/im-a-propagandist-palmer-luckey-on-the-future-of-warfare-2000506276"
        ],
        [
          " his version of the defense industry. He was the face of VR before Facebook kicked him out. (Luckey was an early "
        ],
        [
          "Trump booster",
          "https://www.theverge.com/2017/4/19/15366500/palmer-luckey-trump-donations-chrono-trigger-oculus"
        ],
        [
          " and took flak for funding a single Hillary Clinton-trolling billboard; Mark Zuckerberg denied he was fired for his political views at the time; some Meta execs have "
        ],
        [
          "since apologized",
          "https://www.roadtovr.com/metas-apologizes-oculus-founder-palmer-luckey-ousting/"
        ],
        [" for his ouster.) "]
      ],
      [
        [
          "Many tech companies are involved with military projects in some shape or form. Google and Amazon have a contract with Israel for a “Project Nimbus” that "
        ],
        [
          "Google knew could have enabled human rights violations against Palestinians",
          "https://www.theverge.com/2024/12/3/24311951/google-project-nimbus-internal-documents"
        ],
        [", and Google "],
        [
          "has fired many workers",
          "https://www.theverge.com/2024/4/30/24145680/google-workers-fired-project-nimbus-protest-nlrb-complaint"
        ],
        [" for protesting that deal. Microsoft is currently working towards "],
        [
          "outfitting over 100,000 soldiers",
          "https://www.theverge.com/2019/2/22/18236116/microsoft-hololens-army-contract-workers-letter"
        ],
        [" with a militarized version of its HoloLens headset. Meta "],
        [
          "is now letting defense contractors",
          "https://www.theverge.com/2024/11/4/24287951/meta-ai-llama-war-us-government-national-security"
        ],
        [
          " use its Llama AI model. I think it’s fair to say few of us boycott these companies or even think about these things when we use their products."
        ]
      ],
      [
        [
          "But where each of these companies can plausibly say “It’s just business” as they defend their cloud server contracts or "
        ],
        [
          "when their CEOs",
          "https://www.theverge.com/2024/10/31/24282719/tech-leaders-trump-jeff-bezos-zuckerberg-pichai"
        ],
        [" "],
        [
          "kiss",
          "https://www.theverge.com/2024/12/13/24320643/sam-altman-is-donating-to-trumps-inauguration-too"
        ],
        [""],
        [
          "the",
          "https://www.theverge.com/2024/12/12/24319768/meta-1-million-donation-trump-inauguration"
        ],
        [
          "se companies can plausibly say “It’s just business” as they defend their cloud server contracts or when their CEOs kiss the "
        ],
        [
          "ring",
          "https://www.theverge.com/2024/12/12/24320063/amazon-is-donating-1-million-to-trumps-inauguration"
        ],
        [", and it’s "],
        [
          "very hard to escape Big Tech’s orbit",
          "https://gizmodo.com/i-tried-to-block-amazon-from-my-life-it-was-impossible-1830565336"
        ],
        [
          ", this is a fun but unnecessary product from a man with a specific point of view on weapons, war, and politics. Luckey has twice hosted fundraisers for Donald Trump (in 2020 and 2024) at his own house. He publicly expresses the fervent (and self-serving) belief that tech companies should get in bed with the military."
        ]
      ],
      [
        [
          "For Luckey, it’s not just business, it’s personal. And we’ve heard loud and clear that it’s personal for many of our readers, too. I’ve been testing the ModRetro Chromatic for over a month, and it’s very good. I believe it’s the best, most luxurious way to play Game Boy and Game Boy Color games. But if the goal is to restore and preserve our childhood nostalgia, the Luckey connection throws a wrench in the works. What you’re about to read is a real review of an excellent product, one I genuinely enjoyed using — but one that left me feeling somewhat tortured in the process."
        ]
      ],
      [
        [
          "So as you’d expect, his company has some strong ideas about what a modern Game Boy should look like."
        ]
      ],
      [
        ["Where "],
        [
          "the $220 Analogue Pocket",
          "https://www.theverge.com/22831589/analogue-pocket-review"
        ],
        [
          " seeks to update the Game Boy experience for the present day — with support for other handheld cartridges, ROMs, save states, a TV dock, and so on — the Chromatic stays squarely rooted in the handheld’s past. There are few modern amenities here. It’s designed to feel like a vintage Game Boy, only now with the rough edges sanded off."
        ]
      ],
      [
        [
          "Nintendo’s easy-to-scratch casings, screen lenses, and buttons? They’re made of metal, sapphire, and PBT plastic now. Those hard-to-see screens? You now get a custom IPS display at the same size, resolution, and pixel structure as the original Game Boy and Game Boy Color, one so bright you can play in direct sunlight like we did back in the day. It does come, however, with a brand-new copy of Tetris that optionally adds T-Spins, instant drops, and the ability to hold pieces for later, modernizing the classic game that famously came bundled with the original."
        ]
      ],
      [
        [
          "At its heart, the Chromatic is an attempt to faithfully cross the original 1989 Game Boy with the 1998 Game Boy Color. There’s no SD card reader, no user-accessible operating system, no ability to add or play ROMs: when you slide the top-mounted power switch, it instantly boots your Game Boy or Game Boy Color cartridge using a Field Programmable Gate Array (FPGA) chip that emulates an actual Game Boy’s processors. Like with the Analogue Pocket, the upshot is more responsive, quirk-free gameplay than software emulators allow. "
        ]
      ],
      [
        [
          "I’m a parent, and “I don’t have time for this shit” comes with the territory, so I immediately assumed I would miss “save states,” the feature that lets practically every video game emulator and retro handheld pause and resume your game at literally any moment."
        ]
      ],
      [
        [
          "Then I fired up Pokémon Pinball on an Analogue Pocket, and found I was wrong. I was on a pokémon-catching roll like never before. I caught Charmander, my daughter’s favorite pokémon, and for the first time in Pinball, I evolved it into a Charmeleon, then a Charizard, all without losing my ball. The stakes were high, so I reflexively tapped the Save State shortcut so I could retry if I failed."
        ]
      ],
      [
        [
          "Immediately, the pressure was off — but I felt a chunk of my excitement vanish along with it. I caught those Pokemon fair and square without loading the save, but I’d "
        ],
        [
          "cheated myself",
          "https://knowyourmeme.com/memes/you-cheated-not-only-the-game-but-yourself"
        ],
        [
          " of a pure victory, even if I didn’t wind up cheating the game. When I stuck that same game back into the Chromatic, a handheld without save states, the excitement came back. This is the way the game is meant to be played, and those stakes are there by design. That’s the experience ModRetro wants you to have, and the only one you’ll get. Ditching that modern amenity is a choice, and it isn’t for everyone."
        ]
      ],
      [
        [
          "It’s just one of many ways the Chromatic feels more authentic. Even though it’s a mash-up of two different Game Boy models, it instantly feels familiar in ways the Analogue doesn’t, from the sliding power switch and volume dial (the Analogue has you hold down closely spaced digital buttons and takes longer to start a game) to the button layout and feel."
        ]
      ],
      [
        [
          "The Chromatic is basically the size of a Game Boy Color, with the same bulging battery compartment curve providing a rounded perch for your fingers to rest. But it’s clearly been designed for those who appreciate the original 1989 model too. It’s got the original’s iconic slanted, cake-sprinkle Start and Select buttons, its glossy domed A and B buttons, its larger D-pad, its more protected cartridge slot, and the rounded lower-right corners of its flat-faced chassis and cover glass. All of them bring me back to the handheld that made me a gamer. "
        ]
      ],
      [
        [
          "I wonder if they bring Luckey back to his early days, too. Because while ModRetro appears to have made a "
        ],
        [
          "remarkably repairable handheld",
          "https://www.ifixit.com/News/106916/modretro-chromatic-better-than-the-game-boy-color-it-emulates"
        ],
        [" and is currently "],
        [
          "open-sourcing its CAD files and firmware",
          "https://modretro.com/pages/downloads"
        ],
        [
          ", this bespoke device is not exactly what ModRetro was originally created to make. "
        ]
      ],
      [
        [
          "Luckey cut his teeth turning existing Game Boys and GameCubes into arguably better, more portable versions of themselves by reusing bits of old and new electronics. “It’s a lot of fun because it’s about taking old technology and then cutting out the old parts, replacing them with new parts and making it into something that was never possible before,” he told "
        ],
        [
          "Voices of VR",
          "https://voicesofvr.com/5-palmer-luckey-on-modretros-influence-on-oculus-vr-the-oculus-subreddit-facebook-acquisition-reactions-the-future-of-vr/"
        ],
        [
          " in 2014. The ModRetro Chromatic is all custom, though, right down to its in-house screen. "
        ]
      ],
      [
        [
          "Still, ModRetro’s original approach to development has been on display throughout Luckey’s professional history. Luckey’s key insight with the Oculus Rift was that low-cost smartphone components could finally make VR accessible, a belief "
        ],
        [
          "he shared with researchers at the lab where he worked",
          "https://www.markbolas.com/blank"
        ],
        [
          ", too. Repurposed commercial supply chains are also Anduril’s pitch to become the world’s most efficient weapons manufacturer, “so that the same processes used to build fiberglass bathtubs can just as easily be reconfigured to build missile airframes,” "
        ],
        [
          "as Tablet Magazine described it",
          "https://www.tabletmag.com/feature/american-vulcan-palmer-luckey-anduril"
        ],
        [" in August."]
      ],
      [
        [
          "With that approach, Anduril has rapidly built out an arsenal in just seven years, including multiple drones that can kill — one is a “loitering munition” that remotely dive-bombs a target, another effectively a recoverable ground-to-air missile. "
        ]
      ],
      [
        [
          "When I look at the Chromatic and its prominent “MODRETRO” logo right above the screen, often I just see an excellent Game Boy. But sometimes I see the latest high-tech product from a man who makes high-tech missiles. "
        ]
      ],
      [
        [
          "At this point, you might be wondering: just how excellent is this hardware to justify all this soul-searching? Let’s start with build quality:"
        ]
      ],
      [
        [
          "The Chromatic’s pixel-perfect screen isn’t strictly necessary: I generally had just as good a time on the Analogue Pocket’s bigger, higher resolution display if I enabled the right filters and color palettes, though I did appreciate that the Chromatic got the Game Boy Color feel just right out of the box. The Chromatic even "
        ],
        [
          "lets you summon green-tinted original Game Boy palettes",
          "https://modretro.com/pages/chromatic-manual?srsltid=AfmBOoo-klp0wAw3FLaFKGN3rJ4z_6LVT_nLIV0E2O6ZyBp8mHaj0l2F"
        ],
        [" by holding down buttons at boot."]
      ],
      [
        [
          "There are also some ways it’s not completely faithful to the original Game Boys, just FYI:"
        ]
      ],
      [
        [
          "And there were a few minor disappointments too. Mostly, I wish it worked a little better in quiet bedrooms and loud airplanes. The buttons and even the D-pad click louder than any of my old Game Boys, yet the 3.5mm headphone jack volume is the quietest of the pack. I could barely hear its chiptunes over the din of the plane, and I couldn’t compensate with my noise-canceling Bose QC25 since the Chromatic doesn’t have a four-pole headset jack."
        ]
      ],
      [
        [
          "ModRetro also advertises the Chromatic as “indestructible,” and if that sounds like marketing bluster, you’re at least half right. I dropped the Chromatic twice onto concrete, from 4.5 feet, and it came away with only minor dents, and I was impressed. But ModRetro also has "
        ],
        [
          "a picture of the thing",
          "https://modretro.com/products/chromatic-tetris-bundle?variant=47637522678062#:~:text=A%20handheld%20that%27s%20indestructible"
        ],
        [
          " getting run over by a car. When I ran it over with my car, the screen shattered. The frame is now badly bent. "
        ]
      ],
      [
        [
          "I was also a tad disappointed to find the Chromatic’s USB-C port isn’t as potent as promised. While the company advertised USB-C video output and "
        ],
        [
          "even told me you could charge rechargeable AAs",
          "https://www.theverge.com/2024/6/3/24170572/modretro-chromatic-game-boy-color-palmer-luckey-price-release-date#:~:text=he%20also%20told%20me%20you%20can%20even%20recharge%20your%20NiMH%20AA%20batteries%20over%20USB%2DC"
        ],
        [
          " using the do-it-all port, it turns out the Chromatic can only present itself as a webcam for desktop-style video recording, and NiMH AA charging didn’t make the cut. ModRetro CEO Torin Herndon, who was an engineer at Anduril from 2017 to 2021, tells me the company is beginning production on an optional rechargeable lithium-ion battery pack, but won’t talk price, capacity, or runtime just yet."
        ]
      ],
      [
        [
          "That said, I actually find I prefer AAs. At 50 percent brightness — far higher than I needed on the plane — I saw over eight hours from a set of Ikea-branded Panasonic Eneloop rechargeables, or closer to seven hours from Amazon Basics alkalines. That same brand of alkalines gave me over 12 hours at the second-lowest brightness setting, the dimmest I’d want to use in the daytime, and just under five hours at max brightness and max volume. And again, you can simply plug the Chromatic into a USB port if you’re ever running low on charge, then drop in new AAs without losing your game."
        ]
      ],
      [
        [
          "There’s really no question in my mind that this handheld is the best retro Game Boy yet made, the one that best captures the physical feeling I had playing Game Boy as a kid. I love remasters because they can let you recapture that childhood joy, playing with "
        ],
        [
          "the Lego starship",
          "https://www.theverge.com/23173235/lego-galaxy-explorer-90th-anniversary-birthday-price-release-date#:~:text=With%20the%20Galaxy%20Explorer%2C%20says%20Psiaki%2C%20the%20goal%20was%20to%20trigger%20nostalgia%20by%20building%20the%20ship%20you%20think%20you%20remember"
        ],
        [" or "],
        [
          "Final Fantasy game",
          "https://www.theverge.com/2020/4/6/21207441/final-fantasy-7-remake-ff7-review-ps4"
        ],
        [" you think you remember instead of the one that actually existed."]
      ],
      [
        [
          "But I don’t remember my childhood nostalgia coming with a side of possible guilt and fear about putting money into the pocket of a weapons contractor. Feels weird! "
        ]
      ],
      [
        [
          "Even practically, I wonder who, outside of a handful of 1989 handheld lovers like me, would want a handheld that just plays Game Boy and Game Boy Color carts. Many of the best games are expensive and hard to find in physical form — Metal Gear Solid and the best Pokémon titles can easily command $100 each — and it’d be a more compelling gadget if it could play the arguably better library of Game Boy Advance titles as well. The Analogue Pocket does."
        ]
      ],
      [
        [
          "Luckey has said he wants to expand that original Game Boy library. Game developers never quite stopped making homebrew games for the Game Boy, and ModRetro is one of the few now publishing them on actual carts. Every Chromatic comes with a new copy of Tetris, and you can "
        ],
        [
          "already order 10 more titles",
          "https://modretro.com/collections/games"
        ],
        [", including a new version of "],
        ["Toki Tori", "https://en.wikipedia.org/wiki/Toki_Tori"],
        [" and "],
        ["Tales of Monsterland", "https://joelj.itch.io/talesofmonsterland"],
        [", sequels to "],
        [
          "Traumatarium",
          "https://horatiunyc.itch.io/traumatarium?ac=qfCyYFQF-yt"
        ],
        [" and "],
        ["In the Dark", "https://pearacidic.itch.io/in-the-dark"],
        [", and my personal favorite, the grindy JRPG "],
        ["Dragonyhm", "https://spacebot-interactive.itch.io/dragonyhm"],
        [" with some excellent tunes and pixel art."]
      ],
      [
        [
          "This chiptune in particular, Dragonyhm’s “Gonrad Forest,” captivated me at once:"
        ]
      ],
      [
        [
          "If you feel weird about ModRetro, you should know these games aren’t exclusive to the Chromatic, either — they played perfectly well plugged into an Analogue Pocket or a Game Boy Color, and some even worked on my 1989 original. Some may be available to "
        ],
        ["purchase as ROMs", "https://patmorita.itch.io/hermano-game-boy"],
        [". If you just want to try them, many have "],
        ["playable demos", "https://joelj.itch.io/tales-of-monsterland-dx"],
        [" you can try in an emulator, or even "],
        ["a web browser", "https://spacebot-interactive.itch.io/dragonyhm"],
        [", like this:"]
      ],
      [
        [
          "On a desktop, tap to focus; press Enter to start; use Z, B, and arrow keys to play."
        ]
      ],
      [
        [
          "It’s not clear to me how serious Luckey is about funding a new era of Game Boy. For one thing, the Chromatic is already sold out at his website, and "
        ],
        ["he says", "https://x.com/PalmerLuckey/status/1869538969022787704"],
        [
          " he isn’t making any more, but will focus on releasing new games while it builds "
        ],
        [
          "“something more sustainable”",
          "https://x.com/PalmerLuckey/status/1869538970704679267"
        ],
        [" in terms of hardware instead. ("],
        [
          "A grey Chromatic",
          "https://click.linksynergy.com/deeplink?id=nOD/rLJHOac&mid=24348&murl=https%3A%2F%2Fwww.gamestop.com%2Fconsoles-hardware%2Fretro-consoles%2Fproducts%2Fmodretro-chromatic-gamestop-exclusive%2F20014956.html"
        ],
        [" is still available at GameStop, for now.)"]
      ],
      [
        [
          "Second, as far as I can tell, all of ModRetro’s games beyond Tetris were already in development; some, like Dragonyhm, were already "
        ],
        [
          "headed to cartridge elsewhere",
          "https://www.play-asia.com/dragonyhm/13/70gphb?srsltid=AfmBOoo7uRqQEcvAvT9aEixG9dEhAoeId2n4CjJZTm_MwDDbQgVXmfXr"
        ],
        [
          ". Developing new games isn’t currently a company goal: “We are typically looking for games deep in development at this time, and try to push them across the finish line into being a full-on physical good,” Herndon tells me. He says ModRetro largely pays to create cartridges, boxes, and manuals, and gives developers a “pretty awesome” percentage of sales. "
        ]
      ],
      [
        [
          "The pre-release carts that ModRetro sent me also had a couple issues that are hopefully getting ironed out: I mysteriously lost my entire save in In The Dark 2, and Traumatarium Penitent was missing a key bugfix the developer made almost a year ago. Toki Tori also booted into a full screen glitch the first few times I started it up, but it seems to be working now. "
        ]
      ],
      [
        [
          "Even when people love the idea of revisiting the Game Boy and supporting retro game development, I suspect most will see a $200 handheld that makes you individually swap pricy cartridges as a luxury they can’t afford — not when every iPhone and a mountain of Chinese emulator handhelds can play the same games, ones they can (illicitly) download for free. "
        ]
      ],
      [
        [
          "And if you find the Analogue Pocket isn’t vintage enough for your tastes, you could always do what I just did and add a modern backlit screen to your genuine Nintendo Game Boy. It won’t be pixel-perfect, but it might be good enough for me:"
        ]
      ],
      [
        [
          "But like the Tesla Cybertruck, it’s also very much the product of one person in particular, a person who stands for other things that might clash with your ideals, and it could wind up being a symbol that you don’t terribly mind any of that, even if you actually do.   "
        ]
      ],
      [
        ["Luckey "],
        ["recently told", "https://www.youtube.com/watch?v=flEhMMJ4qoU"],
        [
          " a Pepperdine University audience that it’s not a bad thing to celebrate the power of weapons, saying that “societies have always needed a warrior class that is enthused and excited about enacting violence on others in pursuit of good aims,” and that “you need people like me who are sick in that way and who don’t lose any sleep making tools of violence.” He explained that his company is named Anduril after Aragorn’s sword in The Lord of the Rings partly because that sword was “inherently good,” and “wielded only by the kingdom of man against the hordes of Mordor.”    "
        ]
      ],
      [
        [
          "Real life contains no inherently good drones or inherently good missiles. And two major throughlines of Tolkien’s work are that war is hideous and that power inevitably corrupts. The joy I find playing with fake swords in the ModRetro Chromatic is now weirdly intertwined with a general fear: that Anduril’s real weapons might be misused. I won’t suggest that niche $200 Game Boys are actually funding those weapons in any meaningful way, but these still aren’t emotions I associate with my childhood Nintendo experience. "
        ]
      ],
      [["Photography by Sean Hollister / The Verge"]]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24327946/honda-nissan-mitsubishi-merger-deal-plans-2026": [
    ["Jess Weatherbed"],
    [
      "verge",
      "front-page",
      "news",
      "tech",
      "transportation",
      "honda",
      "cars",
      "nissan",
      "business"
    ],
    "Honda and Nissan plan to merge as we enter the age of electric cars",
    "The merger potentially includes Mitsubishi, and would create the third-largest car maker globally by sales.",
    [
      [
        [
          "Honda and Nissan have announced plans to merge as the Japanese automakers struggle with competition from rival brands in the electric vehicle market. "
        ],
        [
          "The two companies confirmed on Monday",
          "https://global.honda/en/newsroom/news/2024/c241223beng.html"
        ],
        [
          " that they had signed a memorandum of understanding that would create the third largest car maker by sales, behind Toyota and Volkswagen."
        ]
      ],
      [
        ["Nissan alliance member "],
        [
          "Mitsubishi Motors is also in talks",
          "https://www.theverge.com/2024/8/1/24211319/honda-nissan-mitsubishi-ev-development-partnership"
        ],
        [
          " with Honda and Nissan to join the integration, with a decision expected by the end of January. Based on the market capital of all three companies, a finalized merger could result in an entity worth more than 50 billion dollars. Honda will initially lead the management of the merged company according to Honda president, Toshihiro Mibe, with the aim to complete a formal merger agreement by June and finalize the deal by August 2026."
        ]
      ],
      [
        [
          "“Creation of new mobility value by bringing together the resources including knowledge, talents, and technologies that Honda and Nissan have been developing over the long years is essential to overcome challenging environmental shifts that the auto industry is facing,” Mibe said in a statement. "
        ]
      ],
      [
        ["The"],
        [
          " proposed merger was initially teased last week",
          "https://www.theverge.com/2024/12/17/24323448/honda-nissan-merger-talks-memorandum-ev"
        ],
        [
          ", and aims to establish a joint holding company to tackle growing global competition from brands like Tesla and China’s BYD in the EV market. The deal would also help to rescue the struggling Nissan, which saw its net earnings in mid-2024 fall by more than 90 percent year over year, and announced plans in November "
        ],
        [
          "to lay off thousands of workers",
          "https://www.bbc.co.uk/news/articles/c62jng5299jo"
        ],
        ["."]
      ],
      [
        [
          "“If realized, I believe that by uniting the strengths of both companies, we can deliver unparalleled value to customers worldwide who appreciate our respective brands,” said Nissan CEO Makoto Uchida. “Together, we can create a unique way for them to enjoy cars that neither company could achieve alone.”"
        ]
      ],
      [
        ["Ex-Nissan boss "],
        [
          "Carlos Ghosn told Bloomberg ",
          "https://www.bloomberg.com/news/articles/2024-12-20/ghosn-says-honda-deal-talks-indicate-nissan-is-in-panic-mode"
        ],
        [
          "on Friday that the merger is a “desperate move” by Nissan, and that it’s “not a pragmatic deal because frankly, the synergies between the two companies are difficult to find.” The company has been in turmoil since Ghosn was arrested by Japanese authorities in 2018 over charges of financial misconduct."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24328087/google-proposed-final-judgement-search-monopoly-antitrust-default-contracts": [
    ["Lauren Feiner"],
    [
      "verge",
      "front-page",
      "policy",
      "antitrust",
      "regulation",
      "politics",
      "google",
      "tech",
      "stream-23633524"
    ],
    "Google to court: we’ll change our Apple deal, but please let us keep Chrome",
    "Google is offering a far more pared-down solution to the court’s ruling that it illegally monopolized search.",
    [
      [
        ["After its victory "],
        [
          "against Google in an antitrust trial",
          "https://www.theverge.com/2024/8/5/24155520/judge-rules-on-us-doj-v-google-antitrust-search-suit"
        ],
        [" earlier this year, the Department of Justice recently "],
        [
          "proposed a sweeping set of changes its search business",
          "https://www.theverge.com/2024/11/27/24302415/doj-google-search-antitrust-remedies-chrome-android"
        ],
        [
          ". The DOJ put a lot on the table, demanding that Google sell its Chrome browser, syndicate its search results, and avoid exclusive deals with companies like Apple for default search placement. It even kept open the possibility of forcing an Android sale."
        ]
      ],
      [
        ["Now, Google has "],
        [
          "responded with a far simpler proposal",
          "https://blog.google/outreach-initiatives/public-policy/google-remedies-proposal-dec-2024/"
        ],
        [": prohibit those default placement deals, and only for three years."]
      ],
      [
        [
          "A court found Google liable for unlawfully monopolizing online search, and its remedies are supposed to reset the market, letting rivals fairly compete. Google (obviously) disagrees that it’s running a monopoly, but before it can appeal that underlying conclusion, it’s trying to limit the fallout if it loses."
        ]
      ],
      [
        [
          "Google’s justification is that search deals were at the heart of the case, so they’re what a court should target. Under the proposal, Google couldn’t enter deals with Android phone manufacturers that require adding mobile search in exchange for access to other Google apps. It couldn’t require phone makers to exclude rival search engines or third-party browsers. Browser companies like Mozilla would be given more flexibility in setting rival search engines as defaults."
        ]
      ],
      [
        [
          "Perhaps the biggest concession is that this agreement would specifically end Google’s "
        ],
        [
          "long-running multibillion-dollar search deal",
          "https://www.theverge.com/2024/5/3/24147682/google-closing-arguments-search-distribution-trial-day-1"
        ],
        [
          " with Apple. It would bar Google from entering agreements that make Google Search the default engine on any “proprietary Apple feature or functionality, including Siri and Spotlight” in the US — unless the deal lets Apple choose a different default search engine on its browser annually and “expressly permits” it to promote other search engines."
        ]
      ],
      [
        [
          "And in a nod to some DOJ concerns about Google locking out rival AI-powered search tools and chatbots, Google proposes it should be disallowed from requiring phone makers to add its Gemini Assistant mobile app in order to access other Google offerings."
        ]
      ],
      [
        [
          "The government has proposed ten years of restrictions, but Google’s counterproposal is only three — it argues nothing more is necessary because “the pace of innovation in search has been extraordinary” and regulating a “fast-changing industry” like search would slow innovation."
        ]
      ],
      [
        [
          "If the court accepts Google’s streamlined proposal over the DOJ’s, the company could lose out on some lucrative or strategically advantageous deals, but its business would remain intact. It wouldn’t have to spin out its Chrome browser or have the threat of an Android divestment order hanging over it. And it wouldn’t need to share many of the underlying signals that help it figure out how to serve useful search results, so that rivals could catch up and serve as a true competitive pressure, as the DOJ hopes. "
        ]
      ],
      [
        [
          "Both Google and the DOJ’s proposals are essentially starting points from which the judge can work. But Google is betting it could have an easier time selling a simple proposal that addresses a major, specific problem raised in the trial. It’s positioning the government’s proposals as extreme and reaching beyond the scope of the judge’s earlier decision, perhaps — Google will likely tell the court — even in a way that could get overturned on appeal."
        ]
      ],
      [
        [
          "This hasn’t been received well by at least one of Google’s rivals, the search engine company DuckDuckGo. “Google’s proposal attempts to maintain the status quo and change as little as possible,” spokesperson Kamyl Bazbaz said in a statement. Both sides will argue their case in a federal court in Washington, DC beginning on April 22."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24328211/asus-rog-strix-laptop-teaser-ces-2025": [
    ["Emma Roth"],
    [
      "verge",
      "front-page",
      "news",
      "tech",
      "laptops",
      "asus",
      "pc-gaming",
      "ces"
    ],
    "Asus teases a new RGB-outlined Rog Strix laptop coming next year",
    "Rumors hint at new Rog Strix laptops with RTX 50-series GPUs coming January 6th.",
    [
      [
        [
          "Asus is planning to launch a new Rog Strix laptop at CES on January 6th, 2025, "
        ],
        [
          "the company confirmed",
          "https://x.com/ASUS_ROG/status/1871138556259000674?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1871138556259000674%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=about%3Asrcdoc"
        ],
        [" in a post "],
        [
          "spotted by VideoCardz",
          "https://videocardz.com/newz/asus-confirms-january-6th-launch-date-for-rgb-packed-rog-strix-laptop"
        ],
        [
          ". The short teaser shared by Asus shows a laptop with RGB lighting that wraps all the way around the bottom of the device, likely making for an even more colorful underglow "
        ],
        [
          "when compared to previous generations",
          "https://www.theverge.com/23850863/asus-rog-strix-scar-17-review-qhd-gaming-laptop"
        ],
        ["."]
      ],
      [
        [
          "Though Asus doesn’t say which Rog Strix models it will introduce, "
        ],
        [
          "leaked retail listings",
          "https://videocardz.com/newz/asus-rog-gaming-laptops-with-geforce-rtx-5090-and-rtx-5080-gpus-listed-online?__cf_chl_tk=.1zQrNQHSIXqc8EdzywGs5fdDPTRVXY3LCgy5rZ7GtQ-1734636245-1.0.1.1-Z4W.hw8TtffOzrZtSvgU5cBqmPJgvmhF7tWO5paDxqs"
        ],
        [
          " suggest Asus could reveal new Rog Strix 18 Scar and Rog Strix G16 laptops."
        ]
      ],
      [
        [
          "While the Rog Strix Scar 18 is rumored to come with up to an Intel Core Ultra 9 285 HX processor and Nvidia GeForce RTX 5090 graphics chip, the Rog Strix G16 could feature the same CPU options but with up to a GeForce RTX 5080, "
        ],
        [
          "as noted by NotebookCheck",
          "https://www.notebookcheck.net/Massive-Asus-ROG-leak-reveals-VRAM-capacity-of-Nvidia-GeForce-RTX-5090-RTX-5080-RTX-5070-Ti-RTX-5070-RTX-5060-and-RTX-5050.934967.0.html"
        ],
        ["."]
      ],
      [
        [
          "Asus may have more to share than just a pair of new Rog Strix laptops at CES, which is just a couple of weeks away. "
        ],
        [
          "Recent leaks",
          "https://videocardz.com/newz/retailers-list-asus-rog-flow-z13-gaming-tablet-with-16-and-12-core-amd-strix-halo-apu"
        ],
        [
          " also indicate that Asus is getting ready to reveal an upgraded Rog Flow Z13 hybrid tablet / gaming laptop equipped with "
        ],
        [
          "AMD’s next-gen “Strix Halo” processor",
          "https://www.notebookcheck.net/AMD-Ryzen-AI-Max-Plus-395-Strix-Halo-processor-spotted-alongside-new-Asus-ROG-Flow-Z13-variant.933256.0.html"
        ],
        ["."]
      ]
    ]
  ],
  "https://www.theverge.com/24224043/holiday-gift-guide-2024-best-ideas-unique-tech-gadgets": [
    ["Verge Staff"],
    [
      "verge",
      "gift-guide",
      "guidebook",
      "tech",
      "front-page",
      "2024-main-holiday-guide",
      "gadgets",
      "featured-story"
    ],
    "The Verge’s 2024 holiday gift guide",
    "A collection of fun, affordable, and unique gifts fit for everyone on your list.",
    [
      [
        [
          "Each year, we consult the greatest minds at The Verge to bring together a robust collection of gift ideas that build upon both our editorial coverage and our individual interests. Our tasteful 2024 cheat sheet is chock-full of our favorite tech — from "
        ],
        [
          "noise-canceling earbuds",
          "https://www.amazon.com/Apple-Bluetooth-Headphones-Personalized-Effortless/dp/B0DGJ7HYG1/?tag=theverge02-20"
        ],
        [" and "],
        [
          "streaming devices",
          "https://goto.walmart.com/c/482924/565706/9383?u=https%3A%2F%2Fwww.walmart.com%2Fip%2FGoogle-TV-Streamer-4K-Fast-Streaming-Entertainment-Your-Voice-Search-Remote-Watch-Movies-Shows-Live-TV-Netflix-HDR-Smart-Home-Control-32-GB-Storage-P%2F9510173043"
        ],
        [" to "],
        [
          "entry-level e-readers",
          "https://www.amazon.com/dp/B0CNV9F72P/?tag=theverge02-20"
        ],
        [" and "],
        [
          "smart rings",
          "https://www.amazon.com/dp/B0D9WTFDBF/?tag=theverge02-20"
        ],
        [
          " — as well as inexpensive picks for those hoping to stretch their budget a bit further. After all, you don’t need to gift a "
        ],
        [
          "$500 film camera",
          "https://go.skimresources.com/?id=1025X1701640&xs=1&url=https%3A%2F%2Fwww.bhphotovideo.com%2Fc%2Fproduct%2F1834281-REG%2Fpentax_17_film_camera.html"
        ],
        [" or a "],
        [
          "newfangled gaming console",
          "https://www.amazon.com/PlayStation-5-Pro-Console/dp/B0DGY63Z2H?tag=theverge02-20"
        ],
        [" just to show someone you care. Sometimes, "],
        [
          "a fun shirt",
          "https://www.avantlink.com/click.php?tt=cl&merchant_id=e295c418-295a-447c-b265-734e25f82503&website_id=0f9b0f6f-13ac-4498-8e0f-b3beae765e07&url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F112713%2Fpatagonia-go-to-shirt-mens"
        ],
        [" will do the job just fine. "]
      ],
      [
        ["This is just a sneak peek, though. We also have gift guides for "],
        [
          "tinkerers",
          "https://www.theverge.com/24224047/best-tool-gift-ideas-holiday-2024-handyperson-builders-tinkerers"
        ],
        [", "],
        [
          "new parents",
          "https://www.theverge.com/24224050/holiday-gifts-newborn-babies-new-parents-unique-ideas-2024-tech-gadgets"
        ],
        [
          ", and everyone else on your holiday wish list. With a little luck, it’ll make checking off names that much easier."
        ]
      ],
      [["Photo / Art Direction and Photography: Amelia Holowaty Krales"]],
      [["Creative Direction: Kristen Radtke"]],
      [["Art Direction and Design: Cath Virginia"]],
      [["Prop Styling: Maeve Sheridan and Ashleigh Sarbone"]]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24327980/sony-wh-1000xm4-noise-canceling-headphones-rig-nacon-revolution-x-controller-deal-sale": [
    ["Quentyn Kennemer"],
    [
      "verge",
      "good-deals",
      "guidebook",
      "tech",
      "front-page",
      "headphone",
      "sony"
    ],
    "Sony’s WH-1000XM4 headphones are nearly 50 percent off right now",
    "Plus, we’re seeing the lowest prices to date on RIG’s Nacon Revolution X controller and the Insta360 Link 2 webcam.",
    [
      [
        [
          "A couple of months ago, we saw the Sony WH-1000XM4 drop to $129.99, which was an absolute steal for the last-gen noise-canceling headphones. That deal predictably sold out in a heartbeat, and there’s no telling whether we’ll see it that low again, but "
        ],
        ["Amazon", "https://www.amazon.com/dp/B0863TXGM3?tag=theverge02-20"],
        [
          " is selling them in black for $178.20 (about $170 off), which would be an all-time low if not for said outlier. You can also pick them up in "
        ],
        ["blue", "https://www.amazon.com/dp/B08MVGF24M/?tag=theverge02-20"],
        [" and "],
        ["white", "https://www.amazon.com/dp/B0863FR3S9/?tag=theverge02-20"],
        [
          " for $198 right now, though that price is frequently available these days."
        ]
      ],
      [
        ["The newer "],
        [
          "Sony WH-1000XM5",
          "https://www.theverge.com/23067645/sony-wh-1000xm5-noise-canceling-headphones-review"
        ],
        [" have leapfrogged the heap as the "],
        [
          "best noise-canceling headphones",
          "https://www.theverge.com/21345733/best-noise-canceling-headphones"
        ],
        [
          " for most people in our book, but the XM4 remain a great pair of headphones if you’re looking to save some money. They feature phenomenal audio quality and noise cancellation, which keeps them in the big leagues occupied by newer sets. They also have nice quality-of-life features, including a foldable design and multipoint Bluetooth support, the latter of which allows you to connect them to two devices simultaneously. The XM5’s improved microphones make them the better buy if you frequently take calls while using your headphones, but not so much that we would dissuade you from saving more than $100 by going for the older pair."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24328046/walmart-spark-delivery-lawsuit-branch-instant-payment": [
    ["Umar Shakir"],
    ["verge", "front-page", "news", "tech", "policy", "labor"],
    "Walmart sued over illegally opening bank accounts for delivery drivers",
    "The Consumer Financial Protection Bureau says Walmart misled delivery workers into using Branch Messenger to get paid.",
    [
      [
        ["The Consumer Financial Protection Bureau (CFPB) is "],
        [
          "suing Walmart and payroll service provider Branch Messenger",
          "https://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-walmart-and-branch-messenger-for-illegally-opening-deposit-accounts-for-more-than-one-million-delivery-drivers/"
        ],
        [" for alleged illegal payment practices for gig workers. "]
      ],
      [
        ["The bureau says Walmart was opening direct deposit accounts using "],
        [
          "Spark delivery",
          "https://www.theverge.com/2018/9/6/17828028/walmart-partners-bringg-logistics-platform-grocery-delivery"
        ],
        [
          " drivers’ social security numbers without their consent. The accounts also can come with intense fees that, according to the complaint, would add either 2 percent or $2.99 per transaction, whichever is higher. It also says Walmart repeatedly promised to provide drivers with same-day payments through the platform starting in July 2021 but never delivered on that."
        ]
      ],
      [
        [
          "“Walmart made false promises, illegally opened accounts, and took advantage of more than a million delivery drivers,” said CFPB Director Rohit Chopra in a statement. “Companies cannot force workers into getting paid through accounts that drain their earnings with junk fees.” The agency sued both companies in the US District Court for the District of Minnesota."
        ]
      ],
      [
        ["Spark delivery workers "],
        [
          "have been complaining",
          "https://www.youtube.com/watch?v=NdXuWFUXmKM"
        ],
        [
          " about Walmart’s Branch Messenger account requirements for years, which forced workers to use these accounts with no option to direct deposit to a preferred credit union or local bank. Walmart allegedly told workers they’d be terminated if they didn’t accept the Branch accounts."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/24324635/new-jersey-drones-rumors-nj-news": [
    ["Richard Lawler"],
    ["verge", "front-page", "news", "tech", "drone", "policy", "social"],
    "Here’s everything we don’t know about New Jersey’s drone mystery",
    "Share this story",
    [
      [
        [
          "2024’s drone hysteria has gone on for weeks across the East Coast, and we still have far more questions than answers. The sightings may have started in New Jersey, but reports of possible drone sightings have continued to spread. "
        ]
      ],
      [
        ["The usual authorities haven’t helped much, with bland "],
        [
          "statements",
          "https://www.morriscountynj.gov/Morris-County-News/Law-Enforcement-Advises-Public-How-to-Report-Drones-Activity"
        ],
        [
          " like “There continues to be no known threat to public safety,” failing to tamp down anxiety and interest. What we do know so far is that this is a "
        ],
        [
          "perfect storm for clout-chasing politicians",
          "https://www.theverge.com/2024/12/18/24324142/nj-drone-sightings-politicians-wrong"
        ],
        [" and that our phone cameras aren’t really up to the "],
        [
          "task of taking pictures of stuff flying around in the sky",
          "https://www.theverge.com/2024/12/18/24324347/new-jersey-drones-photos-phone-camera"
        ],
        ["."]
      ],
      [
        [
          "Meanwhile, social media-fueled misinformation has rushed to fill the information vacuum about what people are seeing. Even if, in many cases, what they’ve seen are planes, stars, meteors, or drones sent up by drone hunters to try to find the mystery drones."
        ]
      ],
      [
        [
          "We’ll keep track of the best information we can pull together right here."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/24326185/amazon-kindle-paperwhite-signature-edition-2024-e-reader-review": [
    ["Andrew Liszewski"],
    [
      "verge",
      "front-page",
      "e-reader-review",
      "reviews",
      "guidebook",
      "tech",
      "gadgets",
      "news",
      "amazon"
    ],
    "Amazon Kindle Paperwhite (2024) review: slightly larger, slightly faster, slightly better",
    "Performance upgrades and screen improvements make the new Paperwhite’s minor updates feel more substantial.",
    [
      [
        [
          "I tested the $199.99 Kindle Paperwhite Signature Edition, which is $40 more than the $159.99 basic Paperwhite. The screen and internals are the same, but the Signature Edition includes an ambient light sensor for automatic brightness adjustments, 32GB of storage rather than 16GB, no lockscreen ads, wireless charging, and a metallic finish on the back. The metallic jade version I was sent looked great (metallic black and raspberry are also options) but felt slightly less grippy than the plastic of the base Paperwhite."
        ]
      ],
      [
        [
          "The new Paperwhite features a 300ppi screen with a small bump in size from 6.8 to seven inches — not really enough to be noticeable, but enough to let you squeeze a few extra lines of text on a page. Thanks to smaller bezels, the new Paperwhite is just a few millimeters larger than the previous version while managing to be slightly thinner; in use, it feels nearly identical. This year’s model also "
        ],
        [
          "brings the display flush with the bezels",
          "https://www.theverge.com/2024/10/16/24271197/amazon-kindle-paperwhite-e-reader-12th-gen-2024"
        ],
        [", although it’s another subtle improvement."]
      ],
      [
        [
          "What is noticeable is the increased contrast. Thanks to the use of an oxide thin-film transistor on the screen, the new Paperwhite has the highest contrast ratio of any e-reader I’ve ever tested. The benefits aren’t immediately obvious when you’re reading plain text, but the deeper blacks make the screen look closer to an actual printed page. It gives illustrations, pictures, and book covers more pop and presence, and makes comics and manga panels look sharper. The new screen occasionally made some of the fine text in Jonathan Hickman and Marco Checchetto’s Ultimate Spider-Man: Married with Children appear bolder and easier to read without zooming in."
        ]
      ],
      [
        [
          "It’s not a feature that’s as flashy as a color E Ink screen, but it’s easily the new model’s best upgrade, and it’s going to make it hard to return to my Kobo Libra 2."
        ]
      ],
      [
        [
          "Amazon has also improved the new Paperwhite’s lighting, giving the screen a more neutral tone at its default settings. The last generation Paperwhite’s screen skews a little cooler, but with both Paperwhite models’ warmth sliders turned up, the differences are indistinguishable."
        ]
      ],
      [
        [
          "This is also the first Paperwhite to use a dual-core processor (the Oasis, rest in peace, "
        ],
        [
          "had a dual-core processor",
          "https://www.anandtech.com/show/12367/the-amazon-kindle-oasis-2017-review-a-premium-take-on-the-ereader/3"
        ],
        [
          " back in 2017). The 1GHz Mediatek CPU would be painfully slow for a device with an LCD screen, but it makes a big difference on an e-reader. Amazon’s claims of 25 percent faster page turns weren’t noticeable when I was reading text — the refresh rate of the E Ink screen is the limiting factor there — but I was genuinely surprised at how much faster it opened half-gigabyte, image-heavy PDF files I sideloaded. On the 11th-generation Paperwhite there’s a pause that makes me wonder if the device is going to choke on the files, but the new Paperwhite opens them instantaneously and flips through the pages nearly as fast as it does with plain text."
        ]
      ],
      [
        [
          "The user interface also feels faster. It’s still not as fast or responsive as a smartphone or tablet, and zooming in and out of comics and photos can still feel sluggish, but scrolling through book lists, navigating Amazon’s book store, and popping in and out of various menus is satisfyingly speedy. Or at least as speedy as it can be with the limitations of E Ink."
        ]
      ],
      [
        [
          "Amazon claims the new Paperwhite can be used for up to 12 weeks between charges, but that’s when limiting your reading to just 30 minutes a day at half screen brightness and wireless features turned off. After an hour reading, jumping back and forth between books and PDFs, and browsing other titles on Amazon’s online store with screen brightness set to 75 percent, the new Paperwhite lost five percent of its charge. With that daily routine I’d expect to squeeze about three weeks out of the Paperwhite’s battery, and potentially even longer if I wasn’t so indecisive about what I was reading."
        ]
      ],
      [
        [
          "If you’re a Kindle user who’s upgraded in the past few years, the new Paperwhite’s functionality will feel familiar. If you’re switching from competitors like Kobo, you may find yourself running into some frustrating limitations. Sideloading documents like PDFs or ePUB files is harder than it needs to be, since Kindle devices no longer connect to computers as external drives. You need to use Amazon’s online services or desktop apps to get e-books and other documents onto the Paperwhite, and both options are clunky."
        ]
      ],
      [
        [
          "Text customization is also limited in the Kindle OS compared to Kobo devices, which offer finer adjustments for font size, line spacing, and margins. Although I find the Paperwhite’s formatting options too simplified, I can see the appeal for those wanting a device that’s very easy to use. I like that you can save your adjustments as custom themes — it’s a feature I wish Kobo would add — but I can’t understand why Amazon limits each device to just five custom themes."
        ]
      ],
      [
        [
          "Borrowing library books is also easier on a Kobo. The new Paperwhite still requires you to use the Libby app or website on a separate device to browse and borrow titles. Kobo’s e-readers have Overdrive built-in, and while they do "
        ],
        [
          "obfuscate the borrowing process",
          "https://www.theverge.com/2024/7/4/24158251/kobo-libra-clara-colour-e-reader-review"
        ],
        [", you don’t need to pull out your phone to do so."]
      ],
      [
        [
          "But Kobo seems to be focusing on color e-readers and larger E Ink note-taking devices these days, and its black-and-white e-reader options are now limited. The $129.99 Kobo Clara BW uses the same E Ink Carta 1300 screen as the new Paperwhite, but it’s only six inches, and its contrast doesn’t look as good. Its all-plastic body and sunken screen also feel cheaper than the new Paperwhite’s. And while the $269.99 Kobo Sage has page turn buttons and stylus support, it’s more of a hybrid e-reader and note-taking device; I find that the eight-inch screen makes it too big to be a take-anywhere e-reader. "
        ]
      ],
      [
        [
          "Although the basic Amazon Kindle is cheaper at $109.99, the better screen, adjustable warmth lighting, and waterproofing — extra insurance if you read in the bath or at the beach — make the new Paperwhite worth the extra money."
        ]
      ],
      [
        [
          "Is the Signature Edition worth an extra $40? Wireless charging isn’t necessary given the Paperwhite’s battery life, and it can be frustrating to align properly. But the ambient light sensor can save you the swipe and tap needed to adjust screen brightness manually if you take your Kindle everywhere (warmth settings don’t automatically adjust) and extra storage is always welcome on a device with no memory card slot. When you factor in the $20 Amazon charges to remove lockscreen ads from the basic Paperwhite, the Signature Edition is the way to go."
        ]
      ],
      [["Photography by Andrew Liszewski / The Verge"]]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24327968/trump-administration-tech-policy-picks-michael-kratsios-lynne-parker-bo-hines-sriram-krishnan": [
    ["Wes Davis"],
    [
      "verge",
      "front-page",
      "news",
      "tech",
      "policy",
      "ai-artificial-intelligence",
      "cryptocurrency",
      "stream-23951656"
    ],
    "Trump announces new tech policy picks for his second term",
    "The President-elect nominated his former chief technology officer, Michael Kratsios, among other picks who will help guide tech policy under ‘crypto czar’ David Sacks.",
    [
      [
        ["In a pair of "],
        [
          "Truth Social",
          "https://truthsocial.com/@realDonaldTrump/posts/113698640480139954"
        ],
        [" "],
        [
          "posts",
          "https://truthsocial.com/@realDonaldTrump/posts/113698639577293090"
        ],
        [
          " on Sunday, Donald Trump announced a set of picks for his administration’s tech policy team that will report to David Sacks, Trump’s “AI and crypto czar.” The picks include Michael Kratsios, who will lead the Office of Science and Technology Policy (OSTP) if confirmed by the Senate. "
        ]
      ],
      [
        [
          "Kratsios, who served in Trump’s first term as the White House chief technology officer, also briefly held an acting undersecretary role at the Department of Defense near the end of the term. He later became a managing director at Scale AI and has been helping lead Trump’s tech policy transition team. "
        ]
      ],
      [
        [
          "The President-elect also picked his former deputy CTO, Dr. Lynne Parker, as Executive Director of the Presidential Council of Advisors for Science and Technology. Directing the Presidential Council of Advisers for Digital Assets (AKA the “Crypto Council”) will be former college football player and unsuccessful Republican congressional candidate Bo Hines. Advising Trump on AI policy as part of the OSTP will be Sriram Krishnan, who has extensive Silicon Valley experience, with roles at Andreessen Horowitz, X, Meta, and Snap."
        ]
      ],
      [
        ["Sacks is close with Elon Musk, who Trump has "],
        [
          "charged with gutting the US government",
          "https://www.theverge.com/2024/11/22/24302735/elon-musk-doge-vivek-ramaswamy-rage-curtis-yarvin"
        ],
        [
          " as part of the not-yet-established Department of Government Efficiency — and who recently helped "
        ],
        [
          "send Congress into chaos",
          "https://www.nbcnews.com/politics/donald-trump/musk-trump-caused-congress-nightmare-christmas-rcna184836"
        ],
        [" by posting relentlessly to stop a US spending bill."]
      ]
    ]
  ],
  "https://www.theverge.com/24322968/nosferatu-review-robert-eggers": [
    ["Charles Pulliam-Moore"],
    [
      "verge",
      "movie-reviews",
      "film",
      "entertainment",
      "news",
      "tech",
      "books",
      "front-page"
    ],
    "Nosferatu is the stuff of exquisitely erotic nightmares",
    "Robert Eggers’ Nosferatu gets at the heart of what makes vampires an eternally fascinating fixture in our sexual imaginations.",
    [
      [
        [
          "But rather than trying to work around that obstacle with experimental riffs on vampire lore, the new film accepts it as fact while inviting you to imagine what it might have felt like to experience this kind of disturbing story for the first time when they were new. You can feel Eggers working to conjure an atmosphere of psychosexual dread, and you can see him using modern filmmaking techniques to create haunting visuals evocative of early 20th century cinema. Though it cleaves very close to the original while incorporating elements from other vampire classics, this Nosferatu puts far more focus on the interiority of its central heroine as she grapples with her deep-seated longing to be taken by an avatar of death."
        ]
      ],
      [
        [
          "“Vampire” is not a word that many people are familiar with in Nosferatu’s depiction of 19th century Wisborg, Germany, but after years of being tormented by psychic visions of a shadowy presence, Ellen Hutter (Lily-Rose Depp) is no stranger to living in fear of the supernatural. Despite her constant feeling of being misunderstood, Ellen’s days are filled with joy thanks to her realtor husband Thomas (Nicholas Hoult) and best friend Anna Harding (Emma Corrin). But Ellen’s nights of sleepwalking through her deathly quiet mansion are harrowing because of the way a mysterious voice from within beckons her to give in to her darkest, most unsettling desires. "
        ]
      ],
      [
        [
          "Even when Ellen is awake, she can sense that somehow, somewhere, something is watching and waiting for an opportunity to make her its own. No matter how much Ellen insists that danger is afoot, though, all her loved ones can see is a woman on the brink of a mental breakdown. It’s much easier for Thomas and Anna’s husband, Friedrich (Aaron Taylor-Johnson), to dismiss her fears as "
        ],
        [
          "symptoms of a wandering uterus",
          "https://lithub.com/hysteria-witches-and-the-wandering-uterus-a-brief-history/"
        ],
        [
          " rather than consider whether there might be more to her premonitions. It’s even hard for Anna — a mother to two young girls — not to assume that Ellen’s troubles are rooted in the fact that she and Thomas have no children of their own. But Ellen and the sinister voice in her head both know that, while sex is definitely on her mind, having kids is not."
        ]
      ],
      [
        [
          "Nosferatu’s depiction of Ellen is one of the clearer examples of Eggers combining aspects of the 1922 film and "
        ],
        ["Stoker’s novel", "https://en.wikipedia.org/wiki/Mina_Harker"],
        [
          " to create a new take on the character that feels both true to the source materials and deeper than the sum of its parts. The movie presents Ellen as the kind of woman who, even without her visions, would still feel smothered by the misogynistic social norms of her era. Ellen’s powers are an innate part of who she is, as is the way they often send her into fits of moaning that, to onlookers, read as explicitly orgasmic. "
        ]
      ],
      [
        [
          "Ellen struggles to remember or articulate much of what she experiences during her nocturnal premonitions. But Nosferatu spells it out plainly as it first shows you how Transylvanian Count Orlok (Bill Skarsgård) is the one calling out to her through their seemingly inexplicable telepathic connection. The mechanics of Ellen and Orlok’s bond is another detail that Eggers has retooled just enough to make it work as a point of intrigue. It’s obvious that this is a film about a vampire who wants to sink his teeth into an unsuspecting woman’s flesh. But Nosferatu cleverly leaves you wondering how, exactly, Orlok first came to know about his latest target."
        ]
      ],
      [
        [
          "Establishing that link early on adds a delicious layer of dread to Nosferatu’s story as Thomas’ presence is requested in Transylvania, where he’s meant to assist an “eccentric” nobleman purchase a new home. We can see that Orlok is orchestrating some kind of elaborate plan to insert himself into Ellen’s life, but what’s fun is the way none of the film’s characters have any frame of reference cluing them in to the fact that they’re dancing through the motions of a classic Dracula period piece like "
        ],
        [
          "Tod Browning’s 1931 adaptation",
          "https://www.youtube.com/watch?v=VoaMw91MC9k&ab_channel=RottenTomatoesClassicTrailers"
        ],
        ["."]
      ],
      [
        [
          "Contemporary horror movies about people who don’t know standard horror movie beats are frustrating because they pull you out of the fantasy. Eggers previously worked around that by focusing his films on characters planted firmly in times when their fears of the surrounding world and their own feelings could give rise to creatures they had never seen before. This Nosferatu is doing something similar, but because its story stays so true to the original, it also feels like Eggers is encouraging you to appreciate it as a thoughtful remake rather than a film trying to reinvent vampires."
        ]
      ],
      [
        [
          "This becomes clearer as Nosferatu shows you more of Orlok’s ability to project his shadow across Europe to menace Ellen with promises of untold pleasure. On a technical level, it’s clear that Eggers is creating scenes that Murnau could have only dreamed of, but you also get the sense that this is exactly the kind of alarming energy that made Max Schreck’s Orlok so frightening when he first appeared onscreen. To that end, this Nosferatu works hard to make you feel Orlok’s presence more than it actually tries to show you what he looks like as his plans begin taking shape. He’s lurking in Ellen’s mind but also in Thomas’ fears that he might not be able to satisfy his wife’s needs."
        ]
      ],
      [
        [
          "Skarsgård’s Orlok is skincrawling once the film gets around to fixing the camera squarely on his face, but much of the count’s essence is channeled through the way Depp and Hoult inhabit Ellen and Thomas. Ellen vacillates between terror, shame, and arousal to make you feel exactly what kinds of designs Orlok has. And Thomas’ guileless confusion when he encounters clearly supernatural things speaks volumes to Orlok’s ability to misdirect his unsuspecting victims."
        ]
      ],
      [
        [
          "While Nosferatu isn’t trying to shock you with its plot or gory deaths, it does want to impress you with its arresting visuals. We’ve seen Eggers work in black and white before, but the way Nosferatu frequently shifts into a near-monochromatic palette of blacks and blues is a brilliantly artful trick evocative of blood draining out of a face in fear. Those moments help make Nosferatu feel like a uniquely inspired presentation of vampires as beings of darkness. But beyond their aesthetic beauty, they also highlight the extent to which Eggers has crafted Nosferatu as a tribute to films from Murnau and Browning."
        ]
      ],
      [
        [
          "It’s rare to see a remake that so effectively celebrates its predecessors while also realizing its own distinct vision, but that’s what is going to make Nosferatu an instant horror classic when it hits theaters on December 25th."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/24315181/ai-smartphones-2024-apple-intelligence-gemini-samsung": [
    ["Allison Johnson"],
    [
      "verge",
      "front-page",
      "gadgets",
      "tech",
      "ai-artificial-intelligence",
      "mobile",
      "iphone",
      "apple",
      "google-pixel",
      "google",
      "samsung",
      "stream-24069579"
    ],
    "The AI smartphones that never materialized in 2024",
    "Despite loud proclamations, AI on smartphones is still mostly a sideshow.  ",
    [
      [
        [""],
        [
          "The theory is",
          "https://blogs.idc.com/2024/02/19/the-future-of-next-gen-ai-smartphones/"
        ],
        [
          " that smartphones as we know them are evolving into something new: AI smartphones. An AI smartphone will be a new kind of device that doesn’t force you to interact with a grid of apps all day long; you’ll be able to ask it to order pizza or send an email just by using an AI-imbued voice assistant. You’ll be able to point your camera at a flyer for a show, have the AI check whether you’re free, and add it to your calendar. You’ll ask it about something a friend said to you — maybe in an email or a text, you’re not sure which — and it will go find the information for you."
        ]
      ],
      [
        [
          "Personally, all of the above sounds great to me. I’d love some help with the chores I carry out a hundred times a day on my phone — and with the firehose of incoming information and notifications I deal with. But AI smartphones are not here yet, not by a long shot, despite what you may have heard. Instead, what we have feels like a collection of loosely associated tech demos. "
        ]
      ],
      [
        ["Right now, AI on your phone can "],
        [
          "help you write and rewrite an email to sound more professional",
          "https://www.theverge.com/2024/8/20/24159832/google-gmail-gemini-help-me-write-polish"
        ],
        [" or "],
        [
          "react to a text with a disco pigeon emoji",
          "https://www.theverge.com/2024/6/10/24175523/apple-ai-custom-emoji-images-ios18-wwdc"
        ],
        [". There’s AI to "],
        [
          "translate phone calls",
          "https://www.theverge.com/2023/11/8/23953198/samsung-galaxy-ai-live-translate-call"
        ],
        [
          ", which kind of works and is actually pretty neat. And there’s AI that can "
        ],
        [
          "turn a nice picture of food into something horrifying",
          "https://www.theverge.com/2024/8/21/24224084/google-pixel-9-reimagine-ai-photos"
        ],
        [". AI on our phones has offered one weird trick after another: "],
        [
          "sometimes funny",
          "https://www.theverge.com/2024/11/12/24289939/apple-intelligence-ai-notification-summaries-awkward-funny-bad"
        ],
        [", "],
        [
          "sometimes interesting",
          "https://www.theverge.com/2024/7/17/24199005/samsung-galaxy-ai-z-fold-6-sketch-to-image"
        ],
        [", but hardly the platform shift we’ve been promised."]
      ],
      [
        [
          "All of the major phone makers are at fault. Samsung opened the year with "
        ],
        [
          "its Galaxy S24 launch in January",
          "https://www.theverge.com/2024/1/17/24040372/samsung-galaxy-s24-plus-price-release-date-specs-features-ai-artificial-intelligence"
        ],
        [", declaring “Galaxy AI is here” at a "],
        [
          "hockey arena-appropriate volume",
          "https://www.threads.net/@allisonjo1/post/C2NegxjPc0B?xmt=AQGz2wldzfak7XiAiomnnGmkhNZV7Xr50yufNeQaZjfrsw"
        ],
        [
          ". To be sure, the devices it announced are good smartphones, and they run a blend of Samsung and Google’s Gemini Nano models on-device, but I wouldn’t call them AI smartphones. "
        ]
      ],
      [
        [
          "Supposedly, they can help you take distractions out of your photos — but you might end up with "
        ],
        [
          "something even more distracting instead",
          "https://www.theverge.com/24058916/samsung-galaxy-s24-plus-review-screen-battery-camera#:~:text=a%20new%20arm%20made%20out%20of%20pillows"
        ],
        [
          ". The live language interpreter feature for phone calls could come in handy for something like making a dinner reservation. But it also "
        ],
        [
          "translated a statement from my colleague",
          "https://www.theverge.com/24053907/samsung-galaxy-s24-ultra-review-ai-screen-camera-battery#:~:text=I%20am%20eating%20my%20chair."
        ],
        [
          " as “I am eating my chair.” (She was not.) Most users will find that these AI features fade into the background once the novelty wears off."
        ]
      ],
      [
        ["Later in 2024, fall hardware season arrived early with "],
        [
          "AI-ified Pixels",
          "https://www.theverge.com/24219355/google-pixel-9-ai-features-screenshots-add-me-magic-editor"
        ],
        [
          ". Google has made much of AI on its phones for the past couple of years, but the company’s Gemini AI is absolutely everywhere on the Pixel 9 series. There’s an AI-generated summary at the top of the weather app, a new app that saves and tags your screenshots using AI, a new AI-powered default assistant, and lots of AI image generation tools — "
        ],
        [
          "from silly",
          "https://www.threads.net/@allisonjo1/post/C-8WnXIy-Ga?xmt=AQGzQca039iJqYvEZMAFGXWRgjOAT5NMJ3dr6EPAxrdCFQ"
        ],
        [" to "],
        ["seriously worrying", "https://www.theverge.com/e/23988125"],
        [". "]
      ],
      [
        [
          "Some of it does feel useful, particularly the screenshots app, which is the kind of thing you might find handy if you tend to keep infinite Chrome tabs open on your phone as bookmarks. But these features, siloed into their respective apps, don’t feel like they have much to do with each other. Gemini sort of connects the dots with extensions, but support for different apps is being added slowly — and even with an extension, Gemini can only do so much for you."
        ]
      ],
      [
        ["Last but not least, we met the "],
        [
          "iPhones “built for Apple Intelligence”",
          "https://www.theverge.com/2024/9/9/24230103/iphone-16-pro-specs-features-price-release-date-apple"
        ],
        [
          " in September. I think it says a lot about the state of Apple’s AI that the iPhone 16 initially shipped without Apple Intelligence. AI features finally arrived in late October with iOS 18.1. And if anyone was waiting with bated breath, this first update was probably underwhelming. "
        ]
      ],
      [
        [
          "Right now, Apple Intelligence includes summaries for notifications and emails, tools to alter the style of your writing, and a new glowing UI for Siri. Notification summaries can be useful, but usually "
        ],
        [
          "they’re just funny",
          "https://www.theverge.com/2024/11/12/24289939/apple-intelligence-ai-notification-summaries-awkward-funny-bad"
        ],
        [
          ". The writing tools are standard fare at this point, and Siri is basically the same old assistant with a new coat of paint. There’s "
        ],
        [
          "more to come",
          "https://www.theverge.com/2024/9/22/24251279/apple-intelligence-update-schedule"
        ],
        [
          ", but what’s here now certainly doesn’t add up to an AI smartphone."
        ]
      ],
      [
        [
          "It’s not just phones; this is a messy moment for AI in general. Depending on who you ask, AI is either a massive bubble that’s about to burst or a few months away from "
        ],
        [
          "evolving into digital God",
          "https://www.theverge.com/2024/9/24/24252723/openai-o1-ai-god-tiktok-google-adtech-vergecast"
        ],
        [
          ". AI is being foisted on us in every direction: surfacing in Google search results, lurking in every Meta product, "
        ],
        [
          "greeting you by name",
          "https://www.theverge.com/24290914/spotify-ai-dj-radio-kexp"
        ],
        [
          " in the Spotify app. It’s hard to separate the signal from the noise when it comes to AI, because the noise is everywhere and it’s so goddamn loud! "
        ]
      ],
      [
        ["And there "],
        [
          "really might be a signal in there",
          "https://www.theverge.com/23940685/qualcomm-snapdragon-summit-2023-8-gen-3-ai"
        ],
        [
          " — especially when it comes to our phones. Siri really might become more useful, with "
        ],
        [
          "an Apple Intelligence update this spring",
          "https://www.theverge.com/2024/7/7/24193619/apple-intelligence-better-siri-ios-18-4-spring-public-launch"
        ],
        [
          " that will allow it to take action in apps through something known as App Intents. Developers will be able to surface certain actions — like ordering the pizza that AI proponents keep promising — so they’re accessible at the system level by Siri. Google seems to be preparing "
        ],
        [
          "a similar framework in Android 16",
          "https://www.theverge.com/2024/11/22/24303329/google-gemini-android-16-app-functions"
        ],
        [
          ", which could help bridge the gap between Gemini and individual apps without the apps needing an entire extension. And who knows? "
        ],
        [
          "Maybe Bixby will get in the game",
          "https://www.theverge.com/2024/4/1/24118253/samsung-galaxy-ai-bixby-voice-assistant"
        ],
        [", too."]
      ],
      [
        [
          "The trouble is, after a full year of supposedly game-changing AI on our mobile devices that amounted to nothing, it’s starting to sound like the phone makers are crying wolf. The real AI smartphones need to stand up pretty soon — before our collective patience starts to run out."
        ]
      ],
      [["Photography by Allison Johnson / The Verge "]]
    ]
  ],
  "https://www.theverge.com/23774468/clear-transparent-tech-gadgets-news-announcements-products": [
    ["Umar Shakir"],
    ["verge", "front-page", "tech", "news", "gadgets", "storystream"],
    "It’s clearly time: all the news about the transparent tech renaissance",
    "Share this story",
    [
      [
        [
          "Gadgets, much like fashion, can make style comebacks. For tech: we’ve lived through the ’80s "
        ],
        [
          "beige keyboards",
          "https://www.theverge.com/2014/10/7/6882427/king-of-keys"
        ],
        [", transitioned to the ’90s with "],
        [
          "gray and black plastic",
          "https://www.theverge.com/2014/12/9/7362193/playstation-4-20th-anniversary-photos"
        ],
        [" video game systems plus "],
        [
          "bright colors",
          "https://www.theverge.com/circuitbreaker/2019/8/30/20840337/sony-walkman-in-the-park-tokyo-exhibit-anniversary"
        ],
        [
          " for Sony’s Walkman and Nintendo’s Game Boy handhelds, and then, at the turn of the millennium, welcomed the amazing "
        ],
        ["see-through", "https://www.youtube.com/watch?v=awZv4Ok4rlc"],
        [" iMacs, N64 controllers, and other gadgets with clear casings."]
      ],
      [
        [
          "And just like the return of grunge makeup and baggy jeans, transparent tech is back. See-through devices are leapfrogging over the ’00s "
        ],
        [
          "piano white iPods",
          "https://www.theverge.com/2016/10/23/13359534/ipod-mini-nano-touch-shuffle-15-years-visual-history-apple"
        ],
        [", ’10s "],
        [
          "matte black smartphones",
          "https://www.theverge.com/2012/5/11/3012990/htc-evo-4g-lte-review"
        ],
        [", and some of today’s "],
        [
          "colored aluminum",
          "https://www.theverge.com/2021/4/20/22394034/apple-new-imac-m1-chip-colors-design-specs-price-release-date"
        ],
        [
          " and glass finishes to (hopefully) become the next big trend. Now, we’ve got "
        ],
        [
          "clear smartphones",
          "https://www.theverge.com/23219421/nothing-phone-1-review-glyph-notifications-specs-screen-battery-camera-price"
        ],
        [" like the Nothing Phone, "],
        [
          "see-through earbuds",
          "https://www.theverge.com/23725921/beats-studio-buds-plus-earbuds-review-translucent-clear"
        ],
        [" like the Beats Studio buds, colorful translucent "],
        [
          "shell casings for game consoles",
          "https://www.theverge.com/2023/6/14/23760887/dbrand-retro-darkplates-transparent-ps5-sony-playstation-purple-orange-blue"
        ],
        [", and even chargers and USB-C cables that "],
        [
          "show off some capacitors",
          "https://www.theverge.com/2022/10/25/23423691/nomad-transparent-30w-charger"
        ],
        [" for your pleasure."]
      ],
      [
        ["So dust off your Apple Studio Display "],
        [
          "CRT monitor",
          "https://everymac.com/monitors/apple/studio_cinema/specs/apple_studio_display_17_cl.html"
        ],
        [", Toys R Us-exclusive "],
        [
          "Extreme Green",
          "https://consolevariations.com/collectibles/nintendo-64-extreme-green-controller"
        ],
        [
          " colored N64 controller, and your other favorite transparent gadgets as you scroll through all of our clear tech news."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24326077/i-asked-chatgpt": [
    ["Elizabeth Lopatto"],
    [
      "verge",
      "front-page",
      "ai-artificial-intelligence",
      "tech",
      "internet-culture",
      "culture",
      "entertainment"
    ],
    "Here’s a new way to lose an argument online: the appeal to AI",
    "Not even authority, just the signifiers of authority",
    [
      [
        [
          "I am talking about a phenomenon you might also have noticed: the appeal to AI."
        ]
      ],
      [
        [
          "There’s a good chance you have seen somebody using the appeal to AI online, even heard it aloud. It’s a logical fallacy best summed up in three words: “I asked ChatGPT.” "
        ]
      ],
      [
        [
          "Not all examples use this exact formulation, though it’s the simplest way to summarize the phenomenon. People might use Google Gemini, or Microsoft Copilot, or "
        ],
        [
          "their chatbot girlfriend,",
          "https://www.theverge.com/c/24300623/ai-companions-replika-openai-chatgpt-assistant-romance"
        ],
        [
          " for instance. But the common element is placing reflexive, unwarranted trust in a technical system that isn’t designed to do the thing you’re asking it to do, and then expecting other people to buy into it too."
        ]
      ],
      [
        [
          "And every time I see this appeal to AI, my first thought is the same: Are you fucking stupid or something? For some time now, “I asked ChatGPT” as a phrase has been enough to make me pack it in — I had no further interest in what that person had to say. I’ve mentally filed it alongside the logical fallacies, you know the ones: the strawman, the ad hominem, the Gish gallop, and the no true Scotsman. If I still commented on forums, this would be the kind of thing I’d flame. But the appeal to AI is starting to happen so often that I am going to grit my teeth and try to understand it."
        ]
      ],
      [
        [
          "I’ll start with the simplest: The Musk example — the last one — is a man advertising his product and engaging in propaganda simultaneously. The others are more complex."
        ]
      ],
      [
        [
          "To start with, I find these examples sad. In the case of the mystery illness, the writer turns to ChatGPT for the kind of attention — and answers — they have been unable to get from a doctor. In the case of the “tough love” advice, the querent says they’re “shocked and surprised at the accuracy of the answers,” even though the answers are all generic twaddle you can get from any call-in radio show, right down to “dating apps aren’t the problem, your fear of vulnerability is.” In the case of the skin routine, the writer might as well have gotten one from a women’s magazine — there’s nothing especially bespoke about it. "
        ]
      ],
      [
        [
          "As for the argument about damnation: hell is real and I am already here."
        ]
      ],
      [
        [
          "Systems like ChatGPT, as anyone familiar with large language models knows, predict likely responses to prompts by generating sequences of words based on patterns in a library of training data. There is a huge amount of human-created information online, and so these responses are frequently correct: ask it “what is the capital of California,” for instance, and it will answer with Sacramento, plus another unnecessary sentence. (Among my minor objections to ChatGPT: its answers sound like a sixth grader trying to hit a minimum word count.) Even for more open-ended queries like the ones above, ChatGPT can construct a plausible-sounding answer based on training data. The love and skin advice are generic because countless writers online have given advice exactly like that. "
        ]
      ],
      [
        [
          "The problem is that ChatGPT isn’t trustworthy. ChatGPT’s text sounds confident, and the answers are detailed. This is not the same as being right, but it has the signifiers of being right. It’s not always obviously incorrect, particularly when it comes to answers — as with the love advice — where the querent can easily project. Confirmation bias is real and true and my friend. I’ve "
        ],
        [
          "already written about the kinds of problems",
          "https://www.theverge.com/2024/12/5/24313222/chatgpt-pardon-biden-bush-esquire"
        ],
        [
          " people encounter when they trust an autopredict system with complex factual questions. Yet despite how often these problems crop up, people keep doing exactly that."
        ]
      ],
      [
        [
          "How one establishes trust is a thorny question. As a journalist, I like to show my work — I tell you who said what to me when, or show you what I’ve done to try to confirm something is true. With the fake presidential pardons, I showed you which primary sources I used so you could run a query yourself."
        ]
      ],
      [
        [
          "But trust is also a heuristic, one that can be easily abused. In financial frauds, for instance, the presence of a specific venture capital fund in a round may suggest to other venture capital funds that someone has already done the due diligence required, leading them to skip doing the intensive process themselves. An appeal to authority relies on trust as a heuristic — it’s a practical, if sometimes faulty, measure that can save work."
        ]
      ],
      [
        [
          "The person asking about the mystery illness is making an appeal to AI because humans don’t have answers and they’re desperate. The skincare thing seems like pure laziness. With the person asking for love advice,I just wonder how they got to the point in their lives where they had no human person to ask — how it was they didn’t have a friend who’d watched them interact with other people. With the question of hell, there’s a whiff of “the machine has deemed damnation logical,” which is just fucking embarrassing. "
        ]
      ],
      [
        [
          "The appeal to AI is distinct from “I asked ChatGPT” stories about, say, "
        ],
        [
          "getting it to count the “r”s in “strawberry” ",
          "https://www.theverge.com/2023/5/16/23725747/bard-chatbot-google-neither-artificial-nor-intelligent"
        ],
        ["— it’s not "],
        [
          "testing the limits of the chatbot ",
          "https://www.theverge.com/2023/2/16/23602965/microsoft-bing-ai-sydney-fury-furry-venom"
        ],
        [
          "or engaging with it in some other self-aware way. There are maybe two ways of understanding it. The first is “I asked the magic answer box and it told me,” in much the tone of “well, the Oracle at Delphi said…” The second is, “I asked ChatGPT and can’t be held responsible if it is wrong.”"
        ]
      ],
      [["The second one is lazy. The first is alarming."]],
      [
        [
          "Sam Altman and Elon Musk, among others, share responsibility for the appeal to AI. How long have we listened to captains of the industry say that AI is going to be capable of thinking soon? That it’ll outperform humans and take our jobs? There’s a kind of bovine logic at play here: Elon Musk and Sam Altman are very rich, so they must be very smart — they are richer than you are, and so they are smarter than you are. And they are telling you that the AI can think. Why wouldn’t you believe them? And besides, isn’t the world much cooler if they are right?"
        ]
      ],
      [
        [
          "There’s also a big attention reward for doing an appeal to AI story; Kevin Roose’s "
        ],
        [
          "inane Bing chatbot story is a case in point",
          "https://www.nytimes.com/2023/02/16/technology/bing-chatbot-microsoft-chatgpt.html"
        ],
        [". Sure, it’s credulous and hokey — but "],
        [
          "watching pundits fail the mirror test",
          "https://www.theverge.com/23604075/ai-chatbots-bing-chatgpt-intelligent-sentient-mirror-test"
        ],
        [
          " does tend to get people’s attention. (So much so, in fact, that Roose later wrote a second story where he asked chatbots what "
        ],
        [
          "they thought about him",
          "https://www.nytimes.com/2024/08/30/technology/ai-chatbot-chatgpt-manipulation.html?ref=oembed"
        ],
        [
          ".) On social media, there’s an incentive to put the appeal to AI front and center for engagement; there’s a whole cult of AI influencer weirdos who are more than happy to boost this stuff. If you provide social rewards for stupid behavior, people will engage in stupid behavior. That’s how fads work."
        ]
      ],
      [
        [
          "There’s one more thing and it is Google. Google Search began as an unusually good online directory, but for years, Google has encouraged seeing it as a crystal ball that supplies the "
        ],
        [
          "one true answer",
          "https://searchengineland.com/googles-one-true-answer-problem-featured-snippets-270549"
        ],
        [
          " on command. That was the point of Snippets before the rise of generative AI, and now, the integration of AI answers has taken it several steps further."
        ]
      ],
      [
        [
          "Unfortunately for Google, ChatGPT is a better-looking crystal ball. Let’s say I want to replace the rubber on my windshield wipers. A Google Search return for “replace rubber windscreen wiper” shows me a wide variety of junk, starting with the AI overview. Next to it is a YouTube video. If I scroll down further, there’s a snippet; next to it is a photo. Below that are suggested searches, then more video suggestions, then Reddit forum answers. It’s busy and messy."
        ]
      ],
      [
        [
          "Now let’s go over to ChatGPT. Asking “How do I replace rubber windscreen wiper?” gets me a cleaner layout: a response with sub-headings and steps. I don’t have any immediate link to sources and no way to evaluate whether I’m getting good advice — but I have a clear, authoritative-sounding answer on a clean interface. If you don’t know or care how things work, ChatGPT seems better."
        ]
      ],
      [
        [
          "The appeal to AI is the perfect example for Arthur Clarke’s law: “Any sufficiently advanced technology is indistinguishable from magic.” The technology behind an LLM is sufficiently advanced because the people using it have not bothered to understand it. The result has been an entire new, depressing genre of news story: person relies on generative AI only to get made-up results. I also find it depressing that no matter how many of these there are — whether it’s "
        ],
        [
          "fake presidential pardons",
          "https://www.theverge.com/2024/12/5/24313222/chatgpt-pardon-biden-bush-esquire"
        ],
        [", "],
        [
          "bogus citations",
          "https://www.theverge.com/2024/11/21/24301955/minnesota-deepfake-bill-lawsuit-affidavit-ai"
        ],
        [", "],
        [
          "made up case law",
          "https://www.theverge.com/2023/5/27/23739913/chatgpt-ai-lawsuit-avianca-airlines-chatbot-research"
        ],
        [", or "],
        [
          "fabricated movie quotes",
          "https://www.theverge.com/2024/8/25/24228003/megalopolis-trailer-fake-quotes-ai-generated-eddie-egan-dropped-lionsgate"
        ],
        [" — they seem to make no impact. Hell, even the "],
        [
          "glue on pizza thing",
          "https://www.theverge.com/2024/6/11/24176490/mm-delicious-glue"
        ],
        [" hasn’t stopped “I asked ChatGPT.”"]
      ],
      [
        ["That this is a bullshit machine — "],
        [
          "in the philosophical sense ",
          "https://press.princeton.edu/books/hardcover/9780691122946/on-bullshit?srsltid=AfmBOooBYi80zkMEqVApizEo5kKgZKcXmyuqMsvP0JY3cVGG9xuqFfFs"
        ],
        [
          "— doesn’t seem to bother a lot of querents. An LLM, by its nature, cannot determine whether what it’s saying is true or false. (At least a liar knows what the truth is.) It has no access to the actual world, only to written representations of the world that it “sees” through tokens. "
        ]
      ],
      [
        [
          "So the appeal to AI, then, is the appeal to signifiers of authority. ChatGPT sounds confident, even when it shouldn’t, and its answers are detailed, even when they are wrong. The interface is clean. You don’t have to make a judgment call about what link to click. Some rich guys told you this was going to be smarter than you shortly. A New York Times reporter is doing this exact thing. So why think at all, when the computer can do that for you?"
        ]
      ],
      [
        [
          "I can’t tell how much of this is blithe trust and how much is pure luxury nihilism. In some ways, “the robot will tell me the truth” and “nobody will ever fix anything and Google is wrong anyway so why not trust the robot” amount to the same thing: a lack of faith in the human endeavor, a contempt for human knowledge, and the inability to trust ourselves. I can’t help but feel this is going somewhere very dark. Important people are talking about "
        ],
        [
          "banning the polio vaccine",
          "https://www.nytimes.com/2024/12/13/health/aaron-siri-rfk-jr-vaccines.html"
        ],
        [". Residents of New Jersey are"],
        [
          " pointing lasers at planes",
          "https://www.404media.co/we-are-getting-lasered-nearly-a-dozen-planes-lasered-last-night-during-new-jersey-drone-panic/"
        ],
        [
          " during the busiest travel period of the year. The entire presidential election was "
        ],
        [
          "awash in conspiracy theories",
          "https://www.washingtonpost.com/politics/2024/11/04/election-2024-conspiracy-theories/"
        ],
        [
          ". Besides, isn’t it more fun if aliens are real, there’s a secret cabal running the world, and the AI is actually intelligent?"
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24325168/mclaren-artura-review-hybrid-specs-price": [
    ["Peter Nelson"],
    [
      "verge",
      "front-page",
      "cars",
      "transportation",
      "reviews",
      "guidebook",
      "tech",
      "electric-cars"
    ],
    "McLaren Artura review: a plug-in hybrid for the 1 percent",
    "A hybrid supercar that can run on electricity alone, while still delivering that twin-turbo 3.0-liter V6 experience",
    [
      [
        [
          "It’s no secret that plug-in hybrid electric vehicles (PHEVs) have grown in popularity over the past couple of years. Their flexibility offers the convenience of internal combustion as well as the ability to put in an average day’s driving without it. After all, any amount of electric-only propulsion not only cuts down on tailpipe emissions but also money spent at the pump."
        ]
      ],
      [
        [
          "And when money is little to no object, the convenience factor goes up exponentially. Take the 2025 McLaren Artura, the Woking, UK-based company’s latest entry-level supercar that’s replaced its former 570S. Starting at just over $254,000, this hybrid-electrified supercar may be one of the most versatile, daily-driver-friendly, and thrilling of its kind ever."
        ]
      ],
      [
        [
          "It’s hard to not compare the 2025 McLaren Artura to its direct ancestor: "
        ],
        [
          "the legendary P1 hypercar",
          "https://www.theverge.com/2015/12/15/10213374/mclaren-p1-12000-dollar-scale-model"
        ],
        ["."]
      ],
      [
        [
          "But 10 years later, trickle-down tech has made the Artura a downright bargain. At less than a quarter of the P1’s original $1.5 million sticker, it reaches as many as 19 miles of electric-only range, hits 60mph in 2.6 seconds, goes from zero to 100mph in 5.5 seconds, and will achieve a top speed of 205mph. These are all within range of the P1’s performance figures, but it does so making 690 horsepower and with a similar 3,300 or so pound curb weight to push forth via the rear wheels."
        ]
      ],
      [
        [
          "Putting this trickle-down tech to work makes for a fascinating driving experience. The Artura summons its output from a twin-turbo 3.0-liter V6 engine and axial flux electric motor, bolted up right behind the cockpit. The battery feeding its motor weighs 194 pounds and possesses a net capacity of 7.4kWh; charging to 80 percent takes 2.5 hours via a standard 240V outlet."
        ]
      ],
      [
        [
          "By default, the Artura springs to life in its all-electric mode, creating a unique and interesting symphony along the way. It also has no reverse gear — instead, McLaren utilizes the motor for reverse. Then, if the engine is running, a third clutch sits in the transmission to make the experience as seamless as possible. If you didn’t know, you’d never notice that it only possesses eight forward gears. "
        ]
      ],
      [
        [
          "Once underway, electric-only acceleration was nothing to write home about, but it got up to speed on the street and highway relatively quickly. It was also a relaxing experience, fit for being stuck in traffic or just calmly cruising around town. Lifting off the throttle to trigger regenerative braking felt smooth and easy to modulate. Interestingly, I never found the need to plug the Artura in since, between the engine itself acting as a generator and the normal brake inputs and regen, the battery was always topped up above 15 miles of range."
        ]
      ],
      [
        [
          "I dug the mighty McLaren’s neighborly wake-up, but most of the time, I couldn’t resist clicking the right-hand toggle atop its instrument binnacle to seamlessly fire up the mighty V6 in Sport or Track mode. Its high-pitched growl was more akin to naturally aspirated V12 supercars of yore than the bigger-displacement V8 it replaced in the 570S. The Artura’s Bluetooth and Apple CarPlay-integrated infotainment system was easy to use, and I certainly appreciated its tiny screen size. But I barely utilized it."
        ]
      ],
      [
        [
          "The Artura’s carbon fiber monocoque and aluminum front and rear subframes are joined by fully independent multilink suspension and adaptive dampers. In Comfort and Sport chassis modes, it had an excellent ride quality over LA’s topographically rich — meaning, particularly crappy — street surfaces. Doubling down on daily ability, its comfortable fixed-back driver’s seat was mounted on a manual slider and complemented its spacious, Alcantara-rich interior. "
        ]
      ],
      [
        [
          "Then, thanks to the instrument cluster moving up and down in sync with the steering wheel and the ability to bring the latter incredibly close to my torso, the Artura’s cockpit was one of the most comfortable that I’ve ever sat in — not at the expense of visibility, either, as the view ahead was panoramic, and both direct and over-my-shoulder rear visibility was quite good. This isn’t always the case in most legitimately small supercars."
        ]
      ],
      [
        [
          "Regarding the McLaren Artura’s advanced driver-assistance systems: its radar cruise control performed admirably in stop-and-go highway traffic, particularly under full battery power. However, its lane departure warning was comically inadequate. I appreciated its unique squirrel chatter-like notification that I was about to waft into the next lane, but it often had trouble reading even the most prominently painted lane markers. "
        ]
      ],
      [
        [
          "Still, the Artura’s analogue lane departure warning system — its brilliantly communicative hydraulically assisted power steering — made up for it and contributed to this McLaren being downright thrilling on Southern California’s mountain-top roads."
        ]
      ],
      [
        [
          "With ample clear tarmac ahead of me atop SoCal’s Angeles National Forest, the 2025 McLaren Artura was phenomenal. Thanks to the electric motor filling in any gaps in the turbo-fed torque curve, it launched quite aggressively, making its sub-six-second zero to 100mph time quite believable."
        ]
      ],
      [
        [
          "From there, the Artura displayed seamless, uninterrupted high-speed confidence. Two hundred thirty-five front and 295 rear 19-inch Pirelli P Zero Corsa Summer tires made the most of its finely tuned chassis, possessing immense cornering grip and stability. Its hydraulic steering was extremely communicative, responsive, and busy, relaying every crease in the tarmac at all times — to the point of requiring a firm grip and faster than average hands — just the way any driving aficionado desires. Chassis communication was equally as wonderful, helping determine the best speed through myriad corners with varying grip levels and camber changes."
        ]
      ],
      [
        [
          "Its electric-sourced torque was hard to discern from any turbo-sourced output, and while power felt generally linear across the rev band, it was brutally rapid up high. With the left bank turbocharger bolted up directly behind my ears, I felt like I could hear every PSI of boost getting shoved through the intake valves as the tach needle climbed, in addition to its gloriously high-pitched exhaust tone up top. However, here is where my main gripe lies: even in track mode, the exhaust volume was simply too quiet. It’s designed to be a versatile and everyday supercar, but I wanted to hear a lot more of this thing’s personality when conditions allowed. "
        ]
      ],
      [
        [
          "Once I got my fill of hilariously fun lateral and longitudinal G forces, it was nice to loosen up the Artura’s dampers and switch over to serene, silent EV mode. Having this kind of latitude in a high-performance supercar is the equivalent of a long, hot shower after a hard workout. Then, on one occasion, spending the entire trip back down into the Los Angeles basin with the engine off netted a total trip economy of 26.1mpg."
        ]
      ],
      [
        [
          "The 2025 McLaren Artura may be a quarter-million-dollar supercar, but it’s quite possible to tool around town like any more everyday PHEV, like the Toyota Prius Prime. The same equipment integrated into its powertrain to boost fuel economy also boosts its performance and driving experience to breathtaking levels. On top of it all, it’s a nicely equipped luxury experience featuring a suite of modern ADAS. "
        ]
      ],
      [
        [
          "For anyone after a high-performance machine with all the personality, that’s also as big on versatility and livability as it is on nonstop thrills, McLaren’s latest entry-level offering is hard to disagree with."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/23/24327918/x-premium-plus-subscription-price-increases": [
    ["Jess Weatherbed"],
    ["verge", "front-page", "news", "tech", "twitter", "social"],
    "X raises Premium Plus subscription pricing by almost 40 percent",
    "Prices are increasing in multiple regions to help support ad-free browsing and revenue-sharing payouts.",
    [
      [
        [
          "X has substantially raised the price of its top-tier user subscription in multiple regions to help bolster the platform’s creator payouts. The increase for Premium Plus came into effect on December 21st "
        ],
        ["according to X", "https://help.x.com/en/premium-plus-price-update"],
        [
          ", raising prices in the US from $16 per month to $22, or from $168 to $229 for annual subscriptions."
        ]
      ],
      [
        [
          "Many European countries like France, Germany, and Spain are impacted by a similar increase, taking monthly prices from €16 to €21. Monthly subscribers in Canada (currently paying $20), Australia ($26) and the UK (£16) will also see pricing increased to $26, $35, and £17 respectively. The higher pricing is immediately applicable to new subscribers, with existing users grandfathered into their current rates until January 20th. X’s basic subscription tier remains unaffected."
        ]
      ],
      [
        [
          "The pricing changes for US subscribers are the highest increase introduced since "
        ],
        [
          "Elon Musk purchased the social media platform in 2022.",
          "https://www.theverge.com/2022/10/27/23184519/elon-musk-twitter-acquisition-deal-complete-agreement"
        ],
        [
          " X gave several reasons to justify the price hike, citing that Premium Plus is now completely ad-free — which it described as a “significant enhancement” to the current user experience."
        ]
      ],
      [
        ["X also references changes made to the "],
        [
          "X revenue sharing program in October",
          "https://www.theverge.com/2024/10/9/24266258/x-pay-premium-users-engage-with-each-other"
        ],
        [
          ", saying that subscriptions “now more directly fuels” creator payouts to “reward content quality and engagement rather than ad views alone.” Premium Plus subscribers will additionally receive priority user support, access to additional features like X’s Radar trend monitoring tool, and higher limits on the platform’s Grok AI models."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/22/24327265/canoo-ev-employees-furloughed-mandatory-unpaid-break": [
    ["Wes Davis"],
    [
      "verge",
      "front-page",
      "news",
      "tech",
      "electric-cars",
      "cars",
      "transportation",
      "business"
    ],
    "All of Canoo’s employees are reportedly on a ‘mandatory unpaid break’",
    "The EV startup’s ship continues to sink.",
    [
      [
        [
          "Days after furloughing dozens of its employees without pay, EV startup Canoo told the remainder of its staff they will be on a “mandatory unpaid break” through at least the end of the year, "
        ],
        [
          "TechCrunch reported",
          "https://techcrunch.com/2024/12/20/ev-startup-canoo-places-remaining-employees-on-a-mandatory-unpaid-break/"
        ],
        [
          " Friday. A company email seen by the outlet said employees would be locked out of Canoo’s systems by the end of Friday, with their benefits continuing through the end of this month."
        ]
      ],
      [
        ["The report follows Canoo’s "],
        [
          "announcement",
          "https://www.globenewswire.com/news-release/2024/12/18/2999399/0/en/Canoo-Announces-Furloughs-and-Factory-Idle-as-it-Focuses-on-Finalizing-Securing-Capital.html"
        ],
        [
          " last week that it was idling its Oklahoma factories and furloughing employees while it worked “to finalize securing the capital necessary to move forward with its operations.” As TechCrunch notes, the company reported that it had only about $700,000 left in the bank last month."
        ]
      ],
      [
        ["Also on Friday, the company "],
        [
          "announced",
          "https://investors.canoo.com/news-presentations/press-releases/detail/158/canoo-inc-announces-1-for-20-reverse-stock-split-effective"
        ],
        [
          " a 1-for-20 reverse stock split, effective December 24th. Canoo says the consolidation aims to keep its stock listed on the Nasdaq exchange and attract “a broader group of institutional and retail investors.”"
        ]
      ],
      [
        [
          "Canoo was founded in 2017 to sell electric vans and trucks to adventure-seeking customers but has mostly only ever made vehicles for the US government. As The Verge’s Andrew Hawkins "
        ],
        [
          "wrote last year",
          "https://www.theverge.com/2023/7/12/23792450/canoo-ev-nasa-artemis-defense-government"
        ],
        [
          ", analysts have warned of its risk of insolvency as it’s teetered on the edge of running out of cash since 2022. Canoo has lost a steady stream of executives since then, including "
        ],
        [
          "all of its founders",
          "https://techcrunch.com/2024/09/27/canoo-hit-with-two-supplier-lawsuits-as-last-remaining-co-founder-leaves/"
        ],
        [" and, more recently, its "],
        [
          "CFO and general counsel",
          "https://www.theverge.com/2024/11/5/24289195/canoos-cfo-and-general-counsel-have-resigned"
        ],
        [". "]
      ]
    ]
  ],
  "https://www.theverge.com/24302660/amazon-prime-video-best-2024-shows-streaming": [
    ["Emma Roth"],
    [
      "verge",
      "front-page",
      "tv",
      "entertainment",
      "amazon",
      "tech",
      "streaming-wars",
      "stream-24069579"
    ],
    "10 great shows to stream on Amazon Prime Video from 2024",
    "This year’s Prime Video streaming content was led by adaptations and spinoffs like Fallout and The Lord of the Rings: The Rings of Power.",
    [
      [
        [
          "It’s hard to find a television adaptation of a video game that stays true to the source material, but Prime Video’s Fallout does just that. The first eight episodes take place in the aftermath of a global nuclear disaster, and the show stars Ella Purnell as Lucy MacLean, who emerges from Vault 33 — one of the many shelters for survivors — with a mission to track down her kidnapped father. As she traverses the postapocalyptic wasteland, she encounters Brotherhood of Steel squire Maximus (Aaron Moten) and a ghoul bounty hunter (Walton Goggins). Hijinks ensue."
        ]
      ],
      [
        [
          "The Lord of the Rings: The Rings of Power returned for a second season this year, and it’s just as impressive as the first. The series — set thousands of years prior to the events in J.R.R. Tolkien’s The Hobbit and The Lord of the Rings — picks up at a more peaceful time in Middle-earth’s history. The show goes over the origins of the Rings of Power, introducing you to some familiar characters like Galadriel (Morfydd Clark) and Elrond (Robert Aramayo), along with some new names created for the series."
        ]
      ],
      [
        [
          "Prime Video has released a fourth season of The Boys, the brutally bloody series that shows what happens when the world’s most powerful superheroes get out of control. The latest season builds on the story laid out in the first three seasons, which has the non-superpowered Hugh Campbell (Jack Quaid) working with Billy Butcher (Karl Urban) and other misfits to expose corruption within The Seven, an elite group of heroes closely managed by a multibillion-dollar corporation."
        ]
      ],
      [
        [
          "The Second Best Hospital in the Galaxy is sort of like what you’d get if you crossed Futurama with Grey’s Anatomy. Set in the year 14002, this animated comedy series follows two alien surgeons, Dr. Sleech (Stephanie Hsu) and Dr. Klak (Keke Palmer), who deal with a range of strange — and often silly — conditions, while also managing their relationship with each other and their coworkers. You might hear some other recognizable voices throughout the show, as it features appearances from Natasha Lyonne, Maya Rudolph, and singer Sam Smith."
        ]
      ],
      [
        [
          "Prime Video has released yet another video game adaptation this year: Like a Dragon: Yakuza. The series is loosely based on the Yakuza game franchise, which is known for its goofy take on Japanese gangster life. However, Prime Video’s Yakuza takes on a more serious tone and features a lot more violence. The six-episode series centers around Kazuma Kiryu’s (Ryoma Takeuchi) evolution as a yakuza member across two timelines: 1995 and 2005."
        ]
      ],
      [
        [
          "Cross is the latest take on James Patterson’s Alex Cross book series, with Aldis Hodge playing the titular forensic psychologist and detective. At the start of the series, Cross is ready to take a break from police work following the murder of his wife, but a new case involving the death of a Black Lives Matter activist draws him back to the job, where he must unravel a string of murders across Washington, DC."
        ]
      ],
      [
        [
          "If you’re a fan of animated shows and superheroes, you might want to check out Batman: Caped Crusader. The series, made by Batman: The Animated Series producer Bruce Timm, places a young Batman (Hamish Linklater) inside a version of Gotham City that’s inspired by DC’s classic comic books. The series showcases the rampant criminal activity from across the city over the span of 10 episodes, with appearances from well-known villains like Harley Quinn (Jamie Chung) and Harvey Dent (Diedrich Bader)."
        ]
      ],
      [
        [
          "Mr. & Mrs. Smith offers a twist on the 2005 movie of the same name, following a couple who must pose as a husband and wife despite being complete strangers. While under the guise of “John” (Donald Glover) and “Jane Smith” (Maya Erskine), the duo must carry out a series of missions, all while navigating a fake relationship that starts turning into the real thing."
        ]
      ],
      [
        [
          "Just like the novel My Lady Jane, Prime Video’s adaptation offers an alternative look at 16th-century England, in which Lady Jane Grey (Emily Bader) and her husband Lord Guildford Dudley (Edward Bluemel) were never beheaded and live under the rule of King Edward VI (Jordan Peters). The series, which also features some fantasy elements, was unfortunately canceled after the first season — but it’s still worth a watch if you’re into historical dramas."
        ]
      ],
      [
        [
          "With The Legend of Vox Machina reaching its third season (and with a fourth on the way), now’s a good time to binge-watch the show if you haven’t yet. It’s based on the first campaign played out during the Dungeons & Dragons web series Critical Role, expanding on the story behind the eclectic seven-member group known as Vox Machina as they traverse the world of Exandria. All the voice actors who starred in the original web series, including Matthew Mercer, Marisha Ray, Laura Bailey, Taliesin Jaffe, and others, take on their original roles. "
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/22/24327133/apple-smart-home-doorbell-camera-face-id-unlock": [
    ["Wes Davis"],
    [
      "verge",
      "front-page",
      "news",
      "smart-home",
      "apple-rumors",
      "apple",
      "tech",
      "gadgets"
    ],
    "Apple is working on a doorbell camera with Face ID",
    "The company’s smart home push includes unlocking your door the same way you do your iPhone screen.",
    [
      [
        [
          "Apple is working on a new smart doorbell camera that uses Face ID to unlock your door, according to Bloomberg’s Mark Gurman in "
        ],
        [
          "today’s Power On newsletter",
          "https://www.bloomberg.com/news/newsletters/2024-12-22/apple-explores-amazon-ring-doorbell-competitor-with-face-id-airpods-heart-rate?srnd=undefined"
        ],
        [
          ". The camera could be released by the end of 2025 “at the soonest,” Gurman writes."
        ]
      ],
      [
        [
          "The lock would work just like your iPhone, automatically unlocking your door when you or another resident looks at it. Like biometric login info on other Apple devices, the camera would be equipped with the company’s Secure Enclave chip that stores and processes Face ID information separately from the rest of the system’s hardware."
        ]
      ],
      [
        [
          "Gurman writes that this device will “likely” work with existing third-party HomeKit smart locks and that the company may also partner with a smart lock company “to offer a complete system on day one.”  He expects the camera will make use of Apple’s in-house “Proxima” combination Wi-Fi / Bluetooth chip that’s rumored for new "
        ],
        [
          "HomePod Mini and Apple TV devices",
          "https://www.theverge.com/2024/12/12/24319970/new-apple-homepod-mini-tv-proxima-wifi-bluetooth-chip"
        ],
        [" next year."]
      ],
      [
        [
          "This doorbell camera joins a broader collection of rumors surrounding a renewed Apple push into the smart home that’s centered around Apple Intelligence. Those include another new smart home camera, a possible Apple-branded TV, and new smart home displays — one a simple iPad-like device that magnetically attaches to wall mounts or speaker bases, while another display sits on the end of a robotic arm attached to a larger base. "
        ]
      ]
    ]
  ],
  "https://www.theverge.com/2024/12/22/24325858/iphone-minimalist-homescreen-ios-18-widgets-shortcuts": [
    ["Allison Johnson"],
    [
      "verge",
      "front-page",
      "iphone",
      "apple",
      "tech",
      "apple-ios",
      "featured-story"
    ],
    "An iPhone owner’s guide to living off the app grid",
    "How I hit reset on my homescreen in pursuit of a more peaceful existence.",
    [
      [
        [
          "The app grid, I mean: the rows and rows of app icons on your iPhone’s homescreen. It’s familiar. Safe. It’s how I’ve lived with my various phones over the past decade. But at some point, it started to feel oppressive. "
        ]
      ],
      [
        [
          "All those icons staring at me in the face, vying for my attention. The clutter! The distracting little notification badges! The grid was a reasonable way to organize apps when I had like, ten of them. There are sixty on the iPhone I’m using now, and I set it up from scratch a few months ago. "
        ]
      ],
      [
        [
          "Naturally, living off-grid or in a non-traditional homescreen arrangement has been possible for much longer on Android. Google’s OS lets you keep your screen clear and just find your apps in the app drawer, which is always a swipe away. You can even "
        ],
        [
          "replace the launcher entirely",
          "https://www.theverge.com/2021/2/4/22266910/niagara-android-launcher-minamalist-one-hand-commute"
        ],
        [
          ". But iOS — where every new app you download winds up on your homescreen by default — hasn’t exactly made it easy to abandon the grid. "
        ]
      ],
      [
        ["That "],
        [
          "started to change",
          "https://www.theverge.com/2020/6/22/21291695/apple-ios-14-updates-home-screen-redesign-features-release-date-wwdc-2020"
        ],
        [
          " when iOS 14 added widgets, an app library, and the ability to hide apps from your homescreen — though I haven’t developed the muscle memory to use it much. Now, iOS 18 adds "
        ],
        [
          "even more flexibility",
          "https://www.theverge.com/2024/9/16/24245582/ios-18-review-customization-apple-intelligence-siri"
        ],
        [
          ". You can put apps and widgets anywhere you want on your homescreen, change their colors, and put more functions into the Control Center. But even as the apps and customization options have multiplied, most of us are still using our homescreens in basically the same way as we did with our first smartphones. "
        ]
      ],
      [
        ["With the new options in iOS 18  — and getting "],
        [
          "a peek at other peoples’ well-curated homescreens",
          "https://www.threads.net/@verge/post/Cx5mnDYrpS9?xmt=AQGzRDoicp49d6Dc9GmL022kzusDnBEp07dv8oNj7z2E0A"
        ],
        [
          " — I decided it was time to do a little cleanup. Why should an app I only open once a month when I park downtown take up space on my homescreen year-round? Better yet, does any app deserve to occupy that precious real estate?"
        ]
      ],
      [
        [
          "I spent about an hour deleting icons, arranging widgets, and adding controls to create my new homescreen. The camera control button on the iPhone 16 renders that icon unnecessary; the action button launches the oft-used daycare app, so that could go too. When I was done, my haphazardly maintained system of folders with cute emoji labels was whittled down to just four apps in the dock and a handful of widgets spread across two pages, which I’m affectionately calling “Windows Phone 2.0.” "
        ]
      ],
      [
        [
          "Was it scary? A little. But you know what? I don’t miss those rows of icons at all. Nine out of ten times the app I’m looking for is in the Siri suggested apps that pop up when I open search. If not, I type in the first few letters of the app name and there it is. You could swipe over to the app library, I guess, but I hardly ever do. "
        ]
      ],
      [
        [
          "The biggest drawback is that I’ll see a notification, dismiss it, and then forget about it for days since the app icon and its little red notification badge aren’t in my face anymore. But I missed things here and there even when I was living on the grid, and those badges are a real problem for me: I’m the kind of person who needs to reach badge zero, so I’ll constantly open apps just to clear out the notifications and get the red dot out of my face. Living off the app grid removes this distraction, and it’s the number one thing I appreciate about my new lifestyle."
        ]
      ],
      [
        [
          "“I hate looking for things on my phone,” he told me. “All of this kind of started with me jumping on the bandwagon of ‘I want to use my phone less, and have it be less distracting.” The grayscale shortcut icons on his homescreen cut down on visual clutter, and he doesn’t feel as drawn to opening time-suck apps like TikTok when the icon isn’t right in front of him. Many of the shortcuts also contain drop-down menus, so he can launch right into the task he’s looking for. "
        ]
      ],
      [
        [
          "Best of all, this method allows him to organize his phone by the action he’s trying to take. An icon labeled “Podcasts” launches whatever podcast app he’s using at the moment. If he ever starts using a different app, he’ll keep the same shortcut icon and have it launch a new app. “I don’t have to put a new app in there and get myself used to looking for that icon.” "
        ]
      ],
      [
        [
          "News editor Jay Peters takes a more straightforward approach. Like me, he finds the constant presence of app icons distracting. “If I don’t see the app right on my homescreen I’m way less likely to use it and just scroll with it.” He has a total of seven apps on his homescreen — including three in the dock — and will occasionally allow an app icon back onto the grid if he’s going to be using it a lot in a short period of time. “If I’m going on a big road trip or something, maybe I’ll move the maps app [at the top of the homescreen],” he says, “But otherwise I try and keep it to just these seven apps.”"
        ]
      ],
      [
        [
          "Both of my colleagues have achieved a level of balance in their digital lives that I admire. I also heard from many more who said that they still maintain a homescreen filled with app icons, but they almost always skip the grid and go to Spotlight search when they need to open an app. And none of us knows quite when it happened, but more than one person I talked to agreed that the Siri suggested apps at the top of the search pane got really good at some point in the past. More often than not, the app I’m looking for is right there before I even type a letter into the search bar."
        ]
      ]
    ]
  ],
  "https://www.theverge.com/24306925/best-books-2024-staff-picks-favorites": [
    ["Verge Staff"],
    [
      "verge",
      "front-page",
      "favorites",
      "guidebook",
      "tech",
      "books",
      "entertainment",
      "featured-story",
      "stream-24069579"
    ],
    "The Verge’s favorite books from 2024",
    "Our staff writes about the best books they read over the course of the year.",
    [
      [
        [
          "Read on, and see if there’s anything here that you want to check out during the holidays."
        ]
      ],
      [
        [
          "When recommending novels, I usually try to go with those that come from independent presses or that aren’t on anyone’s bestseller list because there are so many books and authors that don’t get the attention they deserve. However, this year, I’ve gone against my usual habit and chosen two books that are popular and publicized retakes of well-known tales, simply because I could not put either down."
        ]
      ],
      [
        [""],
        [
          "James",
          "https://www.amazon.com/James-Novel-Percival-Everett-ebook/dp/B0C8MGS6GR/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is an incredibly intelligent and insightful retelling of Mark Twain’s Adventures of Huckleberry Finn from the point of view of the boy’s companion, the enslaved man named Jim. And "
        ],
        [
          "The Bright Sword",
          "https://www.amazon.com/Bright-Sword-Novel-King-Arthur-ebook/dp/B0CLKX49LX/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is a fantastic (in both senses of the word) retelling of the mythos of King Arthur that takes place just after Arthur’s death, from the viewpoint of a neglected young man who defies the class system to become a knight. Both books are not only extraordinarily well written but also bring new and unexpected insights into tales that have been so microscopically examined over the years that you’d think there was nothing new to add. But in the case of both of these books, you’d be wrong. "
        ]
      ],
      [
        [
          "Like most millennials, I grew up on a steady diet of daytime Food Network shows when I stayed home from school. "
        ],
        ["Barefoot Contessa", "https://barefootcontessa.com/"],
        [
          " was always my number one. There was some form of procedural satisfaction about watching as this grandmotherly hostess spent hours, seemingly effortlessly, preparing a meal for a 20-person gathering, only to wistfully sigh, smile, and never enjoy the fruits of her own labor. So when I heard the Barefoot Contessa Ina Garten "
        ],
        [
          "was writing a memoir",
          "https://www.amazon.com/Be-Ready-When-Luck-Happens-ebook/dp/B0CW1HXGNY/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [", I knew I was already bought in. "]
      ],
      [
        [
          "I’ll put it plainly: this book is perplexing. From her previous stint as a US nuclear budget analyst to learning how to fly planes to five entire chapters about how she wanted to decorate her Paris apartment, it’s a memoir that will have you constantly asking yourself, “Is this lady for real?” (There is a lot of “quiet money” as an explanation for her various achievements.) It’s a trip!"
        ]
      ],
      [
        [
          "I listened to the audiobook (she narrates), and hearing her lilting, peaceful voice talk about her rough childhood, relationship with her fan-favorite investment banker husband Jeffrey, and her (at the time) radical decision to not have children reminded me that we’re all human and all experience life’s trials. Ina just has the unique ability to make it all look like luck. "
        ]
      ],
      [
        ["Bill Hammack is a professor of engineering who is better known as "],
        [
          "“engineerguy” on YouTube",
          "https://www.youtube.com/@engineerguyvideo"
        ],
        [
          ", where, for years, he’s shared compelling videos breaking down the complex engineering of seemingly simple items we often take for granted. Think diapers, soda cans, and duct tape. His book, "
        ],
        [
          "The Things We Make",
          "https://www.amazon.com/Things-We-Make-Invention-Cathedrals-ebook/dp/B0BTMWYGX2/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          ", does the same thing but provides more in-depth looks at the engineering behind ancient marvels like medieval cathedrals. It’s worth a read just to learn how the microwave was created and eventually found its way into the average home. "
        ]
      ],
      [
        ["This "],
        [
          "deranged collection of linked stories",
          "https://www.amazon.com/Rejection-Fiction-Tony-Tulathimutte-ebook/dp/B0CQMB6HVT/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is so preposterously good that I’ve read lines from it out loud to friends at dinner parties, on the subway, and once, in a public sauna. In this viscerally uncomfortable, laugh-out-loud, straight-up gorgeous book, Tulathimutte scrapes bare the corners of the internet and (forgive me) the contours of the human heart so piercingly that reading it is like a long-range emotional endurance exercise. I can’t stop thinking about it or talking about it. Disclosure: the author is my friend, but that doesn’t mean he’s not a genius. Buy a copy for yourself and for your weirdest, smartest pal. "
        ]
      ],
      [
        ["This will surprise nobody: "],
        [
          "Midnight in Chernobyl",
          "https://www.amazon.com/Midnight-Chernobyl-Greatest-Nuclear-Disaster-ebook/dp/B07GNV7PNH?tag=theverge02-20"
        ],
        [
          " is not an uplifting read. But it is meticulously well reported and an incredibly comprehensive look at the Chernobyl disaster, from the inception of the nuclear power plant to the aftermath visited on generations of people affected by its explosion. It’s all very matter-of-fact but recounts the events before, during, and after the disaster with remarkable humanity and places it all in the broader context of Soviet corruption without ever feeling like a history textbook. It is a thick book, and I could not put it down."
        ]
      ],
      [
        ["On a lighter note, I also picked up "],
        [
          "St. Lucy’s Home for Girls Raised by Wolves",
          "https://www.amazon.com/Lucys-Raised-Wolves-Vintage-Contemporaries-ebook/dp/B000UWW858/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          ", an older collection of short stories from Karen Russell. The way she can just punch you in the guts with a sentence is unfair. The stories mostly feature kids in those awkward middle school-ish / early teen years, and they’re a little (or a lot) surreal. There’s a sleepaway camp for kids with sleeping disorders, a seaside formation of giant conch shells that might be haunted, and the titular home for girls raised by wolves, which is what it says on the tin. It makes you remember how hard it is to be growing up and more than once cracked my heart right open. "
        ]
      ],
      [
        [
          "I read a lot of books this year, but these three stuck out because they made me think a lot about perspective. "
        ],
        [
          "Notes on an Execution",
          "https://www.amazon.com/Notes-Execution-Novel-Danya-Kukafka-ebook/dp/B09292JSZF/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is the story of a serial killer on death row, narrated by both himself and three women whose lives he upended: his mother, his wife’s sister, and the detective chasing him down. "
        ],
        [
          "The Travelling Cat Chronicles",
          "https://www.amazon.com/Travelling-Cat-Chronicles-Hiro-Arikawa-ebook/dp/B07BJL55TB/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is told from the point of view of Nana, a sassy stray cat, as he accompanies his adopted human Satoru across Japan, trying to figure out why Satoru needs to rehome him. (Warning: you might want a tissue box if you’re a cat owner.) Meanwhile, "
        ],
        [
          "The Memory Police",
          "https://www.amazon.com/Memory-Police-Novel-Yoko-Ogawa-ebook/dp/B077RG9JFX/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is a dystopian story of a small island in which the government can make certain people’s memories of objects and things disappear at will — and one person’s choice to hide a friend who can still remember things they shouldn’t. (Its vibe is like The Giver by Lois Lowry, but make it Japanese.)  "
        ]
      ],
      [
        [
          "They’re all different books, but I’ve been thinking about them all year because they deftly dig into why we make the choices we do — and how those choices are viewed and felt by the people around us. Each book made me look in the mirror and think about the sort of person I am and who I want to be. I think that’s the best kind of fiction, really. "
        ]
      ],
      [
        ["My only regret about reading "],
        [
          "The Steerswoman",
          "https://www.amazon.com/Steerswoman-Book-1-ebook/dp/B00HH1U8Z2?tag=theverge02-20"
        ],
        [
          " (and its three sequels) this year is that I did not read it 30 years ago — this book would absolutely have become a formative part of my personal adolescent canon."
        ]
      ],
      [
        [
          "The best way I can describe the Steerswomen is as a wandering order of largely female natural philosophers. They observe, deduce, test, and share knowledge in a slow-motion, preindustrial world, and the way Kirstein lays out her prose and her characters encourages the same in the reader. Several times during the series, I formed conclusions that were not borne out by the evidence and had to discard them — and did not mind doing so because that was just… part of the process. "
        ]
      ],
      [
        [
          "I read a lot of genre fiction, and I love a slow burn, so The Steerswoman fits the brief. But also I admire Kirstein’s respect for the intelligence and wit of both her characters and her readers; she brings you along on the journey and trusts you to understand the people you’re journeying with. Despite starting the series 35 years ago, she’s still slowly adding to it, and to say I am looking forward to a fifth installment in coming years is a massive understatement. I will preorder and devour it when another book comes along. "
        ]
      ],
      [
        [
          "Look, I love clothes. I research them, I buy them, I even make them. Fashion is an essential part of how we express ourselves and our ideas (if you don’t trust me, "
        ],
        [
          "ask Steve Jobs",
          "https://www.theverge.com/2022/8/9/23298201/issey-miyake-dead-steve-jobs-turtlenecks-pioneer-fashion-designer"
        ],
        [
          "). But the journey of how our fashion gets to us is purposely opaque, because the truth is far more upsetting than many of us are ready for — "
        ],
        [
          "especially in this era",
          "https://www.theverge.com/2024/8/27/24229755/shein-child-labor-fast-fasahion-transparency-report"
        ],
        [" of ultrafast, dirt-cheap clothing."]
      ],
      [
        [""],
        [
          "Sofi Thanhauser’s 2022 book",
          "https://www.amazon.com/Threads-Peoples-Clothing-Sofi-Thanhauser-ebook/dp/B08H194VZB/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is a pickax to this wall of secrecy. She traces the hidden history and costs of five types of textiles — linen, cotton, silk, synthetics, and wool — in this deeply reported work. Thanhauser travels to locales like China to learn from the last producer of ancient silk; to the North Carolina town where textile mill workers "
        ],
        [
          "staged large-scale strikes",
          "https://en.wikipedia.org/wiki/Loray_Mill_strike"
        ],
        [
          " in the 1920s; and to Northern England, where conservation groups are protecting local sheep biodiversity. This book isn’t just for fashion people (though they should be the first to read it); it’s for anyone curious about the labor that goes into the luxuries they take for granted. You will never look at a T-shirt the same way again. "
        ]
      ],
      [
        [
          "As someone who is, more often than not, the fattest person in the room, it’s no surprise that I have struggled a lot with my body image and self-worth. That, on top of the guilt over feeling bad about feeling bad, ends up compounding like the interest on my student loans (and because “body positivity” feels like a pipe dream to a girl whose mind is riddled with body dysmorphic brain worms). "
        ]
      ],
      [
        [""],
        [
          "Enter Jessi Kneeland",
          "https://www.amazon.com/Body-Neutral-Revolutionary-Overcoming-Issues-ebook/dp/B0BDD64R2H/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          ", a former personal trainer turned body image coach, whose central thesis revolves around the notion that our body image issues are always a symptom of a larger and more complicated internal conflict. Through this, they share insight on how to identify the true source of a person’s body image issues as well as clearly outlined steps on what to do about it. “Life-changing” is an understatement."
        ]
      ],
      [
        [""],
        [
          "Ta-Nehisi Coates’ latest book",
          "https://www.amazon.com/Message-Ta-Nehisi-Coates-ebook/dp/B0D11H12XZ/ref=tmm_kin_swatch_0?tag=theverge02-20"
        ],
        [
          " is an exploration of the concept of storytelling, told through a series of essays centered around three different locations. Dakar, Senegal, a historic site of the transatlantic slave trade; Columbia, South Carolina, where a school teacher fights an attempted banning of Coates’ own book; and finally, Palestine, where he spends a few days in May 2023 observing the stark contrasts between life in Gaza and Israel. It left me with a sense of optimism (or maybe blind faith?) that despite how hopeless the present moment can feel, our collective imaginations are ever shifting toward something better than before. "
        ]
      ]
    ]
  ]
}
